/* automatically generated by rust-bindgen 0.65.1 */

pub const _VCRT_COMPILER_PREPROCESSOR: u32 = 1;
pub const _SAL_VERSION: u32 = 20;
pub const __SAL_H_VERSION: u32 = 180000000;
pub const _USE_DECLSPECS_FOR_SAL: u32 = 0;
pub const _USE_ATTRIBUTES_FOR_SAL: u32 = 0;
pub const _CRT_PACKING: u32 = 8;
pub const _HAS_EXCEPTIONS: u32 = 1;
pub const _STL_LANG: u32 = 0;
pub const _HAS_CXX17: u32 = 0;
pub const _HAS_CXX20: u32 = 0;
pub const _HAS_CXX23: u32 = 0;
pub const _HAS_NODISCARD: u32 = 0;
pub const _ARM_WINAPI_PARTITION_DESKTOP_SDK_AVAILABLE: u32 = 1;
pub const _CRT_BUILD_DESKTOP_APP: u32 = 1;
pub const _ARGMAX: u32 = 100;
pub const _CRT_INT_MAX: u32 = 2147483647;
pub const _CRT_FUNCTIONS_REQUIRED: u32 = 1;
pub const _CRT_HAS_CXX17: u32 = 0;
pub const _CRT_HAS_C11: u32 = 1;
pub const _CRT_INTERNAL_NONSTDC_NAMES: u32 = 1;
pub const __STDC_SECURE_LIB__: u32 = 200411;
pub const __GOT_SECURE_LIB__: u32 = 200411;
pub const __STDC_WANT_SECURE_LIB__: u32 = 1;
pub const _SECURECRT_FILL_BUFFER_PATTERN: u32 = 254;
pub const _CRT_SECURE_CPP_OVERLOAD_STANDARD_NAMES: u32 = 0;
pub const _CRT_SECURE_CPP_OVERLOAD_STANDARD_NAMES_COUNT: u32 = 0;
pub const _CRT_SECURE_CPP_OVERLOAD_SECURE_NAMES: u32 = 1;
pub const _CRT_SECURE_CPP_OVERLOAD_STANDARD_NAMES_MEMORY: u32 = 0;
pub const _CRT_SECURE_CPP_OVERLOAD_SECURE_NAMES_MEMORY: u32 = 0;
pub const SPV_VERSION: u32 = 67072;
pub const SPV_REVISION: u32 = 1;
pub const SPVC_C_API_VERSION_MAJOR: u32 = 0;
pub const SPVC_C_API_VERSION_MINOR: u32 = 67;
pub const SPVC_C_API_VERSION_PATCH: u32 = 0;
pub const SPVC_COMPILER_OPTION_COMMON_BIT: u32 = 16777216;
pub const SPVC_COMPILER_OPTION_GLSL_BIT: u32 = 33554432;
pub const SPVC_COMPILER_OPTION_HLSL_BIT: u32 = 67108864;
pub const SPVC_COMPILER_OPTION_MSL_BIT: u32 = 134217728;
pub const SPVC_COMPILER_OPTION_LANG_BITS: u32 = 251658240;
pub const SPVC_COMPILER_OPTION_ENUM_BITS: u32 = 16777215;
pub const SPVC_MSL_PUSH_CONSTANT_DESC_SET: i32 = -1;
pub const SPVC_MSL_PUSH_CONSTANT_BINDING: u32 = 0;
pub const SPVC_MSL_SWIZZLE_BUFFER_BINDING: i32 = -2;
pub const SPVC_MSL_BUFFER_SIZE_BUFFER_BINDING: i32 = -3;
pub const SPVC_MSL_ARGUMENT_BUFFER_BINDING: i32 = -4;
pub const SPVC_MSL_AUX_BUFFER_STRUCT_VERSION: u32 = 1;
pub const SPVC_HLSL_PUSH_CONSTANT_DESC_SET: i32 = -1;
pub const SPVC_HLSL_PUSH_CONSTANT_BINDING: u32 = 0;
pub type va_list = *mut ::std::os::raw::c_char;
extern "C" {
    pub fn __va_start(arg1: *mut *mut ::std::os::raw::c_char, ...);
}
pub type __vcrt_bool = bool;
pub type wchar_t = ::std::os::raw::c_ushort;
extern "C" {
    pub fn __security_init_cookie();
}
extern "C" {
    pub fn __security_check_cookie(_StackCookie: usize);
}
extern "C" {
    pub fn __report_gsfailure(_StackCookie: usize) -> !;
}
extern "C" {
    pub static mut __security_cookie: usize;
}
pub type __crt_bool = bool;
extern "C" {
    pub fn _invalid_parameter_noinfo();
}
extern "C" {
    pub fn _invalid_parameter_noinfo_noreturn() -> !;
}
extern "C" {
    pub fn _invoke_watson(
        _Expression: *const wchar_t,
        _FunctionName: *const wchar_t,
        _FileName: *const wchar_t,
        _LineNo: ::std::os::raw::c_uint,
        _Reserved: usize,
    ) -> !;
}
pub type errno_t = ::std::os::raw::c_int;
pub type wint_t = ::std::os::raw::c_ushort;
pub type wctype_t = ::std::os::raw::c_ushort;
pub type __time32_t = ::std::os::raw::c_long;
pub type __time64_t = ::std::os::raw::c_longlong;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __crt_locale_data_public {
    pub _locale_pctype: *const ::std::os::raw::c_ushort,
    pub _locale_mb_cur_max: ::std::os::raw::c_int,
    pub _locale_lc_codepage: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout___crt_locale_data_public() {
    const UNINIT: ::std::mem::MaybeUninit<__crt_locale_data_public> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__crt_locale_data_public>(),
        16usize,
        concat!("Size of: ", stringify!(__crt_locale_data_public))
    );
    assert_eq!(
        ::std::mem::align_of::<__crt_locale_data_public>(),
        8usize,
        concat!("Alignment of ", stringify!(__crt_locale_data_public))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._locale_pctype) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__crt_locale_data_public),
            "::",
            stringify!(_locale_pctype)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._locale_mb_cur_max) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__crt_locale_data_public),
            "::",
            stringify!(_locale_mb_cur_max)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._locale_lc_codepage) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(__crt_locale_data_public),
            "::",
            stringify!(_locale_lc_codepage)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __crt_locale_pointers {
    pub locinfo: *mut __crt_locale_data,
    pub mbcinfo: *mut __crt_multibyte_data,
}
#[test]
fn bindgen_test_layout___crt_locale_pointers() {
    const UNINIT: ::std::mem::MaybeUninit<__crt_locale_pointers> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<__crt_locale_pointers>(),
        16usize,
        concat!("Size of: ", stringify!(__crt_locale_pointers))
    );
    assert_eq!(
        ::std::mem::align_of::<__crt_locale_pointers>(),
        8usize,
        concat!("Alignment of ", stringify!(__crt_locale_pointers))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).locinfo) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(__crt_locale_pointers),
            "::",
            stringify!(locinfo)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mbcinfo) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(__crt_locale_pointers),
            "::",
            stringify!(mbcinfo)
        )
    );
}
pub type _locale_t = *mut __crt_locale_pointers;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _Mbstatet {
    pub _Wchar: ::std::os::raw::c_ulong,
    pub _Byte: ::std::os::raw::c_ushort,
    pub _State: ::std::os::raw::c_ushort,
}
#[test]
fn bindgen_test_layout__Mbstatet() {
    const UNINIT: ::std::mem::MaybeUninit<_Mbstatet> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_Mbstatet>(),
        8usize,
        concat!("Size of: ", stringify!(_Mbstatet))
    );
    assert_eq!(
        ::std::mem::align_of::<_Mbstatet>(),
        4usize,
        concat!("Alignment of ", stringify!(_Mbstatet))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._Wchar) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_Mbstatet),
            "::",
            stringify!(_Wchar)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._Byte) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(_Mbstatet),
            "::",
            stringify!(_Byte)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._State) as usize - ptr as usize },
        6usize,
        concat!(
            "Offset of field: ",
            stringify!(_Mbstatet),
            "::",
            stringify!(_State)
        )
    );
}
pub type mbstate_t = _Mbstatet;
pub type time_t = __time64_t;
pub type rsize_t = usize;
extern "C" {
    pub fn _errno() -> *mut ::std::os::raw::c_int;
}
extern "C" {
    pub fn _set_errno(_Value: ::std::os::raw::c_int) -> errno_t;
}
extern "C" {
    pub fn _get_errno(_Value: *mut ::std::os::raw::c_int) -> errno_t;
}
extern "C" {
    pub fn __threadid() -> ::std::os::raw::c_ulong;
}
extern "C" {
    pub fn __threadhandle() -> usize;
}
pub type SpvId = ::std::os::raw::c_uint;
pub const SpvMagicNumber: ::std::os::raw::c_uint = 119734787;
pub const SpvVersion: ::std::os::raw::c_uint = 67072;
pub const SpvRevision: ::std::os::raw::c_uint = 1;
pub const SpvOpCodeMask: ::std::os::raw::c_uint = 65535;
pub const SpvWordCountShift: ::std::os::raw::c_uint = 16;
pub const SpvSourceLanguage__SpvSourceLanguageUnknown: SpvSourceLanguage_ = 0;
pub const SpvSourceLanguage__SpvSourceLanguageESSL: SpvSourceLanguage_ = 1;
pub const SpvSourceLanguage__SpvSourceLanguageGLSL: SpvSourceLanguage_ = 2;
pub const SpvSourceLanguage__SpvSourceLanguageOpenCL_C: SpvSourceLanguage_ = 3;
pub const SpvSourceLanguage__SpvSourceLanguageOpenCL_CPP: SpvSourceLanguage_ = 4;
pub const SpvSourceLanguage__SpvSourceLanguageHLSL: SpvSourceLanguage_ = 5;
pub const SpvSourceLanguage__SpvSourceLanguageCPP_for_OpenCL: SpvSourceLanguage_ = 6;
pub const SpvSourceLanguage__SpvSourceLanguageSYCL: SpvSourceLanguage_ = 7;
pub const SpvSourceLanguage__SpvSourceLanguageHERO_C: SpvSourceLanguage_ = 8;
pub const SpvSourceLanguage__SpvSourceLanguageNZSL: SpvSourceLanguage_ = 9;
pub const SpvSourceLanguage__SpvSourceLanguageWGSL: SpvSourceLanguage_ = 10;
pub const SpvSourceLanguage__SpvSourceLanguageSlang: SpvSourceLanguage_ = 11;
pub const SpvSourceLanguage__SpvSourceLanguageZig: SpvSourceLanguage_ = 12;
pub const SpvSourceLanguage__SpvSourceLanguageRust: SpvSourceLanguage_ = 13;
pub const SpvSourceLanguage__SpvSourceLanguageMax: SpvSourceLanguage_ = 2147483647;
pub type SpvSourceLanguage_ = ::std::os::raw::c_int;
pub use self::SpvSourceLanguage_ as SpvSourceLanguage;
pub const SpvExecutionModel__SpvExecutionModelVertex: SpvExecutionModel_ = 0;
pub const SpvExecutionModel__SpvExecutionModelTessellationControl: SpvExecutionModel_ = 1;
pub const SpvExecutionModel__SpvExecutionModelTessellationEvaluation: SpvExecutionModel_ = 2;
pub const SpvExecutionModel__SpvExecutionModelGeometry: SpvExecutionModel_ = 3;
pub const SpvExecutionModel__SpvExecutionModelFragment: SpvExecutionModel_ = 4;
pub const SpvExecutionModel__SpvExecutionModelGLCompute: SpvExecutionModel_ = 5;
pub const SpvExecutionModel__SpvExecutionModelKernel: SpvExecutionModel_ = 6;
pub const SpvExecutionModel__SpvExecutionModelTaskNV: SpvExecutionModel_ = 5267;
pub const SpvExecutionModel__SpvExecutionModelMeshNV: SpvExecutionModel_ = 5268;
pub const SpvExecutionModel__SpvExecutionModelRayGenerationKHR: SpvExecutionModel_ = 5313;
pub const SpvExecutionModel__SpvExecutionModelRayGenerationNV: SpvExecutionModel_ = 5313;
pub const SpvExecutionModel__SpvExecutionModelIntersectionKHR: SpvExecutionModel_ = 5314;
pub const SpvExecutionModel__SpvExecutionModelIntersectionNV: SpvExecutionModel_ = 5314;
pub const SpvExecutionModel__SpvExecutionModelAnyHitKHR: SpvExecutionModel_ = 5315;
pub const SpvExecutionModel__SpvExecutionModelAnyHitNV: SpvExecutionModel_ = 5315;
pub const SpvExecutionModel__SpvExecutionModelClosestHitKHR: SpvExecutionModel_ = 5316;
pub const SpvExecutionModel__SpvExecutionModelClosestHitNV: SpvExecutionModel_ = 5316;
pub const SpvExecutionModel__SpvExecutionModelMissKHR: SpvExecutionModel_ = 5317;
pub const SpvExecutionModel__SpvExecutionModelMissNV: SpvExecutionModel_ = 5317;
pub const SpvExecutionModel__SpvExecutionModelCallableKHR: SpvExecutionModel_ = 5318;
pub const SpvExecutionModel__SpvExecutionModelCallableNV: SpvExecutionModel_ = 5318;
pub const SpvExecutionModel__SpvExecutionModelTaskEXT: SpvExecutionModel_ = 5364;
pub const SpvExecutionModel__SpvExecutionModelMeshEXT: SpvExecutionModel_ = 5365;
pub const SpvExecutionModel__SpvExecutionModelMax: SpvExecutionModel_ = 2147483647;
pub type SpvExecutionModel_ = ::std::os::raw::c_int;
pub use self::SpvExecutionModel_ as SpvExecutionModel;
pub const SpvAddressingModel__SpvAddressingModelLogical: SpvAddressingModel_ = 0;
pub const SpvAddressingModel__SpvAddressingModelPhysical32: SpvAddressingModel_ = 1;
pub const SpvAddressingModel__SpvAddressingModelPhysical64: SpvAddressingModel_ = 2;
pub const SpvAddressingModel__SpvAddressingModelPhysicalStorageBuffer64: SpvAddressingModel_ = 5348;
pub const SpvAddressingModel__SpvAddressingModelPhysicalStorageBuffer64EXT: SpvAddressingModel_ =
    5348;
pub const SpvAddressingModel__SpvAddressingModelMax: SpvAddressingModel_ = 2147483647;
pub type SpvAddressingModel_ = ::std::os::raw::c_int;
pub use self::SpvAddressingModel_ as SpvAddressingModel;
pub const SpvMemoryModel__SpvMemoryModelSimple: SpvMemoryModel_ = 0;
pub const SpvMemoryModel__SpvMemoryModelGLSL450: SpvMemoryModel_ = 1;
pub const SpvMemoryModel__SpvMemoryModelOpenCL: SpvMemoryModel_ = 2;
pub const SpvMemoryModel__SpvMemoryModelVulkan: SpvMemoryModel_ = 3;
pub const SpvMemoryModel__SpvMemoryModelVulkanKHR: SpvMemoryModel_ = 3;
pub const SpvMemoryModel__SpvMemoryModelMax: SpvMemoryModel_ = 2147483647;
pub type SpvMemoryModel_ = ::std::os::raw::c_int;
pub use self::SpvMemoryModel_ as SpvMemoryModel;
pub const SpvExecutionMode__SpvExecutionModeInvocations: SpvExecutionMode_ = 0;
pub const SpvExecutionMode__SpvExecutionModeSpacingEqual: SpvExecutionMode_ = 1;
pub const SpvExecutionMode__SpvExecutionModeSpacingFractionalEven: SpvExecutionMode_ = 2;
pub const SpvExecutionMode__SpvExecutionModeSpacingFractionalOdd: SpvExecutionMode_ = 3;
pub const SpvExecutionMode__SpvExecutionModeVertexOrderCw: SpvExecutionMode_ = 4;
pub const SpvExecutionMode__SpvExecutionModeVertexOrderCcw: SpvExecutionMode_ = 5;
pub const SpvExecutionMode__SpvExecutionModePixelCenterInteger: SpvExecutionMode_ = 6;
pub const SpvExecutionMode__SpvExecutionModeOriginUpperLeft: SpvExecutionMode_ = 7;
pub const SpvExecutionMode__SpvExecutionModeOriginLowerLeft: SpvExecutionMode_ = 8;
pub const SpvExecutionMode__SpvExecutionModeEarlyFragmentTests: SpvExecutionMode_ = 9;
pub const SpvExecutionMode__SpvExecutionModePointMode: SpvExecutionMode_ = 10;
pub const SpvExecutionMode__SpvExecutionModeXfb: SpvExecutionMode_ = 11;
pub const SpvExecutionMode__SpvExecutionModeDepthReplacing: SpvExecutionMode_ = 12;
pub const SpvExecutionMode__SpvExecutionModeDepthGreater: SpvExecutionMode_ = 14;
pub const SpvExecutionMode__SpvExecutionModeDepthLess: SpvExecutionMode_ = 15;
pub const SpvExecutionMode__SpvExecutionModeDepthUnchanged: SpvExecutionMode_ = 16;
pub const SpvExecutionMode__SpvExecutionModeLocalSize: SpvExecutionMode_ = 17;
pub const SpvExecutionMode__SpvExecutionModeLocalSizeHint: SpvExecutionMode_ = 18;
pub const SpvExecutionMode__SpvExecutionModeInputPoints: SpvExecutionMode_ = 19;
pub const SpvExecutionMode__SpvExecutionModeInputLines: SpvExecutionMode_ = 20;
pub const SpvExecutionMode__SpvExecutionModeInputLinesAdjacency: SpvExecutionMode_ = 21;
pub const SpvExecutionMode__SpvExecutionModeTriangles: SpvExecutionMode_ = 22;
pub const SpvExecutionMode__SpvExecutionModeInputTrianglesAdjacency: SpvExecutionMode_ = 23;
pub const SpvExecutionMode__SpvExecutionModeQuads: SpvExecutionMode_ = 24;
pub const SpvExecutionMode__SpvExecutionModeIsolines: SpvExecutionMode_ = 25;
pub const SpvExecutionMode__SpvExecutionModeOutputVertices: SpvExecutionMode_ = 26;
pub const SpvExecutionMode__SpvExecutionModeOutputPoints: SpvExecutionMode_ = 27;
pub const SpvExecutionMode__SpvExecutionModeOutputLineStrip: SpvExecutionMode_ = 28;
pub const SpvExecutionMode__SpvExecutionModeOutputTriangleStrip: SpvExecutionMode_ = 29;
pub const SpvExecutionMode__SpvExecutionModeVecTypeHint: SpvExecutionMode_ = 30;
pub const SpvExecutionMode__SpvExecutionModeContractionOff: SpvExecutionMode_ = 31;
pub const SpvExecutionMode__SpvExecutionModeInitializer: SpvExecutionMode_ = 33;
pub const SpvExecutionMode__SpvExecutionModeFinalizer: SpvExecutionMode_ = 34;
pub const SpvExecutionMode__SpvExecutionModeSubgroupSize: SpvExecutionMode_ = 35;
pub const SpvExecutionMode__SpvExecutionModeSubgroupsPerWorkgroup: SpvExecutionMode_ = 36;
pub const SpvExecutionMode__SpvExecutionModeSubgroupsPerWorkgroupId: SpvExecutionMode_ = 37;
pub const SpvExecutionMode__SpvExecutionModeLocalSizeId: SpvExecutionMode_ = 38;
pub const SpvExecutionMode__SpvExecutionModeLocalSizeHintId: SpvExecutionMode_ = 39;
pub const SpvExecutionMode__SpvExecutionModeNonCoherentColorAttachmentReadEXT: SpvExecutionMode_ =
    4169;
pub const SpvExecutionMode__SpvExecutionModeNonCoherentDepthAttachmentReadEXT: SpvExecutionMode_ =
    4170;
pub const SpvExecutionMode__SpvExecutionModeNonCoherentStencilAttachmentReadEXT: SpvExecutionMode_ =
    4171;
pub const SpvExecutionMode__SpvExecutionModeSubgroupUniformControlFlowKHR: SpvExecutionMode_ = 4421;
pub const SpvExecutionMode__SpvExecutionModePostDepthCoverage: SpvExecutionMode_ = 4446;
pub const SpvExecutionMode__SpvExecutionModeDenormPreserve: SpvExecutionMode_ = 4459;
pub const SpvExecutionMode__SpvExecutionModeDenormFlushToZero: SpvExecutionMode_ = 4460;
pub const SpvExecutionMode__SpvExecutionModeSignedZeroInfNanPreserve: SpvExecutionMode_ = 4461;
pub const SpvExecutionMode__SpvExecutionModeRoundingModeRTE: SpvExecutionMode_ = 4462;
pub const SpvExecutionMode__SpvExecutionModeRoundingModeRTZ: SpvExecutionMode_ = 4463;
pub const SpvExecutionMode__SpvExecutionModeNonCoherentTileAttachmentReadQCOM: SpvExecutionMode_ =
    4489;
pub const SpvExecutionMode__SpvExecutionModeTileShadingRateQCOM: SpvExecutionMode_ = 4490;
pub const SpvExecutionMode__SpvExecutionModeEarlyAndLateFragmentTestsAMD: SpvExecutionMode_ = 5017;
pub const SpvExecutionMode__SpvExecutionModeStencilRefReplacingEXT: SpvExecutionMode_ = 5027;
pub const SpvExecutionMode__SpvExecutionModeCoalescingAMDX: SpvExecutionMode_ = 5069;
pub const SpvExecutionMode__SpvExecutionModeIsApiEntryAMDX: SpvExecutionMode_ = 5070;
pub const SpvExecutionMode__SpvExecutionModeMaxNodeRecursionAMDX: SpvExecutionMode_ = 5071;
pub const SpvExecutionMode__SpvExecutionModeStaticNumWorkgroupsAMDX: SpvExecutionMode_ = 5072;
pub const SpvExecutionMode__SpvExecutionModeShaderIndexAMDX: SpvExecutionMode_ = 5073;
pub const SpvExecutionMode__SpvExecutionModeMaxNumWorkgroupsAMDX: SpvExecutionMode_ = 5077;
pub const SpvExecutionMode__SpvExecutionModeStencilRefUnchangedFrontAMD: SpvExecutionMode_ = 5079;
pub const SpvExecutionMode__SpvExecutionModeStencilRefGreaterFrontAMD: SpvExecutionMode_ = 5080;
pub const SpvExecutionMode__SpvExecutionModeStencilRefLessFrontAMD: SpvExecutionMode_ = 5081;
pub const SpvExecutionMode__SpvExecutionModeStencilRefUnchangedBackAMD: SpvExecutionMode_ = 5082;
pub const SpvExecutionMode__SpvExecutionModeStencilRefGreaterBackAMD: SpvExecutionMode_ = 5083;
pub const SpvExecutionMode__SpvExecutionModeStencilRefLessBackAMD: SpvExecutionMode_ = 5084;
pub const SpvExecutionMode__SpvExecutionModeQuadDerivativesKHR: SpvExecutionMode_ = 5088;
pub const SpvExecutionMode__SpvExecutionModeRequireFullQuadsKHR: SpvExecutionMode_ = 5089;
pub const SpvExecutionMode__SpvExecutionModeSharesInputWithAMDX: SpvExecutionMode_ = 5102;
pub const SpvExecutionMode__SpvExecutionModeOutputLinesEXT: SpvExecutionMode_ = 5269;
pub const SpvExecutionMode__SpvExecutionModeOutputLinesNV: SpvExecutionMode_ = 5269;
pub const SpvExecutionMode__SpvExecutionModeOutputPrimitivesEXT: SpvExecutionMode_ = 5270;
pub const SpvExecutionMode__SpvExecutionModeOutputPrimitivesNV: SpvExecutionMode_ = 5270;
pub const SpvExecutionMode__SpvExecutionModeDerivativeGroupQuadsKHR: SpvExecutionMode_ = 5289;
pub const SpvExecutionMode__SpvExecutionModeDerivativeGroupQuadsNV: SpvExecutionMode_ = 5289;
pub const SpvExecutionMode__SpvExecutionModeDerivativeGroupLinearKHR: SpvExecutionMode_ = 5290;
pub const SpvExecutionMode__SpvExecutionModeDerivativeGroupLinearNV: SpvExecutionMode_ = 5290;
pub const SpvExecutionMode__SpvExecutionModeOutputTrianglesEXT: SpvExecutionMode_ = 5298;
pub const SpvExecutionMode__SpvExecutionModeOutputTrianglesNV: SpvExecutionMode_ = 5298;
pub const SpvExecutionMode__SpvExecutionModePixelInterlockOrderedEXT: SpvExecutionMode_ = 5366;
pub const SpvExecutionMode__SpvExecutionModePixelInterlockUnorderedEXT: SpvExecutionMode_ = 5367;
pub const SpvExecutionMode__SpvExecutionModeSampleInterlockOrderedEXT: SpvExecutionMode_ = 5368;
pub const SpvExecutionMode__SpvExecutionModeSampleInterlockUnorderedEXT: SpvExecutionMode_ = 5369;
pub const SpvExecutionMode__SpvExecutionModeShadingRateInterlockOrderedEXT: SpvExecutionMode_ =
    5370;
pub const SpvExecutionMode__SpvExecutionModeShadingRateInterlockUnorderedEXT: SpvExecutionMode_ =
    5371;
pub const SpvExecutionMode__SpvExecutionModeSharedLocalMemorySizeINTEL: SpvExecutionMode_ = 5618;
pub const SpvExecutionMode__SpvExecutionModeRoundingModeRTPINTEL: SpvExecutionMode_ = 5620;
pub const SpvExecutionMode__SpvExecutionModeRoundingModeRTNINTEL: SpvExecutionMode_ = 5621;
pub const SpvExecutionMode__SpvExecutionModeFloatingPointModeALTINTEL: SpvExecutionMode_ = 5622;
pub const SpvExecutionMode__SpvExecutionModeFloatingPointModeIEEEINTEL: SpvExecutionMode_ = 5623;
pub const SpvExecutionMode__SpvExecutionModeMaxWorkgroupSizeINTEL: SpvExecutionMode_ = 5893;
pub const SpvExecutionMode__SpvExecutionModeMaxWorkDimINTEL: SpvExecutionMode_ = 5894;
pub const SpvExecutionMode__SpvExecutionModeNoGlobalOffsetINTEL: SpvExecutionMode_ = 5895;
pub const SpvExecutionMode__SpvExecutionModeNumSIMDWorkitemsINTEL: SpvExecutionMode_ = 5896;
pub const SpvExecutionMode__SpvExecutionModeSchedulerTargetFmaxMhzINTEL: SpvExecutionMode_ = 5903;
pub const SpvExecutionMode__SpvExecutionModeMaximallyReconvergesKHR: SpvExecutionMode_ = 6023;
pub const SpvExecutionMode__SpvExecutionModeFPFastMathDefault: SpvExecutionMode_ = 6028;
pub const SpvExecutionMode__SpvExecutionModeStreamingInterfaceINTEL: SpvExecutionMode_ = 6154;
pub const SpvExecutionMode__SpvExecutionModeRegisterMapInterfaceINTEL: SpvExecutionMode_ = 6160;
pub const SpvExecutionMode__SpvExecutionModeNamedBarrierCountINTEL: SpvExecutionMode_ = 6417;
pub const SpvExecutionMode__SpvExecutionModeMaximumRegistersINTEL: SpvExecutionMode_ = 6461;
pub const SpvExecutionMode__SpvExecutionModeMaximumRegistersIdINTEL: SpvExecutionMode_ = 6462;
pub const SpvExecutionMode__SpvExecutionModeNamedMaximumRegistersINTEL: SpvExecutionMode_ = 6463;
pub const SpvExecutionMode__SpvExecutionModeMax: SpvExecutionMode_ = 2147483647;
pub type SpvExecutionMode_ = ::std::os::raw::c_int;
pub use self::SpvExecutionMode_ as SpvExecutionMode;
pub const SpvStorageClass__SpvStorageClassUniformConstant: SpvStorageClass_ = 0;
pub const SpvStorageClass__SpvStorageClassInput: SpvStorageClass_ = 1;
pub const SpvStorageClass__SpvStorageClassUniform: SpvStorageClass_ = 2;
pub const SpvStorageClass__SpvStorageClassOutput: SpvStorageClass_ = 3;
pub const SpvStorageClass__SpvStorageClassWorkgroup: SpvStorageClass_ = 4;
pub const SpvStorageClass__SpvStorageClassCrossWorkgroup: SpvStorageClass_ = 5;
pub const SpvStorageClass__SpvStorageClassPrivate: SpvStorageClass_ = 6;
pub const SpvStorageClass__SpvStorageClassFunction: SpvStorageClass_ = 7;
pub const SpvStorageClass__SpvStorageClassGeneric: SpvStorageClass_ = 8;
pub const SpvStorageClass__SpvStorageClassPushConstant: SpvStorageClass_ = 9;
pub const SpvStorageClass__SpvStorageClassAtomicCounter: SpvStorageClass_ = 10;
pub const SpvStorageClass__SpvStorageClassImage: SpvStorageClass_ = 11;
pub const SpvStorageClass__SpvStorageClassStorageBuffer: SpvStorageClass_ = 12;
pub const SpvStorageClass__SpvStorageClassTileImageEXT: SpvStorageClass_ = 4172;
pub const SpvStorageClass__SpvStorageClassTileAttachmentQCOM: SpvStorageClass_ = 4491;
pub const SpvStorageClass__SpvStorageClassNodePayloadAMDX: SpvStorageClass_ = 5068;
pub const SpvStorageClass__SpvStorageClassCallableDataKHR: SpvStorageClass_ = 5328;
pub const SpvStorageClass__SpvStorageClassCallableDataNV: SpvStorageClass_ = 5328;
pub const SpvStorageClass__SpvStorageClassIncomingCallableDataKHR: SpvStorageClass_ = 5329;
pub const SpvStorageClass__SpvStorageClassIncomingCallableDataNV: SpvStorageClass_ = 5329;
pub const SpvStorageClass__SpvStorageClassRayPayloadKHR: SpvStorageClass_ = 5338;
pub const SpvStorageClass__SpvStorageClassRayPayloadNV: SpvStorageClass_ = 5338;
pub const SpvStorageClass__SpvStorageClassHitAttributeKHR: SpvStorageClass_ = 5339;
pub const SpvStorageClass__SpvStorageClassHitAttributeNV: SpvStorageClass_ = 5339;
pub const SpvStorageClass__SpvStorageClassIncomingRayPayloadKHR: SpvStorageClass_ = 5342;
pub const SpvStorageClass__SpvStorageClassIncomingRayPayloadNV: SpvStorageClass_ = 5342;
pub const SpvStorageClass__SpvStorageClassShaderRecordBufferKHR: SpvStorageClass_ = 5343;
pub const SpvStorageClass__SpvStorageClassShaderRecordBufferNV: SpvStorageClass_ = 5343;
pub const SpvStorageClass__SpvStorageClassPhysicalStorageBuffer: SpvStorageClass_ = 5349;
pub const SpvStorageClass__SpvStorageClassPhysicalStorageBufferEXT: SpvStorageClass_ = 5349;
pub const SpvStorageClass__SpvStorageClassHitObjectAttributeNV: SpvStorageClass_ = 5385;
pub const SpvStorageClass__SpvStorageClassTaskPayloadWorkgroupEXT: SpvStorageClass_ = 5402;
pub const SpvStorageClass__SpvStorageClassCodeSectionINTEL: SpvStorageClass_ = 5605;
pub const SpvStorageClass__SpvStorageClassDeviceOnlyINTEL: SpvStorageClass_ = 5936;
pub const SpvStorageClass__SpvStorageClassHostOnlyINTEL: SpvStorageClass_ = 5937;
pub const SpvStorageClass__SpvStorageClassMax: SpvStorageClass_ = 2147483647;
pub type SpvStorageClass_ = ::std::os::raw::c_int;
pub use self::SpvStorageClass_ as SpvStorageClass;
pub const SpvDim__SpvDim1D: SpvDim_ = 0;
pub const SpvDim__SpvDim2D: SpvDim_ = 1;
pub const SpvDim__SpvDim3D: SpvDim_ = 2;
pub const SpvDim__SpvDimCube: SpvDim_ = 3;
pub const SpvDim__SpvDimRect: SpvDim_ = 4;
pub const SpvDim__SpvDimBuffer: SpvDim_ = 5;
pub const SpvDim__SpvDimSubpassData: SpvDim_ = 6;
pub const SpvDim__SpvDimTileImageDataEXT: SpvDim_ = 4173;
pub const SpvDim__SpvDimMax: SpvDim_ = 2147483647;
pub type SpvDim_ = ::std::os::raw::c_int;
pub use self::SpvDim_ as SpvDim;
pub const SpvSamplerAddressingMode__SpvSamplerAddressingModeNone: SpvSamplerAddressingMode_ = 0;
pub const SpvSamplerAddressingMode__SpvSamplerAddressingModeClampToEdge: SpvSamplerAddressingMode_ =
    1;
pub const SpvSamplerAddressingMode__SpvSamplerAddressingModeClamp: SpvSamplerAddressingMode_ = 2;
pub const SpvSamplerAddressingMode__SpvSamplerAddressingModeRepeat: SpvSamplerAddressingMode_ = 3;
pub const SpvSamplerAddressingMode__SpvSamplerAddressingModeRepeatMirrored:
    SpvSamplerAddressingMode_ = 4;
pub const SpvSamplerAddressingMode__SpvSamplerAddressingModeMax: SpvSamplerAddressingMode_ =
    2147483647;
pub type SpvSamplerAddressingMode_ = ::std::os::raw::c_int;
pub use self::SpvSamplerAddressingMode_ as SpvSamplerAddressingMode;
pub const SpvSamplerFilterMode__SpvSamplerFilterModeNearest: SpvSamplerFilterMode_ = 0;
pub const SpvSamplerFilterMode__SpvSamplerFilterModeLinear: SpvSamplerFilterMode_ = 1;
pub const SpvSamplerFilterMode__SpvSamplerFilterModeMax: SpvSamplerFilterMode_ = 2147483647;
pub type SpvSamplerFilterMode_ = ::std::os::raw::c_int;
pub use self::SpvSamplerFilterMode_ as SpvSamplerFilterMode;
pub const SpvImageFormat__SpvImageFormatUnknown: SpvImageFormat_ = 0;
pub const SpvImageFormat__SpvImageFormatRgba32f: SpvImageFormat_ = 1;
pub const SpvImageFormat__SpvImageFormatRgba16f: SpvImageFormat_ = 2;
pub const SpvImageFormat__SpvImageFormatR32f: SpvImageFormat_ = 3;
pub const SpvImageFormat__SpvImageFormatRgba8: SpvImageFormat_ = 4;
pub const SpvImageFormat__SpvImageFormatRgba8Snorm: SpvImageFormat_ = 5;
pub const SpvImageFormat__SpvImageFormatRg32f: SpvImageFormat_ = 6;
pub const SpvImageFormat__SpvImageFormatRg16f: SpvImageFormat_ = 7;
pub const SpvImageFormat__SpvImageFormatR11fG11fB10f: SpvImageFormat_ = 8;
pub const SpvImageFormat__SpvImageFormatR16f: SpvImageFormat_ = 9;
pub const SpvImageFormat__SpvImageFormatRgba16: SpvImageFormat_ = 10;
pub const SpvImageFormat__SpvImageFormatRgb10A2: SpvImageFormat_ = 11;
pub const SpvImageFormat__SpvImageFormatRg16: SpvImageFormat_ = 12;
pub const SpvImageFormat__SpvImageFormatRg8: SpvImageFormat_ = 13;
pub const SpvImageFormat__SpvImageFormatR16: SpvImageFormat_ = 14;
pub const SpvImageFormat__SpvImageFormatR8: SpvImageFormat_ = 15;
pub const SpvImageFormat__SpvImageFormatRgba16Snorm: SpvImageFormat_ = 16;
pub const SpvImageFormat__SpvImageFormatRg16Snorm: SpvImageFormat_ = 17;
pub const SpvImageFormat__SpvImageFormatRg8Snorm: SpvImageFormat_ = 18;
pub const SpvImageFormat__SpvImageFormatR16Snorm: SpvImageFormat_ = 19;
pub const SpvImageFormat__SpvImageFormatR8Snorm: SpvImageFormat_ = 20;
pub const SpvImageFormat__SpvImageFormatRgba32i: SpvImageFormat_ = 21;
pub const SpvImageFormat__SpvImageFormatRgba16i: SpvImageFormat_ = 22;
pub const SpvImageFormat__SpvImageFormatRgba8i: SpvImageFormat_ = 23;
pub const SpvImageFormat__SpvImageFormatR32i: SpvImageFormat_ = 24;
pub const SpvImageFormat__SpvImageFormatRg32i: SpvImageFormat_ = 25;
pub const SpvImageFormat__SpvImageFormatRg16i: SpvImageFormat_ = 26;
pub const SpvImageFormat__SpvImageFormatRg8i: SpvImageFormat_ = 27;
pub const SpvImageFormat__SpvImageFormatR16i: SpvImageFormat_ = 28;
pub const SpvImageFormat__SpvImageFormatR8i: SpvImageFormat_ = 29;
pub const SpvImageFormat__SpvImageFormatRgba32ui: SpvImageFormat_ = 30;
pub const SpvImageFormat__SpvImageFormatRgba16ui: SpvImageFormat_ = 31;
pub const SpvImageFormat__SpvImageFormatRgba8ui: SpvImageFormat_ = 32;
pub const SpvImageFormat__SpvImageFormatR32ui: SpvImageFormat_ = 33;
pub const SpvImageFormat__SpvImageFormatRgb10a2ui: SpvImageFormat_ = 34;
pub const SpvImageFormat__SpvImageFormatRg32ui: SpvImageFormat_ = 35;
pub const SpvImageFormat__SpvImageFormatRg16ui: SpvImageFormat_ = 36;
pub const SpvImageFormat__SpvImageFormatRg8ui: SpvImageFormat_ = 37;
pub const SpvImageFormat__SpvImageFormatR16ui: SpvImageFormat_ = 38;
pub const SpvImageFormat__SpvImageFormatR8ui: SpvImageFormat_ = 39;
pub const SpvImageFormat__SpvImageFormatR64ui: SpvImageFormat_ = 40;
pub const SpvImageFormat__SpvImageFormatR64i: SpvImageFormat_ = 41;
pub const SpvImageFormat__SpvImageFormatMax: SpvImageFormat_ = 2147483647;
pub type SpvImageFormat_ = ::std::os::raw::c_int;
pub use self::SpvImageFormat_ as SpvImageFormat;
pub const SpvImageChannelOrder__SpvImageChannelOrderR: SpvImageChannelOrder_ = 0;
pub const SpvImageChannelOrder__SpvImageChannelOrderA: SpvImageChannelOrder_ = 1;
pub const SpvImageChannelOrder__SpvImageChannelOrderRG: SpvImageChannelOrder_ = 2;
pub const SpvImageChannelOrder__SpvImageChannelOrderRA: SpvImageChannelOrder_ = 3;
pub const SpvImageChannelOrder__SpvImageChannelOrderRGB: SpvImageChannelOrder_ = 4;
pub const SpvImageChannelOrder__SpvImageChannelOrderRGBA: SpvImageChannelOrder_ = 5;
pub const SpvImageChannelOrder__SpvImageChannelOrderBGRA: SpvImageChannelOrder_ = 6;
pub const SpvImageChannelOrder__SpvImageChannelOrderARGB: SpvImageChannelOrder_ = 7;
pub const SpvImageChannelOrder__SpvImageChannelOrderIntensity: SpvImageChannelOrder_ = 8;
pub const SpvImageChannelOrder__SpvImageChannelOrderLuminance: SpvImageChannelOrder_ = 9;
pub const SpvImageChannelOrder__SpvImageChannelOrderRx: SpvImageChannelOrder_ = 10;
pub const SpvImageChannelOrder__SpvImageChannelOrderRGx: SpvImageChannelOrder_ = 11;
pub const SpvImageChannelOrder__SpvImageChannelOrderRGBx: SpvImageChannelOrder_ = 12;
pub const SpvImageChannelOrder__SpvImageChannelOrderDepth: SpvImageChannelOrder_ = 13;
pub const SpvImageChannelOrder__SpvImageChannelOrderDepthStencil: SpvImageChannelOrder_ = 14;
pub const SpvImageChannelOrder__SpvImageChannelOrdersRGB: SpvImageChannelOrder_ = 15;
pub const SpvImageChannelOrder__SpvImageChannelOrdersRGBx: SpvImageChannelOrder_ = 16;
pub const SpvImageChannelOrder__SpvImageChannelOrdersRGBA: SpvImageChannelOrder_ = 17;
pub const SpvImageChannelOrder__SpvImageChannelOrdersBGRA: SpvImageChannelOrder_ = 18;
pub const SpvImageChannelOrder__SpvImageChannelOrderABGR: SpvImageChannelOrder_ = 19;
pub const SpvImageChannelOrder__SpvImageChannelOrderMax: SpvImageChannelOrder_ = 2147483647;
pub type SpvImageChannelOrder_ = ::std::os::raw::c_int;
pub use self::SpvImageChannelOrder_ as SpvImageChannelOrder;
pub const SpvImageChannelDataType__SpvImageChannelDataTypeSnormInt8: SpvImageChannelDataType_ = 0;
pub const SpvImageChannelDataType__SpvImageChannelDataTypeSnormInt16: SpvImageChannelDataType_ = 1;
pub const SpvImageChannelDataType__SpvImageChannelDataTypeUnormInt8: SpvImageChannelDataType_ = 2;
pub const SpvImageChannelDataType__SpvImageChannelDataTypeUnormInt16: SpvImageChannelDataType_ = 3;
pub const SpvImageChannelDataType__SpvImageChannelDataTypeUnormShort565: SpvImageChannelDataType_ =
    4;
pub const SpvImageChannelDataType__SpvImageChannelDataTypeUnormShort555: SpvImageChannelDataType_ =
    5;
pub const SpvImageChannelDataType__SpvImageChannelDataTypeUnormInt101010: SpvImageChannelDataType_ =
    6;
pub const SpvImageChannelDataType__SpvImageChannelDataTypeSignedInt8: SpvImageChannelDataType_ = 7;
pub const SpvImageChannelDataType__SpvImageChannelDataTypeSignedInt16: SpvImageChannelDataType_ = 8;
pub const SpvImageChannelDataType__SpvImageChannelDataTypeSignedInt32: SpvImageChannelDataType_ = 9;
pub const SpvImageChannelDataType__SpvImageChannelDataTypeUnsignedInt8: SpvImageChannelDataType_ =
    10;
pub const SpvImageChannelDataType__SpvImageChannelDataTypeUnsignedInt16: SpvImageChannelDataType_ =
    11;
pub const SpvImageChannelDataType__SpvImageChannelDataTypeUnsignedInt32: SpvImageChannelDataType_ =
    12;
pub const SpvImageChannelDataType__SpvImageChannelDataTypeHalfFloat: SpvImageChannelDataType_ = 13;
pub const SpvImageChannelDataType__SpvImageChannelDataTypeFloat: SpvImageChannelDataType_ = 14;
pub const SpvImageChannelDataType__SpvImageChannelDataTypeUnormInt24: SpvImageChannelDataType_ = 15;
pub const SpvImageChannelDataType__SpvImageChannelDataTypeUnormInt101010_2:
    SpvImageChannelDataType_ = 16;
pub const SpvImageChannelDataType__SpvImageChannelDataTypeUnormInt10X6EXT:
    SpvImageChannelDataType_ = 17;
pub const SpvImageChannelDataType__SpvImageChannelDataTypeUnsignedIntRaw10EXT:
    SpvImageChannelDataType_ = 19;
pub const SpvImageChannelDataType__SpvImageChannelDataTypeUnsignedIntRaw12EXT:
    SpvImageChannelDataType_ = 20;
pub const SpvImageChannelDataType__SpvImageChannelDataTypeUnormInt2_101010EXT:
    SpvImageChannelDataType_ = 21;
pub const SpvImageChannelDataType__SpvImageChannelDataTypeUnsignedInt10X6EXT:
    SpvImageChannelDataType_ = 22;
pub const SpvImageChannelDataType__SpvImageChannelDataTypeUnsignedInt12X4EXT:
    SpvImageChannelDataType_ = 23;
pub const SpvImageChannelDataType__SpvImageChannelDataTypeUnsignedInt14X2EXT:
    SpvImageChannelDataType_ = 24;
pub const SpvImageChannelDataType__SpvImageChannelDataTypeUnormInt12X4EXT:
    SpvImageChannelDataType_ = 25;
pub const SpvImageChannelDataType__SpvImageChannelDataTypeUnormInt14X2EXT:
    SpvImageChannelDataType_ = 26;
pub const SpvImageChannelDataType__SpvImageChannelDataTypeMax: SpvImageChannelDataType_ =
    2147483647;
pub type SpvImageChannelDataType_ = ::std::os::raw::c_int;
pub use self::SpvImageChannelDataType_ as SpvImageChannelDataType;
pub const SpvImageOperandsShift__SpvImageOperandsBiasShift: SpvImageOperandsShift_ = 0;
pub const SpvImageOperandsShift__SpvImageOperandsLodShift: SpvImageOperandsShift_ = 1;
pub const SpvImageOperandsShift__SpvImageOperandsGradShift: SpvImageOperandsShift_ = 2;
pub const SpvImageOperandsShift__SpvImageOperandsConstOffsetShift: SpvImageOperandsShift_ = 3;
pub const SpvImageOperandsShift__SpvImageOperandsOffsetShift: SpvImageOperandsShift_ = 4;
pub const SpvImageOperandsShift__SpvImageOperandsConstOffsetsShift: SpvImageOperandsShift_ = 5;
pub const SpvImageOperandsShift__SpvImageOperandsSampleShift: SpvImageOperandsShift_ = 6;
pub const SpvImageOperandsShift__SpvImageOperandsMinLodShift: SpvImageOperandsShift_ = 7;
pub const SpvImageOperandsShift__SpvImageOperandsMakeTexelAvailableShift: SpvImageOperandsShift_ =
    8;
pub const SpvImageOperandsShift__SpvImageOperandsMakeTexelAvailableKHRShift:
    SpvImageOperandsShift_ = 8;
pub const SpvImageOperandsShift__SpvImageOperandsMakeTexelVisibleShift: SpvImageOperandsShift_ = 9;
pub const SpvImageOperandsShift__SpvImageOperandsMakeTexelVisibleKHRShift: SpvImageOperandsShift_ =
    9;
pub const SpvImageOperandsShift__SpvImageOperandsNonPrivateTexelShift: SpvImageOperandsShift_ = 10;
pub const SpvImageOperandsShift__SpvImageOperandsNonPrivateTexelKHRShift: SpvImageOperandsShift_ =
    10;
pub const SpvImageOperandsShift__SpvImageOperandsVolatileTexelShift: SpvImageOperandsShift_ = 11;
pub const SpvImageOperandsShift__SpvImageOperandsVolatileTexelKHRShift: SpvImageOperandsShift_ = 11;
pub const SpvImageOperandsShift__SpvImageOperandsSignExtendShift: SpvImageOperandsShift_ = 12;
pub const SpvImageOperandsShift__SpvImageOperandsZeroExtendShift: SpvImageOperandsShift_ = 13;
pub const SpvImageOperandsShift__SpvImageOperandsNontemporalShift: SpvImageOperandsShift_ = 14;
pub const SpvImageOperandsShift__SpvImageOperandsOffsetsShift: SpvImageOperandsShift_ = 16;
pub const SpvImageOperandsShift__SpvImageOperandsMax: SpvImageOperandsShift_ = 2147483647;
pub type SpvImageOperandsShift_ = ::std::os::raw::c_int;
pub use self::SpvImageOperandsShift_ as SpvImageOperandsShift;
pub const SpvImageOperandsMask__SpvImageOperandsMaskNone: SpvImageOperandsMask_ = 0;
pub const SpvImageOperandsMask__SpvImageOperandsBiasMask: SpvImageOperandsMask_ = 1;
pub const SpvImageOperandsMask__SpvImageOperandsLodMask: SpvImageOperandsMask_ = 2;
pub const SpvImageOperandsMask__SpvImageOperandsGradMask: SpvImageOperandsMask_ = 4;
pub const SpvImageOperandsMask__SpvImageOperandsConstOffsetMask: SpvImageOperandsMask_ = 8;
pub const SpvImageOperandsMask__SpvImageOperandsOffsetMask: SpvImageOperandsMask_ = 16;
pub const SpvImageOperandsMask__SpvImageOperandsConstOffsetsMask: SpvImageOperandsMask_ = 32;
pub const SpvImageOperandsMask__SpvImageOperandsSampleMask: SpvImageOperandsMask_ = 64;
pub const SpvImageOperandsMask__SpvImageOperandsMinLodMask: SpvImageOperandsMask_ = 128;
pub const SpvImageOperandsMask__SpvImageOperandsMakeTexelAvailableMask: SpvImageOperandsMask_ = 256;
pub const SpvImageOperandsMask__SpvImageOperandsMakeTexelAvailableKHRMask: SpvImageOperandsMask_ =
    256;
pub const SpvImageOperandsMask__SpvImageOperandsMakeTexelVisibleMask: SpvImageOperandsMask_ = 512;
pub const SpvImageOperandsMask__SpvImageOperandsMakeTexelVisibleKHRMask: SpvImageOperandsMask_ =
    512;
pub const SpvImageOperandsMask__SpvImageOperandsNonPrivateTexelMask: SpvImageOperandsMask_ = 1024;
pub const SpvImageOperandsMask__SpvImageOperandsNonPrivateTexelKHRMask: SpvImageOperandsMask_ =
    1024;
pub const SpvImageOperandsMask__SpvImageOperandsVolatileTexelMask: SpvImageOperandsMask_ = 2048;
pub const SpvImageOperandsMask__SpvImageOperandsVolatileTexelKHRMask: SpvImageOperandsMask_ = 2048;
pub const SpvImageOperandsMask__SpvImageOperandsSignExtendMask: SpvImageOperandsMask_ = 4096;
pub const SpvImageOperandsMask__SpvImageOperandsZeroExtendMask: SpvImageOperandsMask_ = 8192;
pub const SpvImageOperandsMask__SpvImageOperandsNontemporalMask: SpvImageOperandsMask_ = 16384;
pub const SpvImageOperandsMask__SpvImageOperandsOffsetsMask: SpvImageOperandsMask_ = 65536;
pub type SpvImageOperandsMask_ = ::std::os::raw::c_int;
pub use self::SpvImageOperandsMask_ as SpvImageOperandsMask;
pub const SpvFPFastMathModeShift__SpvFPFastMathModeNotNaNShift: SpvFPFastMathModeShift_ = 0;
pub const SpvFPFastMathModeShift__SpvFPFastMathModeNotInfShift: SpvFPFastMathModeShift_ = 1;
pub const SpvFPFastMathModeShift__SpvFPFastMathModeNSZShift: SpvFPFastMathModeShift_ = 2;
pub const SpvFPFastMathModeShift__SpvFPFastMathModeAllowRecipShift: SpvFPFastMathModeShift_ = 3;
pub const SpvFPFastMathModeShift__SpvFPFastMathModeFastShift: SpvFPFastMathModeShift_ = 4;
pub const SpvFPFastMathModeShift__SpvFPFastMathModeAllowContractShift: SpvFPFastMathModeShift_ = 16;
pub const SpvFPFastMathModeShift__SpvFPFastMathModeAllowContractFastINTELShift:
    SpvFPFastMathModeShift_ = 16;
pub const SpvFPFastMathModeShift__SpvFPFastMathModeAllowReassocShift: SpvFPFastMathModeShift_ = 17;
pub const SpvFPFastMathModeShift__SpvFPFastMathModeAllowReassocINTELShift: SpvFPFastMathModeShift_ =
    17;
pub const SpvFPFastMathModeShift__SpvFPFastMathModeAllowTransformShift: SpvFPFastMathModeShift_ =
    18;
pub const SpvFPFastMathModeShift__SpvFPFastMathModeMax: SpvFPFastMathModeShift_ = 2147483647;
pub type SpvFPFastMathModeShift_ = ::std::os::raw::c_int;
pub use self::SpvFPFastMathModeShift_ as SpvFPFastMathModeShift;
pub const SpvFPFastMathModeMask__SpvFPFastMathModeMaskNone: SpvFPFastMathModeMask_ = 0;
pub const SpvFPFastMathModeMask__SpvFPFastMathModeNotNaNMask: SpvFPFastMathModeMask_ = 1;
pub const SpvFPFastMathModeMask__SpvFPFastMathModeNotInfMask: SpvFPFastMathModeMask_ = 2;
pub const SpvFPFastMathModeMask__SpvFPFastMathModeNSZMask: SpvFPFastMathModeMask_ = 4;
pub const SpvFPFastMathModeMask__SpvFPFastMathModeAllowRecipMask: SpvFPFastMathModeMask_ = 8;
pub const SpvFPFastMathModeMask__SpvFPFastMathModeFastMask: SpvFPFastMathModeMask_ = 16;
pub const SpvFPFastMathModeMask__SpvFPFastMathModeAllowContractMask: SpvFPFastMathModeMask_ = 65536;
pub const SpvFPFastMathModeMask__SpvFPFastMathModeAllowContractFastINTELMask:
    SpvFPFastMathModeMask_ = 65536;
pub const SpvFPFastMathModeMask__SpvFPFastMathModeAllowReassocMask: SpvFPFastMathModeMask_ = 131072;
pub const SpvFPFastMathModeMask__SpvFPFastMathModeAllowReassocINTELMask: SpvFPFastMathModeMask_ =
    131072;
pub const SpvFPFastMathModeMask__SpvFPFastMathModeAllowTransformMask: SpvFPFastMathModeMask_ =
    262144;
pub type SpvFPFastMathModeMask_ = ::std::os::raw::c_int;
pub use self::SpvFPFastMathModeMask_ as SpvFPFastMathModeMask;
pub const SpvFPRoundingMode__SpvFPRoundingModeRTE: SpvFPRoundingMode_ = 0;
pub const SpvFPRoundingMode__SpvFPRoundingModeRTZ: SpvFPRoundingMode_ = 1;
pub const SpvFPRoundingMode__SpvFPRoundingModeRTP: SpvFPRoundingMode_ = 2;
pub const SpvFPRoundingMode__SpvFPRoundingModeRTN: SpvFPRoundingMode_ = 3;
pub const SpvFPRoundingMode__SpvFPRoundingModeMax: SpvFPRoundingMode_ = 2147483647;
pub type SpvFPRoundingMode_ = ::std::os::raw::c_int;
pub use self::SpvFPRoundingMode_ as SpvFPRoundingMode;
pub const SpvLinkageType__SpvLinkageTypeExport: SpvLinkageType_ = 0;
pub const SpvLinkageType__SpvLinkageTypeImport: SpvLinkageType_ = 1;
pub const SpvLinkageType__SpvLinkageTypeLinkOnceODR: SpvLinkageType_ = 2;
pub const SpvLinkageType__SpvLinkageTypeMax: SpvLinkageType_ = 2147483647;
pub type SpvLinkageType_ = ::std::os::raw::c_int;
pub use self::SpvLinkageType_ as SpvLinkageType;
pub const SpvAccessQualifier__SpvAccessQualifierReadOnly: SpvAccessQualifier_ = 0;
pub const SpvAccessQualifier__SpvAccessQualifierWriteOnly: SpvAccessQualifier_ = 1;
pub const SpvAccessQualifier__SpvAccessQualifierReadWrite: SpvAccessQualifier_ = 2;
pub const SpvAccessQualifier__SpvAccessQualifierMax: SpvAccessQualifier_ = 2147483647;
pub type SpvAccessQualifier_ = ::std::os::raw::c_int;
pub use self::SpvAccessQualifier_ as SpvAccessQualifier;
pub const SpvFunctionParameterAttribute__SpvFunctionParameterAttributeZext:
    SpvFunctionParameterAttribute_ = 0;
pub const SpvFunctionParameterAttribute__SpvFunctionParameterAttributeSext:
    SpvFunctionParameterAttribute_ = 1;
pub const SpvFunctionParameterAttribute__SpvFunctionParameterAttributeByVal:
    SpvFunctionParameterAttribute_ = 2;
pub const SpvFunctionParameterAttribute__SpvFunctionParameterAttributeSret:
    SpvFunctionParameterAttribute_ = 3;
pub const SpvFunctionParameterAttribute__SpvFunctionParameterAttributeNoAlias:
    SpvFunctionParameterAttribute_ = 4;
pub const SpvFunctionParameterAttribute__SpvFunctionParameterAttributeNoCapture:
    SpvFunctionParameterAttribute_ = 5;
pub const SpvFunctionParameterAttribute__SpvFunctionParameterAttributeNoWrite:
    SpvFunctionParameterAttribute_ = 6;
pub const SpvFunctionParameterAttribute__SpvFunctionParameterAttributeNoReadWrite:
    SpvFunctionParameterAttribute_ = 7;
pub const SpvFunctionParameterAttribute__SpvFunctionParameterAttributeRuntimeAlignedINTEL:
    SpvFunctionParameterAttribute_ = 5940;
pub const SpvFunctionParameterAttribute__SpvFunctionParameterAttributeMax:
    SpvFunctionParameterAttribute_ = 2147483647;
pub type SpvFunctionParameterAttribute_ = ::std::os::raw::c_int;
pub use self::SpvFunctionParameterAttribute_ as SpvFunctionParameterAttribute;
pub const SpvDecoration__SpvDecorationRelaxedPrecision: SpvDecoration_ = 0;
pub const SpvDecoration__SpvDecorationSpecId: SpvDecoration_ = 1;
pub const SpvDecoration__SpvDecorationBlock: SpvDecoration_ = 2;
pub const SpvDecoration__SpvDecorationBufferBlock: SpvDecoration_ = 3;
pub const SpvDecoration__SpvDecorationRowMajor: SpvDecoration_ = 4;
pub const SpvDecoration__SpvDecorationColMajor: SpvDecoration_ = 5;
pub const SpvDecoration__SpvDecorationArrayStride: SpvDecoration_ = 6;
pub const SpvDecoration__SpvDecorationMatrixStride: SpvDecoration_ = 7;
pub const SpvDecoration__SpvDecorationGLSLShared: SpvDecoration_ = 8;
pub const SpvDecoration__SpvDecorationGLSLPacked: SpvDecoration_ = 9;
pub const SpvDecoration__SpvDecorationCPacked: SpvDecoration_ = 10;
pub const SpvDecoration__SpvDecorationBuiltIn: SpvDecoration_ = 11;
pub const SpvDecoration__SpvDecorationNoPerspective: SpvDecoration_ = 13;
pub const SpvDecoration__SpvDecorationFlat: SpvDecoration_ = 14;
pub const SpvDecoration__SpvDecorationPatch: SpvDecoration_ = 15;
pub const SpvDecoration__SpvDecorationCentroid: SpvDecoration_ = 16;
pub const SpvDecoration__SpvDecorationSample: SpvDecoration_ = 17;
pub const SpvDecoration__SpvDecorationInvariant: SpvDecoration_ = 18;
pub const SpvDecoration__SpvDecorationRestrict: SpvDecoration_ = 19;
pub const SpvDecoration__SpvDecorationAliased: SpvDecoration_ = 20;
pub const SpvDecoration__SpvDecorationVolatile: SpvDecoration_ = 21;
pub const SpvDecoration__SpvDecorationConstant: SpvDecoration_ = 22;
pub const SpvDecoration__SpvDecorationCoherent: SpvDecoration_ = 23;
pub const SpvDecoration__SpvDecorationNonWritable: SpvDecoration_ = 24;
pub const SpvDecoration__SpvDecorationNonReadable: SpvDecoration_ = 25;
pub const SpvDecoration__SpvDecorationUniform: SpvDecoration_ = 26;
pub const SpvDecoration__SpvDecorationUniformId: SpvDecoration_ = 27;
pub const SpvDecoration__SpvDecorationSaturatedConversion: SpvDecoration_ = 28;
pub const SpvDecoration__SpvDecorationStream: SpvDecoration_ = 29;
pub const SpvDecoration__SpvDecorationLocation: SpvDecoration_ = 30;
pub const SpvDecoration__SpvDecorationComponent: SpvDecoration_ = 31;
pub const SpvDecoration__SpvDecorationIndex: SpvDecoration_ = 32;
pub const SpvDecoration__SpvDecorationBinding: SpvDecoration_ = 33;
pub const SpvDecoration__SpvDecorationDescriptorSet: SpvDecoration_ = 34;
pub const SpvDecoration__SpvDecorationOffset: SpvDecoration_ = 35;
pub const SpvDecoration__SpvDecorationXfbBuffer: SpvDecoration_ = 36;
pub const SpvDecoration__SpvDecorationXfbStride: SpvDecoration_ = 37;
pub const SpvDecoration__SpvDecorationFuncParamAttr: SpvDecoration_ = 38;
pub const SpvDecoration__SpvDecorationFPRoundingMode: SpvDecoration_ = 39;
pub const SpvDecoration__SpvDecorationFPFastMathMode: SpvDecoration_ = 40;
pub const SpvDecoration__SpvDecorationLinkageAttributes: SpvDecoration_ = 41;
pub const SpvDecoration__SpvDecorationNoContraction: SpvDecoration_ = 42;
pub const SpvDecoration__SpvDecorationInputAttachmentIndex: SpvDecoration_ = 43;
pub const SpvDecoration__SpvDecorationAlignment: SpvDecoration_ = 44;
pub const SpvDecoration__SpvDecorationMaxByteOffset: SpvDecoration_ = 45;
pub const SpvDecoration__SpvDecorationAlignmentId: SpvDecoration_ = 46;
pub const SpvDecoration__SpvDecorationMaxByteOffsetId: SpvDecoration_ = 47;
pub const SpvDecoration__SpvDecorationSaturatedToLargestFloat8NormalConversionEXT: SpvDecoration_ =
    4216;
pub const SpvDecoration__SpvDecorationNoSignedWrap: SpvDecoration_ = 4469;
pub const SpvDecoration__SpvDecorationNoUnsignedWrap: SpvDecoration_ = 4470;
pub const SpvDecoration__SpvDecorationWeightTextureQCOM: SpvDecoration_ = 4487;
pub const SpvDecoration__SpvDecorationBlockMatchTextureQCOM: SpvDecoration_ = 4488;
pub const SpvDecoration__SpvDecorationBlockMatchSamplerQCOM: SpvDecoration_ = 4499;
pub const SpvDecoration__SpvDecorationExplicitInterpAMD: SpvDecoration_ = 4999;
pub const SpvDecoration__SpvDecorationNodeSharesPayloadLimitsWithAMDX: SpvDecoration_ = 5019;
pub const SpvDecoration__SpvDecorationNodeMaxPayloadsAMDX: SpvDecoration_ = 5020;
pub const SpvDecoration__SpvDecorationTrackFinishWritingAMDX: SpvDecoration_ = 5078;
pub const SpvDecoration__SpvDecorationPayloadNodeNameAMDX: SpvDecoration_ = 5091;
pub const SpvDecoration__SpvDecorationPayloadNodeBaseIndexAMDX: SpvDecoration_ = 5098;
pub const SpvDecoration__SpvDecorationPayloadNodeSparseArrayAMDX: SpvDecoration_ = 5099;
pub const SpvDecoration__SpvDecorationPayloadNodeArraySizeAMDX: SpvDecoration_ = 5100;
pub const SpvDecoration__SpvDecorationPayloadDispatchIndirectAMDX: SpvDecoration_ = 5105;
pub const SpvDecoration__SpvDecorationOverrideCoverageNV: SpvDecoration_ = 5248;
pub const SpvDecoration__SpvDecorationPassthroughNV: SpvDecoration_ = 5250;
pub const SpvDecoration__SpvDecorationViewportRelativeNV: SpvDecoration_ = 5252;
pub const SpvDecoration__SpvDecorationSecondaryViewportRelativeNV: SpvDecoration_ = 5256;
pub const SpvDecoration__SpvDecorationPerPrimitiveEXT: SpvDecoration_ = 5271;
pub const SpvDecoration__SpvDecorationPerPrimitiveNV: SpvDecoration_ = 5271;
pub const SpvDecoration__SpvDecorationPerViewNV: SpvDecoration_ = 5272;
pub const SpvDecoration__SpvDecorationPerTaskNV: SpvDecoration_ = 5273;
pub const SpvDecoration__SpvDecorationPerVertexKHR: SpvDecoration_ = 5285;
pub const SpvDecoration__SpvDecorationPerVertexNV: SpvDecoration_ = 5285;
pub const SpvDecoration__SpvDecorationNonUniform: SpvDecoration_ = 5300;
pub const SpvDecoration__SpvDecorationNonUniformEXT: SpvDecoration_ = 5300;
pub const SpvDecoration__SpvDecorationRestrictPointer: SpvDecoration_ = 5355;
pub const SpvDecoration__SpvDecorationRestrictPointerEXT: SpvDecoration_ = 5355;
pub const SpvDecoration__SpvDecorationAliasedPointer: SpvDecoration_ = 5356;
pub const SpvDecoration__SpvDecorationAliasedPointerEXT: SpvDecoration_ = 5356;
pub const SpvDecoration__SpvDecorationHitObjectShaderRecordBufferNV: SpvDecoration_ = 5386;
pub const SpvDecoration__SpvDecorationBindlessSamplerNV: SpvDecoration_ = 5398;
pub const SpvDecoration__SpvDecorationBindlessImageNV: SpvDecoration_ = 5399;
pub const SpvDecoration__SpvDecorationBoundSamplerNV: SpvDecoration_ = 5400;
pub const SpvDecoration__SpvDecorationBoundImageNV: SpvDecoration_ = 5401;
pub const SpvDecoration__SpvDecorationSIMTCallINTEL: SpvDecoration_ = 5599;
pub const SpvDecoration__SpvDecorationReferencedIndirectlyINTEL: SpvDecoration_ = 5602;
pub const SpvDecoration__SpvDecorationClobberINTEL: SpvDecoration_ = 5607;
pub const SpvDecoration__SpvDecorationSideEffectsINTEL: SpvDecoration_ = 5608;
pub const SpvDecoration__SpvDecorationVectorComputeVariableINTEL: SpvDecoration_ = 5624;
pub const SpvDecoration__SpvDecorationFuncParamIOKindINTEL: SpvDecoration_ = 5625;
pub const SpvDecoration__SpvDecorationVectorComputeFunctionINTEL: SpvDecoration_ = 5626;
pub const SpvDecoration__SpvDecorationStackCallINTEL: SpvDecoration_ = 5627;
pub const SpvDecoration__SpvDecorationGlobalVariableOffsetINTEL: SpvDecoration_ = 5628;
pub const SpvDecoration__SpvDecorationCounterBuffer: SpvDecoration_ = 5634;
pub const SpvDecoration__SpvDecorationHlslCounterBufferGOOGLE: SpvDecoration_ = 5634;
pub const SpvDecoration__SpvDecorationHlslSemanticGOOGLE: SpvDecoration_ = 5635;
pub const SpvDecoration__SpvDecorationUserSemantic: SpvDecoration_ = 5635;
pub const SpvDecoration__SpvDecorationUserTypeGOOGLE: SpvDecoration_ = 5636;
pub const SpvDecoration__SpvDecorationFunctionRoundingModeINTEL: SpvDecoration_ = 5822;
pub const SpvDecoration__SpvDecorationFunctionDenormModeINTEL: SpvDecoration_ = 5823;
pub const SpvDecoration__SpvDecorationRegisterINTEL: SpvDecoration_ = 5825;
pub const SpvDecoration__SpvDecorationMemoryINTEL: SpvDecoration_ = 5826;
pub const SpvDecoration__SpvDecorationNumbanksINTEL: SpvDecoration_ = 5827;
pub const SpvDecoration__SpvDecorationBankwidthINTEL: SpvDecoration_ = 5828;
pub const SpvDecoration__SpvDecorationMaxPrivateCopiesINTEL: SpvDecoration_ = 5829;
pub const SpvDecoration__SpvDecorationSinglepumpINTEL: SpvDecoration_ = 5830;
pub const SpvDecoration__SpvDecorationDoublepumpINTEL: SpvDecoration_ = 5831;
pub const SpvDecoration__SpvDecorationMaxReplicatesINTEL: SpvDecoration_ = 5832;
pub const SpvDecoration__SpvDecorationSimpleDualPortINTEL: SpvDecoration_ = 5833;
pub const SpvDecoration__SpvDecorationMergeINTEL: SpvDecoration_ = 5834;
pub const SpvDecoration__SpvDecorationBankBitsINTEL: SpvDecoration_ = 5835;
pub const SpvDecoration__SpvDecorationForcePow2DepthINTEL: SpvDecoration_ = 5836;
pub const SpvDecoration__SpvDecorationStridesizeINTEL: SpvDecoration_ = 5883;
pub const SpvDecoration__SpvDecorationWordsizeINTEL: SpvDecoration_ = 5884;
pub const SpvDecoration__SpvDecorationTrueDualPortINTEL: SpvDecoration_ = 5885;
pub const SpvDecoration__SpvDecorationBurstCoalesceINTEL: SpvDecoration_ = 5899;
pub const SpvDecoration__SpvDecorationCacheSizeINTEL: SpvDecoration_ = 5900;
pub const SpvDecoration__SpvDecorationDontStaticallyCoalesceINTEL: SpvDecoration_ = 5901;
pub const SpvDecoration__SpvDecorationPrefetchINTEL: SpvDecoration_ = 5902;
pub const SpvDecoration__SpvDecorationStallEnableINTEL: SpvDecoration_ = 5905;
pub const SpvDecoration__SpvDecorationFuseLoopsInFunctionINTEL: SpvDecoration_ = 5907;
pub const SpvDecoration__SpvDecorationMathOpDSPModeINTEL: SpvDecoration_ = 5909;
pub const SpvDecoration__SpvDecorationAliasScopeINTEL: SpvDecoration_ = 5914;
pub const SpvDecoration__SpvDecorationNoAliasINTEL: SpvDecoration_ = 5915;
pub const SpvDecoration__SpvDecorationInitiationIntervalINTEL: SpvDecoration_ = 5917;
pub const SpvDecoration__SpvDecorationMaxConcurrencyINTEL: SpvDecoration_ = 5918;
pub const SpvDecoration__SpvDecorationPipelineEnableINTEL: SpvDecoration_ = 5919;
pub const SpvDecoration__SpvDecorationBufferLocationINTEL: SpvDecoration_ = 5921;
pub const SpvDecoration__SpvDecorationIOPipeStorageINTEL: SpvDecoration_ = 5944;
pub const SpvDecoration__SpvDecorationFunctionFloatingPointModeINTEL: SpvDecoration_ = 6080;
pub const SpvDecoration__SpvDecorationSingleElementVectorINTEL: SpvDecoration_ = 6085;
pub const SpvDecoration__SpvDecorationVectorComputeCallableFunctionINTEL: SpvDecoration_ = 6087;
pub const SpvDecoration__SpvDecorationMediaBlockIOINTEL: SpvDecoration_ = 6140;
pub const SpvDecoration__SpvDecorationStallFreeINTEL: SpvDecoration_ = 6151;
pub const SpvDecoration__SpvDecorationFPMaxErrorDecorationINTEL: SpvDecoration_ = 6170;
pub const SpvDecoration__SpvDecorationLatencyControlLabelINTEL: SpvDecoration_ = 6172;
pub const SpvDecoration__SpvDecorationLatencyControlConstraintINTEL: SpvDecoration_ = 6173;
pub const SpvDecoration__SpvDecorationConduitKernelArgumentINTEL: SpvDecoration_ = 6175;
pub const SpvDecoration__SpvDecorationRegisterMapKernelArgumentINTEL: SpvDecoration_ = 6176;
pub const SpvDecoration__SpvDecorationMMHostInterfaceAddressWidthINTEL: SpvDecoration_ = 6177;
pub const SpvDecoration__SpvDecorationMMHostInterfaceDataWidthINTEL: SpvDecoration_ = 6178;
pub const SpvDecoration__SpvDecorationMMHostInterfaceLatencyINTEL: SpvDecoration_ = 6179;
pub const SpvDecoration__SpvDecorationMMHostInterfaceReadWriteModeINTEL: SpvDecoration_ = 6180;
pub const SpvDecoration__SpvDecorationMMHostInterfaceMaxBurstINTEL: SpvDecoration_ = 6181;
pub const SpvDecoration__SpvDecorationMMHostInterfaceWaitRequestINTEL: SpvDecoration_ = 6182;
pub const SpvDecoration__SpvDecorationStableKernelArgumentINTEL: SpvDecoration_ = 6183;
pub const SpvDecoration__SpvDecorationHostAccessINTEL: SpvDecoration_ = 6188;
pub const SpvDecoration__SpvDecorationInitModeINTEL: SpvDecoration_ = 6190;
pub const SpvDecoration__SpvDecorationImplementInRegisterMapINTEL: SpvDecoration_ = 6191;
pub const SpvDecoration__SpvDecorationConditionalINTEL: SpvDecoration_ = 6247;
pub const SpvDecoration__SpvDecorationCacheControlLoadINTEL: SpvDecoration_ = 6442;
pub const SpvDecoration__SpvDecorationCacheControlStoreINTEL: SpvDecoration_ = 6443;
pub const SpvDecoration__SpvDecorationMax: SpvDecoration_ = 2147483647;
pub type SpvDecoration_ = ::std::os::raw::c_int;
pub use self::SpvDecoration_ as SpvDecoration;
pub const SpvBuiltIn__SpvBuiltInPosition: SpvBuiltIn_ = 0;
pub const SpvBuiltIn__SpvBuiltInPointSize: SpvBuiltIn_ = 1;
pub const SpvBuiltIn__SpvBuiltInClipDistance: SpvBuiltIn_ = 3;
pub const SpvBuiltIn__SpvBuiltInCullDistance: SpvBuiltIn_ = 4;
pub const SpvBuiltIn__SpvBuiltInVertexId: SpvBuiltIn_ = 5;
pub const SpvBuiltIn__SpvBuiltInInstanceId: SpvBuiltIn_ = 6;
pub const SpvBuiltIn__SpvBuiltInPrimitiveId: SpvBuiltIn_ = 7;
pub const SpvBuiltIn__SpvBuiltInInvocationId: SpvBuiltIn_ = 8;
pub const SpvBuiltIn__SpvBuiltInLayer: SpvBuiltIn_ = 9;
pub const SpvBuiltIn__SpvBuiltInViewportIndex: SpvBuiltIn_ = 10;
pub const SpvBuiltIn__SpvBuiltInTessLevelOuter: SpvBuiltIn_ = 11;
pub const SpvBuiltIn__SpvBuiltInTessLevelInner: SpvBuiltIn_ = 12;
pub const SpvBuiltIn__SpvBuiltInTessCoord: SpvBuiltIn_ = 13;
pub const SpvBuiltIn__SpvBuiltInPatchVertices: SpvBuiltIn_ = 14;
pub const SpvBuiltIn__SpvBuiltInFragCoord: SpvBuiltIn_ = 15;
pub const SpvBuiltIn__SpvBuiltInPointCoord: SpvBuiltIn_ = 16;
pub const SpvBuiltIn__SpvBuiltInFrontFacing: SpvBuiltIn_ = 17;
pub const SpvBuiltIn__SpvBuiltInSampleId: SpvBuiltIn_ = 18;
pub const SpvBuiltIn__SpvBuiltInSamplePosition: SpvBuiltIn_ = 19;
pub const SpvBuiltIn__SpvBuiltInSampleMask: SpvBuiltIn_ = 20;
pub const SpvBuiltIn__SpvBuiltInFragDepth: SpvBuiltIn_ = 22;
pub const SpvBuiltIn__SpvBuiltInHelperInvocation: SpvBuiltIn_ = 23;
pub const SpvBuiltIn__SpvBuiltInNumWorkgroups: SpvBuiltIn_ = 24;
pub const SpvBuiltIn__SpvBuiltInWorkgroupSize: SpvBuiltIn_ = 25;
pub const SpvBuiltIn__SpvBuiltInWorkgroupId: SpvBuiltIn_ = 26;
pub const SpvBuiltIn__SpvBuiltInLocalInvocationId: SpvBuiltIn_ = 27;
pub const SpvBuiltIn__SpvBuiltInGlobalInvocationId: SpvBuiltIn_ = 28;
pub const SpvBuiltIn__SpvBuiltInLocalInvocationIndex: SpvBuiltIn_ = 29;
pub const SpvBuiltIn__SpvBuiltInWorkDim: SpvBuiltIn_ = 30;
pub const SpvBuiltIn__SpvBuiltInGlobalSize: SpvBuiltIn_ = 31;
pub const SpvBuiltIn__SpvBuiltInEnqueuedWorkgroupSize: SpvBuiltIn_ = 32;
pub const SpvBuiltIn__SpvBuiltInGlobalOffset: SpvBuiltIn_ = 33;
pub const SpvBuiltIn__SpvBuiltInGlobalLinearId: SpvBuiltIn_ = 34;
pub const SpvBuiltIn__SpvBuiltInSubgroupSize: SpvBuiltIn_ = 36;
pub const SpvBuiltIn__SpvBuiltInSubgroupMaxSize: SpvBuiltIn_ = 37;
pub const SpvBuiltIn__SpvBuiltInNumSubgroups: SpvBuiltIn_ = 38;
pub const SpvBuiltIn__SpvBuiltInNumEnqueuedSubgroups: SpvBuiltIn_ = 39;
pub const SpvBuiltIn__SpvBuiltInSubgroupId: SpvBuiltIn_ = 40;
pub const SpvBuiltIn__SpvBuiltInSubgroupLocalInvocationId: SpvBuiltIn_ = 41;
pub const SpvBuiltIn__SpvBuiltInVertexIndex: SpvBuiltIn_ = 42;
pub const SpvBuiltIn__SpvBuiltInInstanceIndex: SpvBuiltIn_ = 43;
pub const SpvBuiltIn__SpvBuiltInCoreIDARM: SpvBuiltIn_ = 4160;
pub const SpvBuiltIn__SpvBuiltInCoreCountARM: SpvBuiltIn_ = 4161;
pub const SpvBuiltIn__SpvBuiltInCoreMaxIDARM: SpvBuiltIn_ = 4162;
pub const SpvBuiltIn__SpvBuiltInWarpIDARM: SpvBuiltIn_ = 4163;
pub const SpvBuiltIn__SpvBuiltInWarpMaxIDARM: SpvBuiltIn_ = 4164;
pub const SpvBuiltIn__SpvBuiltInSubgroupEqMask: SpvBuiltIn_ = 4416;
pub const SpvBuiltIn__SpvBuiltInSubgroupEqMaskKHR: SpvBuiltIn_ = 4416;
pub const SpvBuiltIn__SpvBuiltInSubgroupGeMask: SpvBuiltIn_ = 4417;
pub const SpvBuiltIn__SpvBuiltInSubgroupGeMaskKHR: SpvBuiltIn_ = 4417;
pub const SpvBuiltIn__SpvBuiltInSubgroupGtMask: SpvBuiltIn_ = 4418;
pub const SpvBuiltIn__SpvBuiltInSubgroupGtMaskKHR: SpvBuiltIn_ = 4418;
pub const SpvBuiltIn__SpvBuiltInSubgroupLeMask: SpvBuiltIn_ = 4419;
pub const SpvBuiltIn__SpvBuiltInSubgroupLeMaskKHR: SpvBuiltIn_ = 4419;
pub const SpvBuiltIn__SpvBuiltInSubgroupLtMask: SpvBuiltIn_ = 4420;
pub const SpvBuiltIn__SpvBuiltInSubgroupLtMaskKHR: SpvBuiltIn_ = 4420;
pub const SpvBuiltIn__SpvBuiltInBaseVertex: SpvBuiltIn_ = 4424;
pub const SpvBuiltIn__SpvBuiltInBaseInstance: SpvBuiltIn_ = 4425;
pub const SpvBuiltIn__SpvBuiltInDrawIndex: SpvBuiltIn_ = 4426;
pub const SpvBuiltIn__SpvBuiltInPrimitiveShadingRateKHR: SpvBuiltIn_ = 4432;
pub const SpvBuiltIn__SpvBuiltInDeviceIndex: SpvBuiltIn_ = 4438;
pub const SpvBuiltIn__SpvBuiltInViewIndex: SpvBuiltIn_ = 4440;
pub const SpvBuiltIn__SpvBuiltInShadingRateKHR: SpvBuiltIn_ = 4444;
pub const SpvBuiltIn__SpvBuiltInTileOffsetQCOM: SpvBuiltIn_ = 4492;
pub const SpvBuiltIn__SpvBuiltInTileDimensionQCOM: SpvBuiltIn_ = 4493;
pub const SpvBuiltIn__SpvBuiltInTileApronSizeQCOM: SpvBuiltIn_ = 4494;
pub const SpvBuiltIn__SpvBuiltInBaryCoordNoPerspAMD: SpvBuiltIn_ = 4992;
pub const SpvBuiltIn__SpvBuiltInBaryCoordNoPerspCentroidAMD: SpvBuiltIn_ = 4993;
pub const SpvBuiltIn__SpvBuiltInBaryCoordNoPerspSampleAMD: SpvBuiltIn_ = 4994;
pub const SpvBuiltIn__SpvBuiltInBaryCoordSmoothAMD: SpvBuiltIn_ = 4995;
pub const SpvBuiltIn__SpvBuiltInBaryCoordSmoothCentroidAMD: SpvBuiltIn_ = 4996;
pub const SpvBuiltIn__SpvBuiltInBaryCoordSmoothSampleAMD: SpvBuiltIn_ = 4997;
pub const SpvBuiltIn__SpvBuiltInBaryCoordPullModelAMD: SpvBuiltIn_ = 4998;
pub const SpvBuiltIn__SpvBuiltInFragStencilRefEXT: SpvBuiltIn_ = 5014;
pub const SpvBuiltIn__SpvBuiltInRemainingRecursionLevelsAMDX: SpvBuiltIn_ = 5021;
pub const SpvBuiltIn__SpvBuiltInShaderIndexAMDX: SpvBuiltIn_ = 5073;
pub const SpvBuiltIn__SpvBuiltInViewportMaskNV: SpvBuiltIn_ = 5253;
pub const SpvBuiltIn__SpvBuiltInSecondaryPositionNV: SpvBuiltIn_ = 5257;
pub const SpvBuiltIn__SpvBuiltInSecondaryViewportMaskNV: SpvBuiltIn_ = 5258;
pub const SpvBuiltIn__SpvBuiltInPositionPerViewNV: SpvBuiltIn_ = 5261;
pub const SpvBuiltIn__SpvBuiltInViewportMaskPerViewNV: SpvBuiltIn_ = 5262;
pub const SpvBuiltIn__SpvBuiltInFullyCoveredEXT: SpvBuiltIn_ = 5264;
pub const SpvBuiltIn__SpvBuiltInTaskCountNV: SpvBuiltIn_ = 5274;
pub const SpvBuiltIn__SpvBuiltInPrimitiveCountNV: SpvBuiltIn_ = 5275;
pub const SpvBuiltIn__SpvBuiltInPrimitiveIndicesNV: SpvBuiltIn_ = 5276;
pub const SpvBuiltIn__SpvBuiltInClipDistancePerViewNV: SpvBuiltIn_ = 5277;
pub const SpvBuiltIn__SpvBuiltInCullDistancePerViewNV: SpvBuiltIn_ = 5278;
pub const SpvBuiltIn__SpvBuiltInLayerPerViewNV: SpvBuiltIn_ = 5279;
pub const SpvBuiltIn__SpvBuiltInMeshViewCountNV: SpvBuiltIn_ = 5280;
pub const SpvBuiltIn__SpvBuiltInMeshViewIndicesNV: SpvBuiltIn_ = 5281;
pub const SpvBuiltIn__SpvBuiltInBaryCoordKHR: SpvBuiltIn_ = 5286;
pub const SpvBuiltIn__SpvBuiltInBaryCoordNV: SpvBuiltIn_ = 5286;
pub const SpvBuiltIn__SpvBuiltInBaryCoordNoPerspKHR: SpvBuiltIn_ = 5287;
pub const SpvBuiltIn__SpvBuiltInBaryCoordNoPerspNV: SpvBuiltIn_ = 5287;
pub const SpvBuiltIn__SpvBuiltInFragSizeEXT: SpvBuiltIn_ = 5292;
pub const SpvBuiltIn__SpvBuiltInFragmentSizeNV: SpvBuiltIn_ = 5292;
pub const SpvBuiltIn__SpvBuiltInFragInvocationCountEXT: SpvBuiltIn_ = 5293;
pub const SpvBuiltIn__SpvBuiltInInvocationsPerPixelNV: SpvBuiltIn_ = 5293;
pub const SpvBuiltIn__SpvBuiltInPrimitivePointIndicesEXT: SpvBuiltIn_ = 5294;
pub const SpvBuiltIn__SpvBuiltInPrimitiveLineIndicesEXT: SpvBuiltIn_ = 5295;
pub const SpvBuiltIn__SpvBuiltInPrimitiveTriangleIndicesEXT: SpvBuiltIn_ = 5296;
pub const SpvBuiltIn__SpvBuiltInCullPrimitiveEXT: SpvBuiltIn_ = 5299;
pub const SpvBuiltIn__SpvBuiltInLaunchIdKHR: SpvBuiltIn_ = 5319;
pub const SpvBuiltIn__SpvBuiltInLaunchIdNV: SpvBuiltIn_ = 5319;
pub const SpvBuiltIn__SpvBuiltInLaunchSizeKHR: SpvBuiltIn_ = 5320;
pub const SpvBuiltIn__SpvBuiltInLaunchSizeNV: SpvBuiltIn_ = 5320;
pub const SpvBuiltIn__SpvBuiltInWorldRayOriginKHR: SpvBuiltIn_ = 5321;
pub const SpvBuiltIn__SpvBuiltInWorldRayOriginNV: SpvBuiltIn_ = 5321;
pub const SpvBuiltIn__SpvBuiltInWorldRayDirectionKHR: SpvBuiltIn_ = 5322;
pub const SpvBuiltIn__SpvBuiltInWorldRayDirectionNV: SpvBuiltIn_ = 5322;
pub const SpvBuiltIn__SpvBuiltInObjectRayOriginKHR: SpvBuiltIn_ = 5323;
pub const SpvBuiltIn__SpvBuiltInObjectRayOriginNV: SpvBuiltIn_ = 5323;
pub const SpvBuiltIn__SpvBuiltInObjectRayDirectionKHR: SpvBuiltIn_ = 5324;
pub const SpvBuiltIn__SpvBuiltInObjectRayDirectionNV: SpvBuiltIn_ = 5324;
pub const SpvBuiltIn__SpvBuiltInRayTminKHR: SpvBuiltIn_ = 5325;
pub const SpvBuiltIn__SpvBuiltInRayTminNV: SpvBuiltIn_ = 5325;
pub const SpvBuiltIn__SpvBuiltInRayTmaxKHR: SpvBuiltIn_ = 5326;
pub const SpvBuiltIn__SpvBuiltInRayTmaxNV: SpvBuiltIn_ = 5326;
pub const SpvBuiltIn__SpvBuiltInInstanceCustomIndexKHR: SpvBuiltIn_ = 5327;
pub const SpvBuiltIn__SpvBuiltInInstanceCustomIndexNV: SpvBuiltIn_ = 5327;
pub const SpvBuiltIn__SpvBuiltInObjectToWorldKHR: SpvBuiltIn_ = 5330;
pub const SpvBuiltIn__SpvBuiltInObjectToWorldNV: SpvBuiltIn_ = 5330;
pub const SpvBuiltIn__SpvBuiltInWorldToObjectKHR: SpvBuiltIn_ = 5331;
pub const SpvBuiltIn__SpvBuiltInWorldToObjectNV: SpvBuiltIn_ = 5331;
pub const SpvBuiltIn__SpvBuiltInHitTNV: SpvBuiltIn_ = 5332;
pub const SpvBuiltIn__SpvBuiltInHitKindKHR: SpvBuiltIn_ = 5333;
pub const SpvBuiltIn__SpvBuiltInHitKindNV: SpvBuiltIn_ = 5333;
pub const SpvBuiltIn__SpvBuiltInCurrentRayTimeNV: SpvBuiltIn_ = 5334;
pub const SpvBuiltIn__SpvBuiltInHitTriangleVertexPositionsKHR: SpvBuiltIn_ = 5335;
pub const SpvBuiltIn__SpvBuiltInHitMicroTriangleVertexPositionsNV: SpvBuiltIn_ = 5337;
pub const SpvBuiltIn__SpvBuiltInHitMicroTriangleVertexBarycentricsNV: SpvBuiltIn_ = 5344;
pub const SpvBuiltIn__SpvBuiltInIncomingRayFlagsKHR: SpvBuiltIn_ = 5351;
pub const SpvBuiltIn__SpvBuiltInIncomingRayFlagsNV: SpvBuiltIn_ = 5351;
pub const SpvBuiltIn__SpvBuiltInRayGeometryIndexKHR: SpvBuiltIn_ = 5352;
pub const SpvBuiltIn__SpvBuiltInHitIsSphereNV: SpvBuiltIn_ = 5359;
pub const SpvBuiltIn__SpvBuiltInHitIsLSSNV: SpvBuiltIn_ = 5360;
pub const SpvBuiltIn__SpvBuiltInHitSpherePositionNV: SpvBuiltIn_ = 5361;
pub const SpvBuiltIn__SpvBuiltInWarpsPerSMNV: SpvBuiltIn_ = 5374;
pub const SpvBuiltIn__SpvBuiltInSMCountNV: SpvBuiltIn_ = 5375;
pub const SpvBuiltIn__SpvBuiltInWarpIDNV: SpvBuiltIn_ = 5376;
pub const SpvBuiltIn__SpvBuiltInSMIDNV: SpvBuiltIn_ = 5377;
pub const SpvBuiltIn__SpvBuiltInHitLSSPositionsNV: SpvBuiltIn_ = 5396;
pub const SpvBuiltIn__SpvBuiltInHitKindFrontFacingMicroTriangleNV: SpvBuiltIn_ = 5405;
pub const SpvBuiltIn__SpvBuiltInHitKindBackFacingMicroTriangleNV: SpvBuiltIn_ = 5406;
pub const SpvBuiltIn__SpvBuiltInHitSphereRadiusNV: SpvBuiltIn_ = 5420;
pub const SpvBuiltIn__SpvBuiltInHitLSSRadiiNV: SpvBuiltIn_ = 5421;
pub const SpvBuiltIn__SpvBuiltInClusterIDNV: SpvBuiltIn_ = 5436;
pub const SpvBuiltIn__SpvBuiltInCullMaskKHR: SpvBuiltIn_ = 6021;
pub const SpvBuiltIn__SpvBuiltInMax: SpvBuiltIn_ = 2147483647;
pub type SpvBuiltIn_ = ::std::os::raw::c_int;
pub use self::SpvBuiltIn_ as SpvBuiltIn;
pub const SpvSelectionControlShift__SpvSelectionControlFlattenShift: SpvSelectionControlShift_ = 0;
pub const SpvSelectionControlShift__SpvSelectionControlDontFlattenShift: SpvSelectionControlShift_ =
    1;
pub const SpvSelectionControlShift__SpvSelectionControlMax: SpvSelectionControlShift_ = 2147483647;
pub type SpvSelectionControlShift_ = ::std::os::raw::c_int;
pub use self::SpvSelectionControlShift_ as SpvSelectionControlShift;
pub const SpvSelectionControlMask__SpvSelectionControlMaskNone: SpvSelectionControlMask_ = 0;
pub const SpvSelectionControlMask__SpvSelectionControlFlattenMask: SpvSelectionControlMask_ = 1;
pub const SpvSelectionControlMask__SpvSelectionControlDontFlattenMask: SpvSelectionControlMask_ = 2;
pub type SpvSelectionControlMask_ = ::std::os::raw::c_int;
pub use self::SpvSelectionControlMask_ as SpvSelectionControlMask;
pub const SpvLoopControlShift__SpvLoopControlUnrollShift: SpvLoopControlShift_ = 0;
pub const SpvLoopControlShift__SpvLoopControlDontUnrollShift: SpvLoopControlShift_ = 1;
pub const SpvLoopControlShift__SpvLoopControlDependencyInfiniteShift: SpvLoopControlShift_ = 2;
pub const SpvLoopControlShift__SpvLoopControlDependencyLengthShift: SpvLoopControlShift_ = 3;
pub const SpvLoopControlShift__SpvLoopControlMinIterationsShift: SpvLoopControlShift_ = 4;
pub const SpvLoopControlShift__SpvLoopControlMaxIterationsShift: SpvLoopControlShift_ = 5;
pub const SpvLoopControlShift__SpvLoopControlIterationMultipleShift: SpvLoopControlShift_ = 6;
pub const SpvLoopControlShift__SpvLoopControlPeelCountShift: SpvLoopControlShift_ = 7;
pub const SpvLoopControlShift__SpvLoopControlPartialCountShift: SpvLoopControlShift_ = 8;
pub const SpvLoopControlShift__SpvLoopControlInitiationIntervalINTELShift: SpvLoopControlShift_ =
    16;
pub const SpvLoopControlShift__SpvLoopControlMaxConcurrencyINTELShift: SpvLoopControlShift_ = 17;
pub const SpvLoopControlShift__SpvLoopControlDependencyArrayINTELShift: SpvLoopControlShift_ = 18;
pub const SpvLoopControlShift__SpvLoopControlPipelineEnableINTELShift: SpvLoopControlShift_ = 19;
pub const SpvLoopControlShift__SpvLoopControlLoopCoalesceINTELShift: SpvLoopControlShift_ = 20;
pub const SpvLoopControlShift__SpvLoopControlMaxInterleavingINTELShift: SpvLoopControlShift_ = 21;
pub const SpvLoopControlShift__SpvLoopControlSpeculatedIterationsINTELShift: SpvLoopControlShift_ =
    22;
pub const SpvLoopControlShift__SpvLoopControlNoFusionINTELShift: SpvLoopControlShift_ = 23;
pub const SpvLoopControlShift__SpvLoopControlLoopCountINTELShift: SpvLoopControlShift_ = 24;
pub const SpvLoopControlShift__SpvLoopControlMaxReinvocationDelayINTELShift: SpvLoopControlShift_ =
    25;
pub const SpvLoopControlShift__SpvLoopControlMax: SpvLoopControlShift_ = 2147483647;
pub type SpvLoopControlShift_ = ::std::os::raw::c_int;
pub use self::SpvLoopControlShift_ as SpvLoopControlShift;
pub const SpvLoopControlMask__SpvLoopControlMaskNone: SpvLoopControlMask_ = 0;
pub const SpvLoopControlMask__SpvLoopControlUnrollMask: SpvLoopControlMask_ = 1;
pub const SpvLoopControlMask__SpvLoopControlDontUnrollMask: SpvLoopControlMask_ = 2;
pub const SpvLoopControlMask__SpvLoopControlDependencyInfiniteMask: SpvLoopControlMask_ = 4;
pub const SpvLoopControlMask__SpvLoopControlDependencyLengthMask: SpvLoopControlMask_ = 8;
pub const SpvLoopControlMask__SpvLoopControlMinIterationsMask: SpvLoopControlMask_ = 16;
pub const SpvLoopControlMask__SpvLoopControlMaxIterationsMask: SpvLoopControlMask_ = 32;
pub const SpvLoopControlMask__SpvLoopControlIterationMultipleMask: SpvLoopControlMask_ = 64;
pub const SpvLoopControlMask__SpvLoopControlPeelCountMask: SpvLoopControlMask_ = 128;
pub const SpvLoopControlMask__SpvLoopControlPartialCountMask: SpvLoopControlMask_ = 256;
pub const SpvLoopControlMask__SpvLoopControlInitiationIntervalINTELMask: SpvLoopControlMask_ =
    65536;
pub const SpvLoopControlMask__SpvLoopControlMaxConcurrencyINTELMask: SpvLoopControlMask_ = 131072;
pub const SpvLoopControlMask__SpvLoopControlDependencyArrayINTELMask: SpvLoopControlMask_ = 262144;
pub const SpvLoopControlMask__SpvLoopControlPipelineEnableINTELMask: SpvLoopControlMask_ = 524288;
pub const SpvLoopControlMask__SpvLoopControlLoopCoalesceINTELMask: SpvLoopControlMask_ = 1048576;
pub const SpvLoopControlMask__SpvLoopControlMaxInterleavingINTELMask: SpvLoopControlMask_ = 2097152;
pub const SpvLoopControlMask__SpvLoopControlSpeculatedIterationsINTELMask: SpvLoopControlMask_ =
    4194304;
pub const SpvLoopControlMask__SpvLoopControlNoFusionINTELMask: SpvLoopControlMask_ = 8388608;
pub const SpvLoopControlMask__SpvLoopControlLoopCountINTELMask: SpvLoopControlMask_ = 16777216;
pub const SpvLoopControlMask__SpvLoopControlMaxReinvocationDelayINTELMask: SpvLoopControlMask_ =
    33554432;
pub type SpvLoopControlMask_ = ::std::os::raw::c_int;
pub use self::SpvLoopControlMask_ as SpvLoopControlMask;
pub const SpvFunctionControlShift__SpvFunctionControlInlineShift: SpvFunctionControlShift_ = 0;
pub const SpvFunctionControlShift__SpvFunctionControlDontInlineShift: SpvFunctionControlShift_ = 1;
pub const SpvFunctionControlShift__SpvFunctionControlPureShift: SpvFunctionControlShift_ = 2;
pub const SpvFunctionControlShift__SpvFunctionControlConstShift: SpvFunctionControlShift_ = 3;
pub const SpvFunctionControlShift__SpvFunctionControlOptNoneEXTShift: SpvFunctionControlShift_ = 16;
pub const SpvFunctionControlShift__SpvFunctionControlOptNoneINTELShift: SpvFunctionControlShift_ =
    16;
pub const SpvFunctionControlShift__SpvFunctionControlMax: SpvFunctionControlShift_ = 2147483647;
pub type SpvFunctionControlShift_ = ::std::os::raw::c_int;
pub use self::SpvFunctionControlShift_ as SpvFunctionControlShift;
pub const SpvFunctionControlMask__SpvFunctionControlMaskNone: SpvFunctionControlMask_ = 0;
pub const SpvFunctionControlMask__SpvFunctionControlInlineMask: SpvFunctionControlMask_ = 1;
pub const SpvFunctionControlMask__SpvFunctionControlDontInlineMask: SpvFunctionControlMask_ = 2;
pub const SpvFunctionControlMask__SpvFunctionControlPureMask: SpvFunctionControlMask_ = 4;
pub const SpvFunctionControlMask__SpvFunctionControlConstMask: SpvFunctionControlMask_ = 8;
pub const SpvFunctionControlMask__SpvFunctionControlOptNoneEXTMask: SpvFunctionControlMask_ = 65536;
pub const SpvFunctionControlMask__SpvFunctionControlOptNoneINTELMask: SpvFunctionControlMask_ =
    65536;
pub type SpvFunctionControlMask_ = ::std::os::raw::c_int;
pub use self::SpvFunctionControlMask_ as SpvFunctionControlMask;
pub const SpvMemorySemanticsShift__SpvMemorySemanticsAcquireShift: SpvMemorySemanticsShift_ = 1;
pub const SpvMemorySemanticsShift__SpvMemorySemanticsReleaseShift: SpvMemorySemanticsShift_ = 2;
pub const SpvMemorySemanticsShift__SpvMemorySemanticsAcquireReleaseShift: SpvMemorySemanticsShift_ =
    3;
pub const SpvMemorySemanticsShift__SpvMemorySemanticsSequentiallyConsistentShift:
    SpvMemorySemanticsShift_ = 4;
pub const SpvMemorySemanticsShift__SpvMemorySemanticsUniformMemoryShift: SpvMemorySemanticsShift_ =
    6;
pub const SpvMemorySemanticsShift__SpvMemorySemanticsSubgroupMemoryShift: SpvMemorySemanticsShift_ =
    7;
pub const SpvMemorySemanticsShift__SpvMemorySemanticsWorkgroupMemoryShift:
    SpvMemorySemanticsShift_ = 8;
pub const SpvMemorySemanticsShift__SpvMemorySemanticsCrossWorkgroupMemoryShift:
    SpvMemorySemanticsShift_ = 9;
pub const SpvMemorySemanticsShift__SpvMemorySemanticsAtomicCounterMemoryShift:
    SpvMemorySemanticsShift_ = 10;
pub const SpvMemorySemanticsShift__SpvMemorySemanticsImageMemoryShift: SpvMemorySemanticsShift_ =
    11;
pub const SpvMemorySemanticsShift__SpvMemorySemanticsOutputMemoryShift: SpvMemorySemanticsShift_ =
    12;
pub const SpvMemorySemanticsShift__SpvMemorySemanticsOutputMemoryKHRShift:
    SpvMemorySemanticsShift_ = 12;
pub const SpvMemorySemanticsShift__SpvMemorySemanticsMakeAvailableShift: SpvMemorySemanticsShift_ =
    13;
pub const SpvMemorySemanticsShift__SpvMemorySemanticsMakeAvailableKHRShift:
    SpvMemorySemanticsShift_ = 13;
pub const SpvMemorySemanticsShift__SpvMemorySemanticsMakeVisibleShift: SpvMemorySemanticsShift_ =
    14;
pub const SpvMemorySemanticsShift__SpvMemorySemanticsMakeVisibleKHRShift: SpvMemorySemanticsShift_ =
    14;
pub const SpvMemorySemanticsShift__SpvMemorySemanticsVolatileShift: SpvMemorySemanticsShift_ = 15;
pub const SpvMemorySemanticsShift__SpvMemorySemanticsMax: SpvMemorySemanticsShift_ = 2147483647;
pub type SpvMemorySemanticsShift_ = ::std::os::raw::c_int;
pub use self::SpvMemorySemanticsShift_ as SpvMemorySemanticsShift;
pub const SpvMemorySemanticsMask__SpvMemorySemanticsMaskNone: SpvMemorySemanticsMask_ = 0;
pub const SpvMemorySemanticsMask__SpvMemorySemanticsAcquireMask: SpvMemorySemanticsMask_ = 2;
pub const SpvMemorySemanticsMask__SpvMemorySemanticsReleaseMask: SpvMemorySemanticsMask_ = 4;
pub const SpvMemorySemanticsMask__SpvMemorySemanticsAcquireReleaseMask: SpvMemorySemanticsMask_ = 8;
pub const SpvMemorySemanticsMask__SpvMemorySemanticsSequentiallyConsistentMask:
    SpvMemorySemanticsMask_ = 16;
pub const SpvMemorySemanticsMask__SpvMemorySemanticsUniformMemoryMask: SpvMemorySemanticsMask_ = 64;
pub const SpvMemorySemanticsMask__SpvMemorySemanticsSubgroupMemoryMask: SpvMemorySemanticsMask_ =
    128;
pub const SpvMemorySemanticsMask__SpvMemorySemanticsWorkgroupMemoryMask: SpvMemorySemanticsMask_ =
    256;
pub const SpvMemorySemanticsMask__SpvMemorySemanticsCrossWorkgroupMemoryMask:
    SpvMemorySemanticsMask_ = 512;
pub const SpvMemorySemanticsMask__SpvMemorySemanticsAtomicCounterMemoryMask:
    SpvMemorySemanticsMask_ = 1024;
pub const SpvMemorySemanticsMask__SpvMemorySemanticsImageMemoryMask: SpvMemorySemanticsMask_ = 2048;
pub const SpvMemorySemanticsMask__SpvMemorySemanticsOutputMemoryMask: SpvMemorySemanticsMask_ =
    4096;
pub const SpvMemorySemanticsMask__SpvMemorySemanticsOutputMemoryKHRMask: SpvMemorySemanticsMask_ =
    4096;
pub const SpvMemorySemanticsMask__SpvMemorySemanticsMakeAvailableMask: SpvMemorySemanticsMask_ =
    8192;
pub const SpvMemorySemanticsMask__SpvMemorySemanticsMakeAvailableKHRMask: SpvMemorySemanticsMask_ =
    8192;
pub const SpvMemorySemanticsMask__SpvMemorySemanticsMakeVisibleMask: SpvMemorySemanticsMask_ =
    16384;
pub const SpvMemorySemanticsMask__SpvMemorySemanticsMakeVisibleKHRMask: SpvMemorySemanticsMask_ =
    16384;
pub const SpvMemorySemanticsMask__SpvMemorySemanticsVolatileMask: SpvMemorySemanticsMask_ = 32768;
pub type SpvMemorySemanticsMask_ = ::std::os::raw::c_int;
pub use self::SpvMemorySemanticsMask_ as SpvMemorySemanticsMask;
pub const SpvMemoryAccessShift__SpvMemoryAccessVolatileShift: SpvMemoryAccessShift_ = 0;
pub const SpvMemoryAccessShift__SpvMemoryAccessAlignedShift: SpvMemoryAccessShift_ = 1;
pub const SpvMemoryAccessShift__SpvMemoryAccessNontemporalShift: SpvMemoryAccessShift_ = 2;
pub const SpvMemoryAccessShift__SpvMemoryAccessMakePointerAvailableShift: SpvMemoryAccessShift_ = 3;
pub const SpvMemoryAccessShift__SpvMemoryAccessMakePointerAvailableKHRShift: SpvMemoryAccessShift_ =
    3;
pub const SpvMemoryAccessShift__SpvMemoryAccessMakePointerVisibleShift: SpvMemoryAccessShift_ = 4;
pub const SpvMemoryAccessShift__SpvMemoryAccessMakePointerVisibleKHRShift: SpvMemoryAccessShift_ =
    4;
pub const SpvMemoryAccessShift__SpvMemoryAccessNonPrivatePointerShift: SpvMemoryAccessShift_ = 5;
pub const SpvMemoryAccessShift__SpvMemoryAccessNonPrivatePointerKHRShift: SpvMemoryAccessShift_ = 5;
pub const SpvMemoryAccessShift__SpvMemoryAccessAliasScopeINTELMaskShift: SpvMemoryAccessShift_ = 16;
pub const SpvMemoryAccessShift__SpvMemoryAccessNoAliasINTELMaskShift: SpvMemoryAccessShift_ = 17;
pub const SpvMemoryAccessShift__SpvMemoryAccessMax: SpvMemoryAccessShift_ = 2147483647;
pub type SpvMemoryAccessShift_ = ::std::os::raw::c_int;
pub use self::SpvMemoryAccessShift_ as SpvMemoryAccessShift;
pub const SpvMemoryAccessMask__SpvMemoryAccessMaskNone: SpvMemoryAccessMask_ = 0;
pub const SpvMemoryAccessMask__SpvMemoryAccessVolatileMask: SpvMemoryAccessMask_ = 1;
pub const SpvMemoryAccessMask__SpvMemoryAccessAlignedMask: SpvMemoryAccessMask_ = 2;
pub const SpvMemoryAccessMask__SpvMemoryAccessNontemporalMask: SpvMemoryAccessMask_ = 4;
pub const SpvMemoryAccessMask__SpvMemoryAccessMakePointerAvailableMask: SpvMemoryAccessMask_ = 8;
pub const SpvMemoryAccessMask__SpvMemoryAccessMakePointerAvailableKHRMask: SpvMemoryAccessMask_ = 8;
pub const SpvMemoryAccessMask__SpvMemoryAccessMakePointerVisibleMask: SpvMemoryAccessMask_ = 16;
pub const SpvMemoryAccessMask__SpvMemoryAccessMakePointerVisibleKHRMask: SpvMemoryAccessMask_ = 16;
pub const SpvMemoryAccessMask__SpvMemoryAccessNonPrivatePointerMask: SpvMemoryAccessMask_ = 32;
pub const SpvMemoryAccessMask__SpvMemoryAccessNonPrivatePointerKHRMask: SpvMemoryAccessMask_ = 32;
pub const SpvMemoryAccessMask__SpvMemoryAccessAliasScopeINTELMaskMask: SpvMemoryAccessMask_ = 65536;
pub const SpvMemoryAccessMask__SpvMemoryAccessNoAliasINTELMaskMask: SpvMemoryAccessMask_ = 131072;
pub type SpvMemoryAccessMask_ = ::std::os::raw::c_int;
pub use self::SpvMemoryAccessMask_ as SpvMemoryAccessMask;
pub const SpvScope__SpvScopeCrossDevice: SpvScope_ = 0;
pub const SpvScope__SpvScopeDevice: SpvScope_ = 1;
pub const SpvScope__SpvScopeWorkgroup: SpvScope_ = 2;
pub const SpvScope__SpvScopeSubgroup: SpvScope_ = 3;
pub const SpvScope__SpvScopeInvocation: SpvScope_ = 4;
pub const SpvScope__SpvScopeQueueFamily: SpvScope_ = 5;
pub const SpvScope__SpvScopeQueueFamilyKHR: SpvScope_ = 5;
pub const SpvScope__SpvScopeShaderCallKHR: SpvScope_ = 6;
pub const SpvScope__SpvScopeMax: SpvScope_ = 2147483647;
pub type SpvScope_ = ::std::os::raw::c_int;
pub use self::SpvScope_ as SpvScope;
pub const SpvGroupOperation__SpvGroupOperationReduce: SpvGroupOperation_ = 0;
pub const SpvGroupOperation__SpvGroupOperationInclusiveScan: SpvGroupOperation_ = 1;
pub const SpvGroupOperation__SpvGroupOperationExclusiveScan: SpvGroupOperation_ = 2;
pub const SpvGroupOperation__SpvGroupOperationClusteredReduce: SpvGroupOperation_ = 3;
pub const SpvGroupOperation__SpvGroupOperationPartitionedReduceNV: SpvGroupOperation_ = 6;
pub const SpvGroupOperation__SpvGroupOperationPartitionedInclusiveScanNV: SpvGroupOperation_ = 7;
pub const SpvGroupOperation__SpvGroupOperationPartitionedExclusiveScanNV: SpvGroupOperation_ = 8;
pub const SpvGroupOperation__SpvGroupOperationMax: SpvGroupOperation_ = 2147483647;
pub type SpvGroupOperation_ = ::std::os::raw::c_int;
pub use self::SpvGroupOperation_ as SpvGroupOperation;
pub const SpvKernelEnqueueFlags__SpvKernelEnqueueFlagsNoWait: SpvKernelEnqueueFlags_ = 0;
pub const SpvKernelEnqueueFlags__SpvKernelEnqueueFlagsWaitKernel: SpvKernelEnqueueFlags_ = 1;
pub const SpvKernelEnqueueFlags__SpvKernelEnqueueFlagsWaitWorkGroup: SpvKernelEnqueueFlags_ = 2;
pub const SpvKernelEnqueueFlags__SpvKernelEnqueueFlagsMax: SpvKernelEnqueueFlags_ = 2147483647;
pub type SpvKernelEnqueueFlags_ = ::std::os::raw::c_int;
pub use self::SpvKernelEnqueueFlags_ as SpvKernelEnqueueFlags;
pub const SpvKernelProfilingInfoShift__SpvKernelProfilingInfoCmdExecTimeShift:
    SpvKernelProfilingInfoShift_ = 0;
pub const SpvKernelProfilingInfoShift__SpvKernelProfilingInfoMax: SpvKernelProfilingInfoShift_ =
    2147483647;
pub type SpvKernelProfilingInfoShift_ = ::std::os::raw::c_int;
pub use self::SpvKernelProfilingInfoShift_ as SpvKernelProfilingInfoShift;
pub const SpvKernelProfilingInfoMask__SpvKernelProfilingInfoMaskNone: SpvKernelProfilingInfoMask_ =
    0;
pub const SpvKernelProfilingInfoMask__SpvKernelProfilingInfoCmdExecTimeMask:
    SpvKernelProfilingInfoMask_ = 1;
pub type SpvKernelProfilingInfoMask_ = ::std::os::raw::c_int;
pub use self::SpvKernelProfilingInfoMask_ as SpvKernelProfilingInfoMask;
pub const SpvCapability__SpvCapabilityMatrix: SpvCapability_ = 0;
pub const SpvCapability__SpvCapabilityShader: SpvCapability_ = 1;
pub const SpvCapability__SpvCapabilityGeometry: SpvCapability_ = 2;
pub const SpvCapability__SpvCapabilityTessellation: SpvCapability_ = 3;
pub const SpvCapability__SpvCapabilityAddresses: SpvCapability_ = 4;
pub const SpvCapability__SpvCapabilityLinkage: SpvCapability_ = 5;
pub const SpvCapability__SpvCapabilityKernel: SpvCapability_ = 6;
pub const SpvCapability__SpvCapabilityVector16: SpvCapability_ = 7;
pub const SpvCapability__SpvCapabilityFloat16Buffer: SpvCapability_ = 8;
pub const SpvCapability__SpvCapabilityFloat16: SpvCapability_ = 9;
pub const SpvCapability__SpvCapabilityFloat64: SpvCapability_ = 10;
pub const SpvCapability__SpvCapabilityInt64: SpvCapability_ = 11;
pub const SpvCapability__SpvCapabilityInt64Atomics: SpvCapability_ = 12;
pub const SpvCapability__SpvCapabilityImageBasic: SpvCapability_ = 13;
pub const SpvCapability__SpvCapabilityImageReadWrite: SpvCapability_ = 14;
pub const SpvCapability__SpvCapabilityImageMipmap: SpvCapability_ = 15;
pub const SpvCapability__SpvCapabilityPipes: SpvCapability_ = 17;
pub const SpvCapability__SpvCapabilityGroups: SpvCapability_ = 18;
pub const SpvCapability__SpvCapabilityDeviceEnqueue: SpvCapability_ = 19;
pub const SpvCapability__SpvCapabilityLiteralSampler: SpvCapability_ = 20;
pub const SpvCapability__SpvCapabilityAtomicStorage: SpvCapability_ = 21;
pub const SpvCapability__SpvCapabilityInt16: SpvCapability_ = 22;
pub const SpvCapability__SpvCapabilityTessellationPointSize: SpvCapability_ = 23;
pub const SpvCapability__SpvCapabilityGeometryPointSize: SpvCapability_ = 24;
pub const SpvCapability__SpvCapabilityImageGatherExtended: SpvCapability_ = 25;
pub const SpvCapability__SpvCapabilityStorageImageMultisample: SpvCapability_ = 27;
pub const SpvCapability__SpvCapabilityUniformBufferArrayDynamicIndexing: SpvCapability_ = 28;
pub const SpvCapability__SpvCapabilitySampledImageArrayDynamicIndexing: SpvCapability_ = 29;
pub const SpvCapability__SpvCapabilityStorageBufferArrayDynamicIndexing: SpvCapability_ = 30;
pub const SpvCapability__SpvCapabilityStorageImageArrayDynamicIndexing: SpvCapability_ = 31;
pub const SpvCapability__SpvCapabilityClipDistance: SpvCapability_ = 32;
pub const SpvCapability__SpvCapabilityCullDistance: SpvCapability_ = 33;
pub const SpvCapability__SpvCapabilityImageCubeArray: SpvCapability_ = 34;
pub const SpvCapability__SpvCapabilitySampleRateShading: SpvCapability_ = 35;
pub const SpvCapability__SpvCapabilityImageRect: SpvCapability_ = 36;
pub const SpvCapability__SpvCapabilitySampledRect: SpvCapability_ = 37;
pub const SpvCapability__SpvCapabilityGenericPointer: SpvCapability_ = 38;
pub const SpvCapability__SpvCapabilityInt8: SpvCapability_ = 39;
pub const SpvCapability__SpvCapabilityInputAttachment: SpvCapability_ = 40;
pub const SpvCapability__SpvCapabilitySparseResidency: SpvCapability_ = 41;
pub const SpvCapability__SpvCapabilityMinLod: SpvCapability_ = 42;
pub const SpvCapability__SpvCapabilitySampled1D: SpvCapability_ = 43;
pub const SpvCapability__SpvCapabilityImage1D: SpvCapability_ = 44;
pub const SpvCapability__SpvCapabilitySampledCubeArray: SpvCapability_ = 45;
pub const SpvCapability__SpvCapabilitySampledBuffer: SpvCapability_ = 46;
pub const SpvCapability__SpvCapabilityImageBuffer: SpvCapability_ = 47;
pub const SpvCapability__SpvCapabilityImageMSArray: SpvCapability_ = 48;
pub const SpvCapability__SpvCapabilityStorageImageExtendedFormats: SpvCapability_ = 49;
pub const SpvCapability__SpvCapabilityImageQuery: SpvCapability_ = 50;
pub const SpvCapability__SpvCapabilityDerivativeControl: SpvCapability_ = 51;
pub const SpvCapability__SpvCapabilityInterpolationFunction: SpvCapability_ = 52;
pub const SpvCapability__SpvCapabilityTransformFeedback: SpvCapability_ = 53;
pub const SpvCapability__SpvCapabilityGeometryStreams: SpvCapability_ = 54;
pub const SpvCapability__SpvCapabilityStorageImageReadWithoutFormat: SpvCapability_ = 55;
pub const SpvCapability__SpvCapabilityStorageImageWriteWithoutFormat: SpvCapability_ = 56;
pub const SpvCapability__SpvCapabilityMultiViewport: SpvCapability_ = 57;
pub const SpvCapability__SpvCapabilitySubgroupDispatch: SpvCapability_ = 58;
pub const SpvCapability__SpvCapabilityNamedBarrier: SpvCapability_ = 59;
pub const SpvCapability__SpvCapabilityPipeStorage: SpvCapability_ = 60;
pub const SpvCapability__SpvCapabilityGroupNonUniform: SpvCapability_ = 61;
pub const SpvCapability__SpvCapabilityGroupNonUniformVote: SpvCapability_ = 62;
pub const SpvCapability__SpvCapabilityGroupNonUniformArithmetic: SpvCapability_ = 63;
pub const SpvCapability__SpvCapabilityGroupNonUniformBallot: SpvCapability_ = 64;
pub const SpvCapability__SpvCapabilityGroupNonUniformShuffle: SpvCapability_ = 65;
pub const SpvCapability__SpvCapabilityGroupNonUniformShuffleRelative: SpvCapability_ = 66;
pub const SpvCapability__SpvCapabilityGroupNonUniformClustered: SpvCapability_ = 67;
pub const SpvCapability__SpvCapabilityGroupNonUniformQuad: SpvCapability_ = 68;
pub const SpvCapability__SpvCapabilityShaderLayer: SpvCapability_ = 69;
pub const SpvCapability__SpvCapabilityShaderViewportIndex: SpvCapability_ = 70;
pub const SpvCapability__SpvCapabilityUniformDecoration: SpvCapability_ = 71;
pub const SpvCapability__SpvCapabilityCoreBuiltinsARM: SpvCapability_ = 4165;
pub const SpvCapability__SpvCapabilityTileImageColorReadAccessEXT: SpvCapability_ = 4166;
pub const SpvCapability__SpvCapabilityTileImageDepthReadAccessEXT: SpvCapability_ = 4167;
pub const SpvCapability__SpvCapabilityTileImageStencilReadAccessEXT: SpvCapability_ = 4168;
pub const SpvCapability__SpvCapabilityTensorsARM: SpvCapability_ = 4174;
pub const SpvCapability__SpvCapabilityStorageTensorArrayDynamicIndexingARM: SpvCapability_ = 4175;
pub const SpvCapability__SpvCapabilityStorageTensorArrayNonUniformIndexingARM: SpvCapability_ =
    4176;
pub const SpvCapability__SpvCapabilityGraphARM: SpvCapability_ = 4191;
pub const SpvCapability__SpvCapabilityCooperativeMatrixLayoutsARM: SpvCapability_ = 4201;
pub const SpvCapability__SpvCapabilityFloat8EXT: SpvCapability_ = 4212;
pub const SpvCapability__SpvCapabilityFloat8CooperativeMatrixEXT: SpvCapability_ = 4213;
pub const SpvCapability__SpvCapabilityFragmentShadingRateKHR: SpvCapability_ = 4422;
pub const SpvCapability__SpvCapabilitySubgroupBallotKHR: SpvCapability_ = 4423;
pub const SpvCapability__SpvCapabilityDrawParameters: SpvCapability_ = 4427;
pub const SpvCapability__SpvCapabilityWorkgroupMemoryExplicitLayoutKHR: SpvCapability_ = 4428;
pub const SpvCapability__SpvCapabilityWorkgroupMemoryExplicitLayout8BitAccessKHR: SpvCapability_ =
    4429;
pub const SpvCapability__SpvCapabilityWorkgroupMemoryExplicitLayout16BitAccessKHR: SpvCapability_ =
    4430;
pub const SpvCapability__SpvCapabilitySubgroupVoteKHR: SpvCapability_ = 4431;
pub const SpvCapability__SpvCapabilityStorageBuffer16BitAccess: SpvCapability_ = 4433;
pub const SpvCapability__SpvCapabilityStorageUniformBufferBlock16: SpvCapability_ = 4433;
pub const SpvCapability__SpvCapabilityStorageUniform16: SpvCapability_ = 4434;
pub const SpvCapability__SpvCapabilityUniformAndStorageBuffer16BitAccess: SpvCapability_ = 4434;
pub const SpvCapability__SpvCapabilityStoragePushConstant16: SpvCapability_ = 4435;
pub const SpvCapability__SpvCapabilityStorageInputOutput16: SpvCapability_ = 4436;
pub const SpvCapability__SpvCapabilityDeviceGroup: SpvCapability_ = 4437;
pub const SpvCapability__SpvCapabilityMultiView: SpvCapability_ = 4439;
pub const SpvCapability__SpvCapabilityVariablePointersStorageBuffer: SpvCapability_ = 4441;
pub const SpvCapability__SpvCapabilityVariablePointers: SpvCapability_ = 4442;
pub const SpvCapability__SpvCapabilityAtomicStorageOps: SpvCapability_ = 4445;
pub const SpvCapability__SpvCapabilitySampleMaskPostDepthCoverage: SpvCapability_ = 4447;
pub const SpvCapability__SpvCapabilityStorageBuffer8BitAccess: SpvCapability_ = 4448;
pub const SpvCapability__SpvCapabilityUniformAndStorageBuffer8BitAccess: SpvCapability_ = 4449;
pub const SpvCapability__SpvCapabilityStoragePushConstant8: SpvCapability_ = 4450;
pub const SpvCapability__SpvCapabilityDenormPreserve: SpvCapability_ = 4464;
pub const SpvCapability__SpvCapabilityDenormFlushToZero: SpvCapability_ = 4465;
pub const SpvCapability__SpvCapabilitySignedZeroInfNanPreserve: SpvCapability_ = 4466;
pub const SpvCapability__SpvCapabilityRoundingModeRTE: SpvCapability_ = 4467;
pub const SpvCapability__SpvCapabilityRoundingModeRTZ: SpvCapability_ = 4468;
pub const SpvCapability__SpvCapabilityRayQueryProvisionalKHR: SpvCapability_ = 4471;
pub const SpvCapability__SpvCapabilityRayQueryKHR: SpvCapability_ = 4472;
pub const SpvCapability__SpvCapabilityUntypedPointersKHR: SpvCapability_ = 4473;
pub const SpvCapability__SpvCapabilityRayTraversalPrimitiveCullingKHR: SpvCapability_ = 4478;
pub const SpvCapability__SpvCapabilityRayTracingKHR: SpvCapability_ = 4479;
pub const SpvCapability__SpvCapabilityTextureSampleWeightedQCOM: SpvCapability_ = 4484;
pub const SpvCapability__SpvCapabilityTextureBoxFilterQCOM: SpvCapability_ = 4485;
pub const SpvCapability__SpvCapabilityTextureBlockMatchQCOM: SpvCapability_ = 4486;
pub const SpvCapability__SpvCapabilityTileShadingQCOM: SpvCapability_ = 4495;
pub const SpvCapability__SpvCapabilityCooperativeMatrixConversionQCOM: SpvCapability_ = 4496;
pub const SpvCapability__SpvCapabilityTextureBlockMatch2QCOM: SpvCapability_ = 4498;
pub const SpvCapability__SpvCapabilityFloat16ImageAMD: SpvCapability_ = 5008;
pub const SpvCapability__SpvCapabilityImageGatherBiasLodAMD: SpvCapability_ = 5009;
pub const SpvCapability__SpvCapabilityFragmentMaskAMD: SpvCapability_ = 5010;
pub const SpvCapability__SpvCapabilityStencilExportEXT: SpvCapability_ = 5013;
pub const SpvCapability__SpvCapabilityImageReadWriteLodAMD: SpvCapability_ = 5015;
pub const SpvCapability__SpvCapabilityInt64ImageEXT: SpvCapability_ = 5016;
pub const SpvCapability__SpvCapabilityShaderClockKHR: SpvCapability_ = 5055;
pub const SpvCapability__SpvCapabilityShaderEnqueueAMDX: SpvCapability_ = 5067;
pub const SpvCapability__SpvCapabilityQuadControlKHR: SpvCapability_ = 5087;
pub const SpvCapability__SpvCapabilityInt4TypeINTEL: SpvCapability_ = 5112;
pub const SpvCapability__SpvCapabilityInt4CooperativeMatrixINTEL: SpvCapability_ = 5114;
pub const SpvCapability__SpvCapabilityBFloat16TypeKHR: SpvCapability_ = 5116;
pub const SpvCapability__SpvCapabilityBFloat16DotProductKHR: SpvCapability_ = 5117;
pub const SpvCapability__SpvCapabilityBFloat16CooperativeMatrixKHR: SpvCapability_ = 5118;
pub const SpvCapability__SpvCapabilitySampleMaskOverrideCoverageNV: SpvCapability_ = 5249;
pub const SpvCapability__SpvCapabilityGeometryShaderPassthroughNV: SpvCapability_ = 5251;
pub const SpvCapability__SpvCapabilityShaderViewportIndexLayerEXT: SpvCapability_ = 5254;
pub const SpvCapability__SpvCapabilityShaderViewportIndexLayerNV: SpvCapability_ = 5254;
pub const SpvCapability__SpvCapabilityShaderViewportMaskNV: SpvCapability_ = 5255;
pub const SpvCapability__SpvCapabilityShaderStereoViewNV: SpvCapability_ = 5259;
pub const SpvCapability__SpvCapabilityPerViewAttributesNV: SpvCapability_ = 5260;
pub const SpvCapability__SpvCapabilityFragmentFullyCoveredEXT: SpvCapability_ = 5265;
pub const SpvCapability__SpvCapabilityMeshShadingNV: SpvCapability_ = 5266;
pub const SpvCapability__SpvCapabilityImageFootprintNV: SpvCapability_ = 5282;
pub const SpvCapability__SpvCapabilityMeshShadingEXT: SpvCapability_ = 5283;
pub const SpvCapability__SpvCapabilityFragmentBarycentricKHR: SpvCapability_ = 5284;
pub const SpvCapability__SpvCapabilityFragmentBarycentricNV: SpvCapability_ = 5284;
pub const SpvCapability__SpvCapabilityComputeDerivativeGroupQuadsKHR: SpvCapability_ = 5288;
pub const SpvCapability__SpvCapabilityComputeDerivativeGroupQuadsNV: SpvCapability_ = 5288;
pub const SpvCapability__SpvCapabilityFragmentDensityEXT: SpvCapability_ = 5291;
pub const SpvCapability__SpvCapabilityShadingRateNV: SpvCapability_ = 5291;
pub const SpvCapability__SpvCapabilityGroupNonUniformPartitionedNV: SpvCapability_ = 5297;
pub const SpvCapability__SpvCapabilityShaderNonUniform: SpvCapability_ = 5301;
pub const SpvCapability__SpvCapabilityShaderNonUniformEXT: SpvCapability_ = 5301;
pub const SpvCapability__SpvCapabilityRuntimeDescriptorArray: SpvCapability_ = 5302;
pub const SpvCapability__SpvCapabilityRuntimeDescriptorArrayEXT: SpvCapability_ = 5302;
pub const SpvCapability__SpvCapabilityInputAttachmentArrayDynamicIndexing: SpvCapability_ = 5303;
pub const SpvCapability__SpvCapabilityInputAttachmentArrayDynamicIndexingEXT: SpvCapability_ = 5303;
pub const SpvCapability__SpvCapabilityUniformTexelBufferArrayDynamicIndexing: SpvCapability_ = 5304;
pub const SpvCapability__SpvCapabilityUniformTexelBufferArrayDynamicIndexingEXT: SpvCapability_ =
    5304;
pub const SpvCapability__SpvCapabilityStorageTexelBufferArrayDynamicIndexing: SpvCapability_ = 5305;
pub const SpvCapability__SpvCapabilityStorageTexelBufferArrayDynamicIndexingEXT: SpvCapability_ =
    5305;
pub const SpvCapability__SpvCapabilityUniformBufferArrayNonUniformIndexing: SpvCapability_ = 5306;
pub const SpvCapability__SpvCapabilityUniformBufferArrayNonUniformIndexingEXT: SpvCapability_ =
    5306;
pub const SpvCapability__SpvCapabilitySampledImageArrayNonUniformIndexing: SpvCapability_ = 5307;
pub const SpvCapability__SpvCapabilitySampledImageArrayNonUniformIndexingEXT: SpvCapability_ = 5307;
pub const SpvCapability__SpvCapabilityStorageBufferArrayNonUniformIndexing: SpvCapability_ = 5308;
pub const SpvCapability__SpvCapabilityStorageBufferArrayNonUniformIndexingEXT: SpvCapability_ =
    5308;
pub const SpvCapability__SpvCapabilityStorageImageArrayNonUniformIndexing: SpvCapability_ = 5309;
pub const SpvCapability__SpvCapabilityStorageImageArrayNonUniformIndexingEXT: SpvCapability_ = 5309;
pub const SpvCapability__SpvCapabilityInputAttachmentArrayNonUniformIndexing: SpvCapability_ = 5310;
pub const SpvCapability__SpvCapabilityInputAttachmentArrayNonUniformIndexingEXT: SpvCapability_ =
    5310;
pub const SpvCapability__SpvCapabilityUniformTexelBufferArrayNonUniformIndexing: SpvCapability_ =
    5311;
pub const SpvCapability__SpvCapabilityUniformTexelBufferArrayNonUniformIndexingEXT: SpvCapability_ =
    5311;
pub const SpvCapability__SpvCapabilityStorageTexelBufferArrayNonUniformIndexing: SpvCapability_ =
    5312;
pub const SpvCapability__SpvCapabilityStorageTexelBufferArrayNonUniformIndexingEXT: SpvCapability_ =
    5312;
pub const SpvCapability__SpvCapabilityRayTracingPositionFetchKHR: SpvCapability_ = 5336;
pub const SpvCapability__SpvCapabilityRayTracingNV: SpvCapability_ = 5340;
pub const SpvCapability__SpvCapabilityRayTracingMotionBlurNV: SpvCapability_ = 5341;
pub const SpvCapability__SpvCapabilityVulkanMemoryModel: SpvCapability_ = 5345;
pub const SpvCapability__SpvCapabilityVulkanMemoryModelKHR: SpvCapability_ = 5345;
pub const SpvCapability__SpvCapabilityVulkanMemoryModelDeviceScope: SpvCapability_ = 5346;
pub const SpvCapability__SpvCapabilityVulkanMemoryModelDeviceScopeKHR: SpvCapability_ = 5346;
pub const SpvCapability__SpvCapabilityPhysicalStorageBufferAddresses: SpvCapability_ = 5347;
pub const SpvCapability__SpvCapabilityPhysicalStorageBufferAddressesEXT: SpvCapability_ = 5347;
pub const SpvCapability__SpvCapabilityComputeDerivativeGroupLinearKHR: SpvCapability_ = 5350;
pub const SpvCapability__SpvCapabilityComputeDerivativeGroupLinearNV: SpvCapability_ = 5350;
pub const SpvCapability__SpvCapabilityRayTracingProvisionalKHR: SpvCapability_ = 5353;
pub const SpvCapability__SpvCapabilityCooperativeMatrixNV: SpvCapability_ = 5357;
pub const SpvCapability__SpvCapabilityFragmentShaderSampleInterlockEXT: SpvCapability_ = 5363;
pub const SpvCapability__SpvCapabilityFragmentShaderShadingRateInterlockEXT: SpvCapability_ = 5372;
pub const SpvCapability__SpvCapabilityShaderSMBuiltinsNV: SpvCapability_ = 5373;
pub const SpvCapability__SpvCapabilityFragmentShaderPixelInterlockEXT: SpvCapability_ = 5378;
pub const SpvCapability__SpvCapabilityDemoteToHelperInvocation: SpvCapability_ = 5379;
pub const SpvCapability__SpvCapabilityDemoteToHelperInvocationEXT: SpvCapability_ = 5379;
pub const SpvCapability__SpvCapabilityDisplacementMicromapNV: SpvCapability_ = 5380;
pub const SpvCapability__SpvCapabilityRayTracingOpacityMicromapEXT: SpvCapability_ = 5381;
pub const SpvCapability__SpvCapabilityShaderInvocationReorderNV: SpvCapability_ = 5383;
pub const SpvCapability__SpvCapabilityBindlessTextureNV: SpvCapability_ = 5390;
pub const SpvCapability__SpvCapabilityRayQueryPositionFetchKHR: SpvCapability_ = 5391;
pub const SpvCapability__SpvCapabilityCooperativeVectorNV: SpvCapability_ = 5394;
pub const SpvCapability__SpvCapabilityAtomicFloat16VectorNV: SpvCapability_ = 5404;
pub const SpvCapability__SpvCapabilityRayTracingDisplacementMicromapNV: SpvCapability_ = 5409;
pub const SpvCapability__SpvCapabilityRawAccessChainsNV: SpvCapability_ = 5414;
pub const SpvCapability__SpvCapabilityRayTracingSpheresGeometryNV: SpvCapability_ = 5418;
pub const SpvCapability__SpvCapabilityRayTracingLinearSweptSpheresGeometryNV: SpvCapability_ = 5419;
pub const SpvCapability__SpvCapabilityCooperativeMatrixReductionsNV: SpvCapability_ = 5430;
pub const SpvCapability__SpvCapabilityCooperativeMatrixConversionsNV: SpvCapability_ = 5431;
pub const SpvCapability__SpvCapabilityCooperativeMatrixPerElementOperationsNV: SpvCapability_ =
    5432;
pub const SpvCapability__SpvCapabilityCooperativeMatrixTensorAddressingNV: SpvCapability_ = 5433;
pub const SpvCapability__SpvCapabilityCooperativeMatrixBlockLoadsNV: SpvCapability_ = 5434;
pub const SpvCapability__SpvCapabilityCooperativeVectorTrainingNV: SpvCapability_ = 5435;
pub const SpvCapability__SpvCapabilityRayTracingClusterAccelerationStructureNV: SpvCapability_ =
    5437;
pub const SpvCapability__SpvCapabilityTensorAddressingNV: SpvCapability_ = 5439;
pub const SpvCapability__SpvCapabilitySubgroupShuffleINTEL: SpvCapability_ = 5568;
pub const SpvCapability__SpvCapabilitySubgroupBufferBlockIOINTEL: SpvCapability_ = 5569;
pub const SpvCapability__SpvCapabilitySubgroupImageBlockIOINTEL: SpvCapability_ = 5570;
pub const SpvCapability__SpvCapabilitySubgroupImageMediaBlockIOINTEL: SpvCapability_ = 5579;
pub const SpvCapability__SpvCapabilityRoundToInfinityINTEL: SpvCapability_ = 5582;
pub const SpvCapability__SpvCapabilityFloatingPointModeINTEL: SpvCapability_ = 5583;
pub const SpvCapability__SpvCapabilityIntegerFunctions2INTEL: SpvCapability_ = 5584;
pub const SpvCapability__SpvCapabilityFunctionPointersINTEL: SpvCapability_ = 5603;
pub const SpvCapability__SpvCapabilityIndirectReferencesINTEL: SpvCapability_ = 5604;
pub const SpvCapability__SpvCapabilityAsmINTEL: SpvCapability_ = 5606;
pub const SpvCapability__SpvCapabilityAtomicFloat32MinMaxEXT: SpvCapability_ = 5612;
pub const SpvCapability__SpvCapabilityAtomicFloat64MinMaxEXT: SpvCapability_ = 5613;
pub const SpvCapability__SpvCapabilityAtomicFloat16MinMaxEXT: SpvCapability_ = 5616;
pub const SpvCapability__SpvCapabilityVectorComputeINTEL: SpvCapability_ = 5617;
pub const SpvCapability__SpvCapabilityVectorAnyINTEL: SpvCapability_ = 5619;
pub const SpvCapability__SpvCapabilityExpectAssumeKHR: SpvCapability_ = 5629;
pub const SpvCapability__SpvCapabilitySubgroupAvcMotionEstimationINTEL: SpvCapability_ = 5696;
pub const SpvCapability__SpvCapabilitySubgroupAvcMotionEstimationIntraINTEL: SpvCapability_ = 5697;
pub const SpvCapability__SpvCapabilitySubgroupAvcMotionEstimationChromaINTEL: SpvCapability_ = 5698;
pub const SpvCapability__SpvCapabilityVariableLengthArrayINTEL: SpvCapability_ = 5817;
pub const SpvCapability__SpvCapabilityFunctionFloatControlINTEL: SpvCapability_ = 5821;
pub const SpvCapability__SpvCapabilityFPGAMemoryAttributesINTEL: SpvCapability_ = 5824;
pub const SpvCapability__SpvCapabilityFPFastMathModeINTEL: SpvCapability_ = 5837;
pub const SpvCapability__SpvCapabilityArbitraryPrecisionIntegersINTEL: SpvCapability_ = 5844;
pub const SpvCapability__SpvCapabilityArbitraryPrecisionFloatingPointINTEL: SpvCapability_ = 5845;
pub const SpvCapability__SpvCapabilityUnstructuredLoopControlsINTEL: SpvCapability_ = 5886;
pub const SpvCapability__SpvCapabilityFPGALoopControlsINTEL: SpvCapability_ = 5888;
pub const SpvCapability__SpvCapabilityKernelAttributesINTEL: SpvCapability_ = 5892;
pub const SpvCapability__SpvCapabilityFPGAKernelAttributesINTEL: SpvCapability_ = 5897;
pub const SpvCapability__SpvCapabilityFPGAMemoryAccessesINTEL: SpvCapability_ = 5898;
pub const SpvCapability__SpvCapabilityFPGAClusterAttributesINTEL: SpvCapability_ = 5904;
pub const SpvCapability__SpvCapabilityLoopFuseINTEL: SpvCapability_ = 5906;
pub const SpvCapability__SpvCapabilityFPGADSPControlINTEL: SpvCapability_ = 5908;
pub const SpvCapability__SpvCapabilityMemoryAccessAliasingINTEL: SpvCapability_ = 5910;
pub const SpvCapability__SpvCapabilityFPGAInvocationPipeliningAttributesINTEL: SpvCapability_ =
    5916;
pub const SpvCapability__SpvCapabilityFPGABufferLocationINTEL: SpvCapability_ = 5920;
pub const SpvCapability__SpvCapabilityArbitraryPrecisionFixedPointINTEL: SpvCapability_ = 5922;
pub const SpvCapability__SpvCapabilityUSMStorageClassesINTEL: SpvCapability_ = 5935;
pub const SpvCapability__SpvCapabilityRuntimeAlignedAttributeINTEL: SpvCapability_ = 5939;
pub const SpvCapability__SpvCapabilityIOPipesINTEL: SpvCapability_ = 5943;
pub const SpvCapability__SpvCapabilityBlockingPipesINTEL: SpvCapability_ = 5945;
pub const SpvCapability__SpvCapabilityFPGARegINTEL: SpvCapability_ = 5948;
pub const SpvCapability__SpvCapabilityDotProductInputAll: SpvCapability_ = 6016;
pub const SpvCapability__SpvCapabilityDotProductInputAllKHR: SpvCapability_ = 6016;
pub const SpvCapability__SpvCapabilityDotProductInput4x8Bit: SpvCapability_ = 6017;
pub const SpvCapability__SpvCapabilityDotProductInput4x8BitKHR: SpvCapability_ = 6017;
pub const SpvCapability__SpvCapabilityDotProductInput4x8BitPacked: SpvCapability_ = 6018;
pub const SpvCapability__SpvCapabilityDotProductInput4x8BitPackedKHR: SpvCapability_ = 6018;
pub const SpvCapability__SpvCapabilityDotProduct: SpvCapability_ = 6019;
pub const SpvCapability__SpvCapabilityDotProductKHR: SpvCapability_ = 6019;
pub const SpvCapability__SpvCapabilityRayCullMaskKHR: SpvCapability_ = 6020;
pub const SpvCapability__SpvCapabilityCooperativeMatrixKHR: SpvCapability_ = 6022;
pub const SpvCapability__SpvCapabilityReplicatedCompositesEXT: SpvCapability_ = 6024;
pub const SpvCapability__SpvCapabilityBitInstructions: SpvCapability_ = 6025;
pub const SpvCapability__SpvCapabilityGroupNonUniformRotateKHR: SpvCapability_ = 6026;
pub const SpvCapability__SpvCapabilityFloatControls2: SpvCapability_ = 6029;
pub const SpvCapability__SpvCapabilityFMAKHR: SpvCapability_ = 6030;
pub const SpvCapability__SpvCapabilityAtomicFloat32AddEXT: SpvCapability_ = 6033;
pub const SpvCapability__SpvCapabilityAtomicFloat64AddEXT: SpvCapability_ = 6034;
pub const SpvCapability__SpvCapabilityLongCompositesINTEL: SpvCapability_ = 6089;
pub const SpvCapability__SpvCapabilityOptNoneEXT: SpvCapability_ = 6094;
pub const SpvCapability__SpvCapabilityOptNoneINTEL: SpvCapability_ = 6094;
pub const SpvCapability__SpvCapabilityAtomicFloat16AddEXT: SpvCapability_ = 6095;
pub const SpvCapability__SpvCapabilityDebugInfoModuleINTEL: SpvCapability_ = 6114;
pub const SpvCapability__SpvCapabilityBFloat16ConversionINTEL: SpvCapability_ = 6115;
pub const SpvCapability__SpvCapabilitySplitBarrierINTEL: SpvCapability_ = 6141;
pub const SpvCapability__SpvCapabilityArithmeticFenceEXT: SpvCapability_ = 6144;
pub const SpvCapability__SpvCapabilityFPGAClusterAttributesV2INTEL: SpvCapability_ = 6150;
pub const SpvCapability__SpvCapabilityFPGAKernelAttributesv2INTEL: SpvCapability_ = 6161;
pub const SpvCapability__SpvCapabilityTaskSequenceINTEL: SpvCapability_ = 6162;
pub const SpvCapability__SpvCapabilityFPMaxErrorINTEL: SpvCapability_ = 6169;
pub const SpvCapability__SpvCapabilityFPGALatencyControlINTEL: SpvCapability_ = 6171;
pub const SpvCapability__SpvCapabilityFPGAArgumentInterfacesINTEL: SpvCapability_ = 6174;
pub const SpvCapability__SpvCapabilityGlobalVariableHostAccessINTEL: SpvCapability_ = 6187;
pub const SpvCapability__SpvCapabilityGlobalVariableFPGADecorationsINTEL: SpvCapability_ = 6189;
pub const SpvCapability__SpvCapabilitySubgroupBufferPrefetchINTEL: SpvCapability_ = 6220;
pub const SpvCapability__SpvCapabilitySubgroup2DBlockIOINTEL: SpvCapability_ = 6228;
pub const SpvCapability__SpvCapabilitySubgroup2DBlockTransformINTEL: SpvCapability_ = 6229;
pub const SpvCapability__SpvCapabilitySubgroup2DBlockTransposeINTEL: SpvCapability_ = 6230;
pub const SpvCapability__SpvCapabilitySubgroupMatrixMultiplyAccumulateINTEL: SpvCapability_ = 6236;
pub const SpvCapability__SpvCapabilityTernaryBitwiseFunctionINTEL: SpvCapability_ = 6241;
pub const SpvCapability__SpvCapabilityUntypedVariableLengthArrayINTEL: SpvCapability_ = 6243;
pub const SpvCapability__SpvCapabilitySpecConditionalINTEL: SpvCapability_ = 6245;
pub const SpvCapability__SpvCapabilityFunctionVariantsINTEL: SpvCapability_ = 6246;
pub const SpvCapability__SpvCapabilityGroupUniformArithmeticKHR: SpvCapability_ = 6400;
pub const SpvCapability__SpvCapabilityTensorFloat32RoundingINTEL: SpvCapability_ = 6425;
pub const SpvCapability__SpvCapabilityMaskedGatherScatterINTEL: SpvCapability_ = 6427;
pub const SpvCapability__SpvCapabilityCacheControlsINTEL: SpvCapability_ = 6441;
pub const SpvCapability__SpvCapabilityRegisterLimitsINTEL: SpvCapability_ = 6460;
pub const SpvCapability__SpvCapabilityBindlessImagesINTEL: SpvCapability_ = 6528;
pub const SpvCapability__SpvCapabilityMax: SpvCapability_ = 2147483647;
pub type SpvCapability_ = ::std::os::raw::c_int;
pub use self::SpvCapability_ as SpvCapability;
pub const SpvRayFlagsShift__SpvRayFlagsOpaqueKHRShift: SpvRayFlagsShift_ = 0;
pub const SpvRayFlagsShift__SpvRayFlagsNoOpaqueKHRShift: SpvRayFlagsShift_ = 1;
pub const SpvRayFlagsShift__SpvRayFlagsTerminateOnFirstHitKHRShift: SpvRayFlagsShift_ = 2;
pub const SpvRayFlagsShift__SpvRayFlagsSkipClosestHitShaderKHRShift: SpvRayFlagsShift_ = 3;
pub const SpvRayFlagsShift__SpvRayFlagsCullBackFacingTrianglesKHRShift: SpvRayFlagsShift_ = 4;
pub const SpvRayFlagsShift__SpvRayFlagsCullFrontFacingTrianglesKHRShift: SpvRayFlagsShift_ = 5;
pub const SpvRayFlagsShift__SpvRayFlagsCullOpaqueKHRShift: SpvRayFlagsShift_ = 6;
pub const SpvRayFlagsShift__SpvRayFlagsCullNoOpaqueKHRShift: SpvRayFlagsShift_ = 7;
pub const SpvRayFlagsShift__SpvRayFlagsSkipBuiltinPrimitivesNVShift: SpvRayFlagsShift_ = 8;
pub const SpvRayFlagsShift__SpvRayFlagsSkipTrianglesKHRShift: SpvRayFlagsShift_ = 8;
pub const SpvRayFlagsShift__SpvRayFlagsSkipAABBsKHRShift: SpvRayFlagsShift_ = 9;
pub const SpvRayFlagsShift__SpvRayFlagsForceOpacityMicromap2StateEXTShift: SpvRayFlagsShift_ = 10;
pub const SpvRayFlagsShift__SpvRayFlagsMax: SpvRayFlagsShift_ = 2147483647;
pub type SpvRayFlagsShift_ = ::std::os::raw::c_int;
pub use self::SpvRayFlagsShift_ as SpvRayFlagsShift;
pub const SpvRayFlagsMask__SpvRayFlagsMaskNone: SpvRayFlagsMask_ = 0;
pub const SpvRayFlagsMask__SpvRayFlagsOpaqueKHRMask: SpvRayFlagsMask_ = 1;
pub const SpvRayFlagsMask__SpvRayFlagsNoOpaqueKHRMask: SpvRayFlagsMask_ = 2;
pub const SpvRayFlagsMask__SpvRayFlagsTerminateOnFirstHitKHRMask: SpvRayFlagsMask_ = 4;
pub const SpvRayFlagsMask__SpvRayFlagsSkipClosestHitShaderKHRMask: SpvRayFlagsMask_ = 8;
pub const SpvRayFlagsMask__SpvRayFlagsCullBackFacingTrianglesKHRMask: SpvRayFlagsMask_ = 16;
pub const SpvRayFlagsMask__SpvRayFlagsCullFrontFacingTrianglesKHRMask: SpvRayFlagsMask_ = 32;
pub const SpvRayFlagsMask__SpvRayFlagsCullOpaqueKHRMask: SpvRayFlagsMask_ = 64;
pub const SpvRayFlagsMask__SpvRayFlagsCullNoOpaqueKHRMask: SpvRayFlagsMask_ = 128;
pub const SpvRayFlagsMask__SpvRayFlagsSkipBuiltinPrimitivesNVMask: SpvRayFlagsMask_ = 256;
pub const SpvRayFlagsMask__SpvRayFlagsSkipTrianglesKHRMask: SpvRayFlagsMask_ = 256;
pub const SpvRayFlagsMask__SpvRayFlagsSkipAABBsKHRMask: SpvRayFlagsMask_ = 512;
pub const SpvRayFlagsMask__SpvRayFlagsForceOpacityMicromap2StateEXTMask: SpvRayFlagsMask_ = 1024;
pub type SpvRayFlagsMask_ = ::std::os::raw::c_int;
pub use self::SpvRayFlagsMask_ as SpvRayFlagsMask;
pub const SpvRayQueryIntersection__SpvRayQueryIntersectionRayQueryCandidateIntersectionKHR:
    SpvRayQueryIntersection_ = 0;
pub const SpvRayQueryIntersection__SpvRayQueryIntersectionRayQueryCommittedIntersectionKHR:
    SpvRayQueryIntersection_ = 1;
pub const SpvRayQueryIntersection__SpvRayQueryIntersectionMax: SpvRayQueryIntersection_ =
    2147483647;
pub type SpvRayQueryIntersection_ = ::std::os::raw::c_int;
pub use self::SpvRayQueryIntersection_ as SpvRayQueryIntersection;
pub const SpvRayQueryCommittedIntersectionType__SpvRayQueryCommittedIntersectionTypeRayQueryCommittedIntersectionNoneKHR : SpvRayQueryCommittedIntersectionType_ = 0 ;
pub const SpvRayQueryCommittedIntersectionType__SpvRayQueryCommittedIntersectionTypeRayQueryCommittedIntersectionTriangleKHR : SpvRayQueryCommittedIntersectionType_ = 1 ;
pub const SpvRayQueryCommittedIntersectionType__SpvRayQueryCommittedIntersectionTypeRayQueryCommittedIntersectionGeneratedKHR : SpvRayQueryCommittedIntersectionType_ = 2 ;
pub const SpvRayQueryCommittedIntersectionType__SpvRayQueryCommittedIntersectionTypeMax:
    SpvRayQueryCommittedIntersectionType_ = 2147483647;
pub type SpvRayQueryCommittedIntersectionType_ = ::std::os::raw::c_int;
pub use self::SpvRayQueryCommittedIntersectionType_ as SpvRayQueryCommittedIntersectionType;
pub const SpvRayQueryCandidateIntersectionType__SpvRayQueryCandidateIntersectionTypeRayQueryCandidateIntersectionTriangleKHR : SpvRayQueryCandidateIntersectionType_ = 0 ;
pub const SpvRayQueryCandidateIntersectionType__SpvRayQueryCandidateIntersectionTypeRayQueryCandidateIntersectionAABBKHR : SpvRayQueryCandidateIntersectionType_ = 1 ;
pub const SpvRayQueryCandidateIntersectionType__SpvRayQueryCandidateIntersectionTypeMax:
    SpvRayQueryCandidateIntersectionType_ = 2147483647;
pub type SpvRayQueryCandidateIntersectionType_ = ::std::os::raw::c_int;
pub use self::SpvRayQueryCandidateIntersectionType_ as SpvRayQueryCandidateIntersectionType;
pub const SpvFragmentShadingRateShift__SpvFragmentShadingRateVertical2PixelsShift:
    SpvFragmentShadingRateShift_ = 0;
pub const SpvFragmentShadingRateShift__SpvFragmentShadingRateVertical4PixelsShift:
    SpvFragmentShadingRateShift_ = 1;
pub const SpvFragmentShadingRateShift__SpvFragmentShadingRateHorizontal2PixelsShift:
    SpvFragmentShadingRateShift_ = 2;
pub const SpvFragmentShadingRateShift__SpvFragmentShadingRateHorizontal4PixelsShift:
    SpvFragmentShadingRateShift_ = 3;
pub const SpvFragmentShadingRateShift__SpvFragmentShadingRateMax: SpvFragmentShadingRateShift_ =
    2147483647;
pub type SpvFragmentShadingRateShift_ = ::std::os::raw::c_int;
pub use self::SpvFragmentShadingRateShift_ as SpvFragmentShadingRateShift;
pub const SpvFragmentShadingRateMask__SpvFragmentShadingRateMaskNone: SpvFragmentShadingRateMask_ =
    0;
pub const SpvFragmentShadingRateMask__SpvFragmentShadingRateVertical2PixelsMask:
    SpvFragmentShadingRateMask_ = 1;
pub const SpvFragmentShadingRateMask__SpvFragmentShadingRateVertical4PixelsMask:
    SpvFragmentShadingRateMask_ = 2;
pub const SpvFragmentShadingRateMask__SpvFragmentShadingRateHorizontal2PixelsMask:
    SpvFragmentShadingRateMask_ = 4;
pub const SpvFragmentShadingRateMask__SpvFragmentShadingRateHorizontal4PixelsMask:
    SpvFragmentShadingRateMask_ = 8;
pub type SpvFragmentShadingRateMask_ = ::std::os::raw::c_int;
pub use self::SpvFragmentShadingRateMask_ as SpvFragmentShadingRateMask;
pub const SpvFPDenormMode__SpvFPDenormModePreserve: SpvFPDenormMode_ = 0;
pub const SpvFPDenormMode__SpvFPDenormModeFlushToZero: SpvFPDenormMode_ = 1;
pub const SpvFPDenormMode__SpvFPDenormModeMax: SpvFPDenormMode_ = 2147483647;
pub type SpvFPDenormMode_ = ::std::os::raw::c_int;
pub use self::SpvFPDenormMode_ as SpvFPDenormMode;
pub const SpvFPOperationMode__SpvFPOperationModeIEEE: SpvFPOperationMode_ = 0;
pub const SpvFPOperationMode__SpvFPOperationModeALT: SpvFPOperationMode_ = 1;
pub const SpvFPOperationMode__SpvFPOperationModeMax: SpvFPOperationMode_ = 2147483647;
pub type SpvFPOperationMode_ = ::std::os::raw::c_int;
pub use self::SpvFPOperationMode_ as SpvFPOperationMode;
pub const SpvQuantizationModes__SpvQuantizationModesTRN: SpvQuantizationModes_ = 0;
pub const SpvQuantizationModes__SpvQuantizationModesTRN_ZERO: SpvQuantizationModes_ = 1;
pub const SpvQuantizationModes__SpvQuantizationModesRND: SpvQuantizationModes_ = 2;
pub const SpvQuantizationModes__SpvQuantizationModesRND_ZERO: SpvQuantizationModes_ = 3;
pub const SpvQuantizationModes__SpvQuantizationModesRND_INF: SpvQuantizationModes_ = 4;
pub const SpvQuantizationModes__SpvQuantizationModesRND_MIN_INF: SpvQuantizationModes_ = 5;
pub const SpvQuantizationModes__SpvQuantizationModesRND_CONV: SpvQuantizationModes_ = 6;
pub const SpvQuantizationModes__SpvQuantizationModesRND_CONV_ODD: SpvQuantizationModes_ = 7;
pub const SpvQuantizationModes__SpvQuantizationModesMax: SpvQuantizationModes_ = 2147483647;
pub type SpvQuantizationModes_ = ::std::os::raw::c_int;
pub use self::SpvQuantizationModes_ as SpvQuantizationModes;
pub const SpvOverflowModes__SpvOverflowModesWRAP: SpvOverflowModes_ = 0;
pub const SpvOverflowModes__SpvOverflowModesSAT: SpvOverflowModes_ = 1;
pub const SpvOverflowModes__SpvOverflowModesSAT_ZERO: SpvOverflowModes_ = 2;
pub const SpvOverflowModes__SpvOverflowModesSAT_SYM: SpvOverflowModes_ = 3;
pub const SpvOverflowModes__SpvOverflowModesMax: SpvOverflowModes_ = 2147483647;
pub type SpvOverflowModes_ = ::std::os::raw::c_int;
pub use self::SpvOverflowModes_ as SpvOverflowModes;
pub const SpvPackedVectorFormat__SpvPackedVectorFormatPackedVectorFormat4x8Bit:
    SpvPackedVectorFormat_ = 0;
pub const SpvPackedVectorFormat__SpvPackedVectorFormatPackedVectorFormat4x8BitKHR:
    SpvPackedVectorFormat_ = 0;
pub const SpvPackedVectorFormat__SpvPackedVectorFormatMax: SpvPackedVectorFormat_ = 2147483647;
pub type SpvPackedVectorFormat_ = ::std::os::raw::c_int;
pub use self::SpvPackedVectorFormat_ as SpvPackedVectorFormat;
pub const SpvCooperativeMatrixOperandsShift__SpvCooperativeMatrixOperandsMatrixASignedComponentsKHRShift : SpvCooperativeMatrixOperandsShift_ = 0 ;
pub const SpvCooperativeMatrixOperandsShift__SpvCooperativeMatrixOperandsMatrixBSignedComponentsKHRShift : SpvCooperativeMatrixOperandsShift_ = 1 ;
pub const SpvCooperativeMatrixOperandsShift__SpvCooperativeMatrixOperandsMatrixCSignedComponentsKHRShift : SpvCooperativeMatrixOperandsShift_ = 2 ;
pub const SpvCooperativeMatrixOperandsShift__SpvCooperativeMatrixOperandsMatrixResultSignedComponentsKHRShift : SpvCooperativeMatrixOperandsShift_ = 3 ;
pub const SpvCooperativeMatrixOperandsShift__SpvCooperativeMatrixOperandsSaturatingAccumulationKHRShift : SpvCooperativeMatrixOperandsShift_ = 4 ;
pub const SpvCooperativeMatrixOperandsShift__SpvCooperativeMatrixOperandsMax:
    SpvCooperativeMatrixOperandsShift_ = 2147483647;
pub type SpvCooperativeMatrixOperandsShift_ = ::std::os::raw::c_int;
pub use self::SpvCooperativeMatrixOperandsShift_ as SpvCooperativeMatrixOperandsShift;
pub const SpvCooperativeMatrixOperandsMask__SpvCooperativeMatrixOperandsMaskNone:
    SpvCooperativeMatrixOperandsMask_ = 0;
pub const SpvCooperativeMatrixOperandsMask__SpvCooperativeMatrixOperandsMatrixASignedComponentsKHRMask : SpvCooperativeMatrixOperandsMask_ = 1 ;
pub const SpvCooperativeMatrixOperandsMask__SpvCooperativeMatrixOperandsMatrixBSignedComponentsKHRMask : SpvCooperativeMatrixOperandsMask_ = 2 ;
pub const SpvCooperativeMatrixOperandsMask__SpvCooperativeMatrixOperandsMatrixCSignedComponentsKHRMask : SpvCooperativeMatrixOperandsMask_ = 4 ;
pub const SpvCooperativeMatrixOperandsMask__SpvCooperativeMatrixOperandsMatrixResultSignedComponentsKHRMask : SpvCooperativeMatrixOperandsMask_ = 8 ;
pub const SpvCooperativeMatrixOperandsMask__SpvCooperativeMatrixOperandsSaturatingAccumulationKHRMask : SpvCooperativeMatrixOperandsMask_ = 16 ;
pub type SpvCooperativeMatrixOperandsMask_ = ::std::os::raw::c_int;
pub use self::SpvCooperativeMatrixOperandsMask_ as SpvCooperativeMatrixOperandsMask;
pub const SpvCooperativeMatrixLayout__SpvCooperativeMatrixLayoutRowMajorKHR:
    SpvCooperativeMatrixLayout_ = 0;
pub const SpvCooperativeMatrixLayout__SpvCooperativeMatrixLayoutColumnMajorKHR:
    SpvCooperativeMatrixLayout_ = 1;
pub const SpvCooperativeMatrixLayout__SpvCooperativeMatrixLayoutRowBlockedInterleavedARM:
    SpvCooperativeMatrixLayout_ = 4202;
pub const SpvCooperativeMatrixLayout__SpvCooperativeMatrixLayoutColumnBlockedInterleavedARM:
    SpvCooperativeMatrixLayout_ = 4203;
pub const SpvCooperativeMatrixLayout__SpvCooperativeMatrixLayoutMax: SpvCooperativeMatrixLayout_ =
    2147483647;
pub type SpvCooperativeMatrixLayout_ = ::std::os::raw::c_int;
pub use self::SpvCooperativeMatrixLayout_ as SpvCooperativeMatrixLayout;
pub const SpvCooperativeMatrixUse__SpvCooperativeMatrixUseMatrixAKHR: SpvCooperativeMatrixUse_ = 0;
pub const SpvCooperativeMatrixUse__SpvCooperativeMatrixUseMatrixBKHR: SpvCooperativeMatrixUse_ = 1;
pub const SpvCooperativeMatrixUse__SpvCooperativeMatrixUseMatrixAccumulatorKHR:
    SpvCooperativeMatrixUse_ = 2;
pub const SpvCooperativeMatrixUse__SpvCooperativeMatrixUseMax: SpvCooperativeMatrixUse_ =
    2147483647;
pub type SpvCooperativeMatrixUse_ = ::std::os::raw::c_int;
pub use self::SpvCooperativeMatrixUse_ as SpvCooperativeMatrixUse;
pub const SpvCooperativeMatrixReduceShift__SpvCooperativeMatrixReduceRowShift:
    SpvCooperativeMatrixReduceShift_ = 0;
pub const SpvCooperativeMatrixReduceShift__SpvCooperativeMatrixReduceColumnShift:
    SpvCooperativeMatrixReduceShift_ = 1;
pub const SpvCooperativeMatrixReduceShift__SpvCooperativeMatrixReduce2x2Shift:
    SpvCooperativeMatrixReduceShift_ = 2;
pub const SpvCooperativeMatrixReduceShift__SpvCooperativeMatrixReduceMax:
    SpvCooperativeMatrixReduceShift_ = 2147483647;
pub type SpvCooperativeMatrixReduceShift_ = ::std::os::raw::c_int;
pub use self::SpvCooperativeMatrixReduceShift_ as SpvCooperativeMatrixReduceShift;
pub const SpvCooperativeMatrixReduceMask__SpvCooperativeMatrixReduceMaskNone:
    SpvCooperativeMatrixReduceMask_ = 0;
pub const SpvCooperativeMatrixReduceMask__SpvCooperativeMatrixReduceRowMask:
    SpvCooperativeMatrixReduceMask_ = 1;
pub const SpvCooperativeMatrixReduceMask__SpvCooperativeMatrixReduceColumnMask:
    SpvCooperativeMatrixReduceMask_ = 2;
pub const SpvCooperativeMatrixReduceMask__SpvCooperativeMatrixReduce2x2Mask:
    SpvCooperativeMatrixReduceMask_ = 4;
pub type SpvCooperativeMatrixReduceMask_ = ::std::os::raw::c_int;
pub use self::SpvCooperativeMatrixReduceMask_ as SpvCooperativeMatrixReduceMask;
pub const SpvTensorClampMode__SpvTensorClampModeUndefined: SpvTensorClampMode_ = 0;
pub const SpvTensorClampMode__SpvTensorClampModeConstant: SpvTensorClampMode_ = 1;
pub const SpvTensorClampMode__SpvTensorClampModeClampToEdge: SpvTensorClampMode_ = 2;
pub const SpvTensorClampMode__SpvTensorClampModeRepeat: SpvTensorClampMode_ = 3;
pub const SpvTensorClampMode__SpvTensorClampModeRepeatMirrored: SpvTensorClampMode_ = 4;
pub const SpvTensorClampMode__SpvTensorClampModeMax: SpvTensorClampMode_ = 2147483647;
pub type SpvTensorClampMode_ = ::std::os::raw::c_int;
pub use self::SpvTensorClampMode_ as SpvTensorClampMode;
pub const SpvTensorAddressingOperandsShift__SpvTensorAddressingOperandsTensorViewShift:
    SpvTensorAddressingOperandsShift_ = 0;
pub const SpvTensorAddressingOperandsShift__SpvTensorAddressingOperandsDecodeFuncShift:
    SpvTensorAddressingOperandsShift_ = 1;
pub const SpvTensorAddressingOperandsShift__SpvTensorAddressingOperandsMax:
    SpvTensorAddressingOperandsShift_ = 2147483647;
pub type SpvTensorAddressingOperandsShift_ = ::std::os::raw::c_int;
pub use self::SpvTensorAddressingOperandsShift_ as SpvTensorAddressingOperandsShift;
pub const SpvTensorAddressingOperandsMask__SpvTensorAddressingOperandsMaskNone:
    SpvTensorAddressingOperandsMask_ = 0;
pub const SpvTensorAddressingOperandsMask__SpvTensorAddressingOperandsTensorViewMask:
    SpvTensorAddressingOperandsMask_ = 1;
pub const SpvTensorAddressingOperandsMask__SpvTensorAddressingOperandsDecodeFuncMask:
    SpvTensorAddressingOperandsMask_ = 2;
pub type SpvTensorAddressingOperandsMask_ = ::std::os::raw::c_int;
pub use self::SpvTensorAddressingOperandsMask_ as SpvTensorAddressingOperandsMask;
pub const SpvTensorOperandsShift__SpvTensorOperandsNontemporalARMShift: SpvTensorOperandsShift_ = 0;
pub const SpvTensorOperandsShift__SpvTensorOperandsOutOfBoundsValueARMShift:
    SpvTensorOperandsShift_ = 1;
pub const SpvTensorOperandsShift__SpvTensorOperandsMakeElementAvailableARMShift:
    SpvTensorOperandsShift_ = 2;
pub const SpvTensorOperandsShift__SpvTensorOperandsMakeElementVisibleARMShift:
    SpvTensorOperandsShift_ = 3;
pub const SpvTensorOperandsShift__SpvTensorOperandsNonPrivateElementARMShift:
    SpvTensorOperandsShift_ = 4;
pub const SpvTensorOperandsShift__SpvTensorOperandsMax: SpvTensorOperandsShift_ = 2147483647;
pub type SpvTensorOperandsShift_ = ::std::os::raw::c_int;
pub use self::SpvTensorOperandsShift_ as SpvTensorOperandsShift;
pub const SpvTensorOperandsMask__SpvTensorOperandsMaskNone: SpvTensorOperandsMask_ = 0;
pub const SpvTensorOperandsMask__SpvTensorOperandsNontemporalARMMask: SpvTensorOperandsMask_ = 1;
pub const SpvTensorOperandsMask__SpvTensorOperandsOutOfBoundsValueARMMask: SpvTensorOperandsMask_ =
    2;
pub const SpvTensorOperandsMask__SpvTensorOperandsMakeElementAvailableARMMask:
    SpvTensorOperandsMask_ = 4;
pub const SpvTensorOperandsMask__SpvTensorOperandsMakeElementVisibleARMMask:
    SpvTensorOperandsMask_ = 8;
pub const SpvTensorOperandsMask__SpvTensorOperandsNonPrivateElementARMMask: SpvTensorOperandsMask_ =
    16;
pub type SpvTensorOperandsMask_ = ::std::os::raw::c_int;
pub use self::SpvTensorOperandsMask_ as SpvTensorOperandsMask;
pub const SpvInitializationModeQualifier__SpvInitializationModeQualifierInitOnDeviceReprogramINTEL : SpvInitializationModeQualifier_ = 0 ;
pub const SpvInitializationModeQualifier__SpvInitializationModeQualifierInitOnDeviceResetINTEL:
    SpvInitializationModeQualifier_ = 1;
pub const SpvInitializationModeQualifier__SpvInitializationModeQualifierMax:
    SpvInitializationModeQualifier_ = 2147483647;
pub type SpvInitializationModeQualifier_ = ::std::os::raw::c_int;
pub use self::SpvInitializationModeQualifier_ as SpvInitializationModeQualifier;
pub const SpvHostAccessQualifier__SpvHostAccessQualifierNoneINTEL: SpvHostAccessQualifier_ = 0;
pub const SpvHostAccessQualifier__SpvHostAccessQualifierReadINTEL: SpvHostAccessQualifier_ = 1;
pub const SpvHostAccessQualifier__SpvHostAccessQualifierWriteINTEL: SpvHostAccessQualifier_ = 2;
pub const SpvHostAccessQualifier__SpvHostAccessQualifierReadWriteINTEL: SpvHostAccessQualifier_ = 3;
pub const SpvHostAccessQualifier__SpvHostAccessQualifierMax: SpvHostAccessQualifier_ = 2147483647;
pub type SpvHostAccessQualifier_ = ::std::os::raw::c_int;
pub use self::SpvHostAccessQualifier_ as SpvHostAccessQualifier;
pub const SpvLoadCacheControl__SpvLoadCacheControlUncachedINTEL: SpvLoadCacheControl_ = 0;
pub const SpvLoadCacheControl__SpvLoadCacheControlCachedINTEL: SpvLoadCacheControl_ = 1;
pub const SpvLoadCacheControl__SpvLoadCacheControlStreamingINTEL: SpvLoadCacheControl_ = 2;
pub const SpvLoadCacheControl__SpvLoadCacheControlInvalidateAfterReadINTEL: SpvLoadCacheControl_ =
    3;
pub const SpvLoadCacheControl__SpvLoadCacheControlConstCachedINTEL: SpvLoadCacheControl_ = 4;
pub const SpvLoadCacheControl__SpvLoadCacheControlMax: SpvLoadCacheControl_ = 2147483647;
pub type SpvLoadCacheControl_ = ::std::os::raw::c_int;
pub use self::SpvLoadCacheControl_ as SpvLoadCacheControl;
pub const SpvStoreCacheControl__SpvStoreCacheControlUncachedINTEL: SpvStoreCacheControl_ = 0;
pub const SpvStoreCacheControl__SpvStoreCacheControlWriteThroughINTEL: SpvStoreCacheControl_ = 1;
pub const SpvStoreCacheControl__SpvStoreCacheControlWriteBackINTEL: SpvStoreCacheControl_ = 2;
pub const SpvStoreCacheControl__SpvStoreCacheControlStreamingINTEL: SpvStoreCacheControl_ = 3;
pub const SpvStoreCacheControl__SpvStoreCacheControlMax: SpvStoreCacheControl_ = 2147483647;
pub type SpvStoreCacheControl_ = ::std::os::raw::c_int;
pub use self::SpvStoreCacheControl_ as SpvStoreCacheControl;
pub const SpvNamedMaximumNumberOfRegisters__SpvNamedMaximumNumberOfRegistersAutoINTEL:
    SpvNamedMaximumNumberOfRegisters_ = 0;
pub const SpvNamedMaximumNumberOfRegisters__SpvNamedMaximumNumberOfRegistersMax:
    SpvNamedMaximumNumberOfRegisters_ = 2147483647;
pub type SpvNamedMaximumNumberOfRegisters_ = ::std::os::raw::c_int;
pub use self::SpvNamedMaximumNumberOfRegisters_ as SpvNamedMaximumNumberOfRegisters;
pub const SpvMatrixMultiplyAccumulateOperandsShift__SpvMatrixMultiplyAccumulateOperandsMatrixASignedComponentsINTELShift : SpvMatrixMultiplyAccumulateOperandsShift_ = 0 ;
pub const SpvMatrixMultiplyAccumulateOperandsShift__SpvMatrixMultiplyAccumulateOperandsMatrixBSignedComponentsINTELShift : SpvMatrixMultiplyAccumulateOperandsShift_ = 1 ;
pub const SpvMatrixMultiplyAccumulateOperandsShift__SpvMatrixMultiplyAccumulateOperandsMatrixCBFloat16INTELShift : SpvMatrixMultiplyAccumulateOperandsShift_ = 2 ;
pub const SpvMatrixMultiplyAccumulateOperandsShift__SpvMatrixMultiplyAccumulateOperandsMatrixResultBFloat16INTELShift : SpvMatrixMultiplyAccumulateOperandsShift_ = 3 ;
pub const SpvMatrixMultiplyAccumulateOperandsShift__SpvMatrixMultiplyAccumulateOperandsMatrixAPackedInt8INTELShift : SpvMatrixMultiplyAccumulateOperandsShift_ = 4 ;
pub const SpvMatrixMultiplyAccumulateOperandsShift__SpvMatrixMultiplyAccumulateOperandsMatrixBPackedInt8INTELShift : SpvMatrixMultiplyAccumulateOperandsShift_ = 5 ;
pub const SpvMatrixMultiplyAccumulateOperandsShift__SpvMatrixMultiplyAccumulateOperandsMatrixAPackedInt4INTELShift : SpvMatrixMultiplyAccumulateOperandsShift_ = 6 ;
pub const SpvMatrixMultiplyAccumulateOperandsShift__SpvMatrixMultiplyAccumulateOperandsMatrixBPackedInt4INTELShift : SpvMatrixMultiplyAccumulateOperandsShift_ = 7 ;
pub const SpvMatrixMultiplyAccumulateOperandsShift__SpvMatrixMultiplyAccumulateOperandsMatrixATF32INTELShift : SpvMatrixMultiplyAccumulateOperandsShift_ = 8 ;
pub const SpvMatrixMultiplyAccumulateOperandsShift__SpvMatrixMultiplyAccumulateOperandsMatrixBTF32INTELShift : SpvMatrixMultiplyAccumulateOperandsShift_ = 9 ;
pub const SpvMatrixMultiplyAccumulateOperandsShift__SpvMatrixMultiplyAccumulateOperandsMatrixAPackedFloat16INTELShift : SpvMatrixMultiplyAccumulateOperandsShift_ = 10 ;
pub const SpvMatrixMultiplyAccumulateOperandsShift__SpvMatrixMultiplyAccumulateOperandsMatrixBPackedFloat16INTELShift : SpvMatrixMultiplyAccumulateOperandsShift_ = 11 ;
pub const SpvMatrixMultiplyAccumulateOperandsShift__SpvMatrixMultiplyAccumulateOperandsMatrixAPackedBFloat16INTELShift : SpvMatrixMultiplyAccumulateOperandsShift_ = 12 ;
pub const SpvMatrixMultiplyAccumulateOperandsShift__SpvMatrixMultiplyAccumulateOperandsMatrixBPackedBFloat16INTELShift : SpvMatrixMultiplyAccumulateOperandsShift_ = 13 ;
pub const SpvMatrixMultiplyAccumulateOperandsShift__SpvMatrixMultiplyAccumulateOperandsMax:
    SpvMatrixMultiplyAccumulateOperandsShift_ = 2147483647;
pub type SpvMatrixMultiplyAccumulateOperandsShift_ = ::std::os::raw::c_int;
pub use self::SpvMatrixMultiplyAccumulateOperandsShift_ as SpvMatrixMultiplyAccumulateOperandsShift;
pub const SpvMatrixMultiplyAccumulateOperandsMask__SpvMatrixMultiplyAccumulateOperandsMaskNone:
    SpvMatrixMultiplyAccumulateOperandsMask_ = 0;
pub const SpvMatrixMultiplyAccumulateOperandsMask__SpvMatrixMultiplyAccumulateOperandsMatrixASignedComponentsINTELMask : SpvMatrixMultiplyAccumulateOperandsMask_ = 1 ;
pub const SpvMatrixMultiplyAccumulateOperandsMask__SpvMatrixMultiplyAccumulateOperandsMatrixBSignedComponentsINTELMask : SpvMatrixMultiplyAccumulateOperandsMask_ = 2 ;
pub const SpvMatrixMultiplyAccumulateOperandsMask__SpvMatrixMultiplyAccumulateOperandsMatrixCBFloat16INTELMask : SpvMatrixMultiplyAccumulateOperandsMask_ = 4 ;
pub const SpvMatrixMultiplyAccumulateOperandsMask__SpvMatrixMultiplyAccumulateOperandsMatrixResultBFloat16INTELMask : SpvMatrixMultiplyAccumulateOperandsMask_ = 8 ;
pub const SpvMatrixMultiplyAccumulateOperandsMask__SpvMatrixMultiplyAccumulateOperandsMatrixAPackedInt8INTELMask : SpvMatrixMultiplyAccumulateOperandsMask_ = 16 ;
pub const SpvMatrixMultiplyAccumulateOperandsMask__SpvMatrixMultiplyAccumulateOperandsMatrixBPackedInt8INTELMask : SpvMatrixMultiplyAccumulateOperandsMask_ = 32 ;
pub const SpvMatrixMultiplyAccumulateOperandsMask__SpvMatrixMultiplyAccumulateOperandsMatrixAPackedInt4INTELMask : SpvMatrixMultiplyAccumulateOperandsMask_ = 64 ;
pub const SpvMatrixMultiplyAccumulateOperandsMask__SpvMatrixMultiplyAccumulateOperandsMatrixBPackedInt4INTELMask : SpvMatrixMultiplyAccumulateOperandsMask_ = 128 ;
pub const SpvMatrixMultiplyAccumulateOperandsMask__SpvMatrixMultiplyAccumulateOperandsMatrixATF32INTELMask : SpvMatrixMultiplyAccumulateOperandsMask_ = 256 ;
pub const SpvMatrixMultiplyAccumulateOperandsMask__SpvMatrixMultiplyAccumulateOperandsMatrixBTF32INTELMask : SpvMatrixMultiplyAccumulateOperandsMask_ = 512 ;
pub const SpvMatrixMultiplyAccumulateOperandsMask__SpvMatrixMultiplyAccumulateOperandsMatrixAPackedFloat16INTELMask : SpvMatrixMultiplyAccumulateOperandsMask_ = 1024 ;
pub const SpvMatrixMultiplyAccumulateOperandsMask__SpvMatrixMultiplyAccumulateOperandsMatrixBPackedFloat16INTELMask : SpvMatrixMultiplyAccumulateOperandsMask_ = 2048 ;
pub const SpvMatrixMultiplyAccumulateOperandsMask__SpvMatrixMultiplyAccumulateOperandsMatrixAPackedBFloat16INTELMask : SpvMatrixMultiplyAccumulateOperandsMask_ = 4096 ;
pub const SpvMatrixMultiplyAccumulateOperandsMask__SpvMatrixMultiplyAccumulateOperandsMatrixBPackedBFloat16INTELMask : SpvMatrixMultiplyAccumulateOperandsMask_ = 8192 ;
pub type SpvMatrixMultiplyAccumulateOperandsMask_ = ::std::os::raw::c_int;
pub use self::SpvMatrixMultiplyAccumulateOperandsMask_ as SpvMatrixMultiplyAccumulateOperandsMask;
pub const SpvRawAccessChainOperandsShift__SpvRawAccessChainOperandsRobustnessPerComponentNVShift:
    SpvRawAccessChainOperandsShift_ = 0;
pub const SpvRawAccessChainOperandsShift__SpvRawAccessChainOperandsRobustnessPerElementNVShift:
    SpvRawAccessChainOperandsShift_ = 1;
pub const SpvRawAccessChainOperandsShift__SpvRawAccessChainOperandsMax:
    SpvRawAccessChainOperandsShift_ = 2147483647;
pub type SpvRawAccessChainOperandsShift_ = ::std::os::raw::c_int;
pub use self::SpvRawAccessChainOperandsShift_ as SpvRawAccessChainOperandsShift;
pub const SpvRawAccessChainOperandsMask__SpvRawAccessChainOperandsMaskNone:
    SpvRawAccessChainOperandsMask_ = 0;
pub const SpvRawAccessChainOperandsMask__SpvRawAccessChainOperandsRobustnessPerComponentNVMask:
    SpvRawAccessChainOperandsMask_ = 1;
pub const SpvRawAccessChainOperandsMask__SpvRawAccessChainOperandsRobustnessPerElementNVMask:
    SpvRawAccessChainOperandsMask_ = 2;
pub type SpvRawAccessChainOperandsMask_ = ::std::os::raw::c_int;
pub use self::SpvRawAccessChainOperandsMask_ as SpvRawAccessChainOperandsMask;
pub const SpvFPEncoding__SpvFPEncodingBFloat16KHR: SpvFPEncoding_ = 0;
pub const SpvFPEncoding__SpvFPEncodingFloat8E4M3EXT: SpvFPEncoding_ = 4214;
pub const SpvFPEncoding__SpvFPEncodingFloat8E5M2EXT: SpvFPEncoding_ = 4215;
pub const SpvFPEncoding__SpvFPEncodingMax: SpvFPEncoding_ = 2147483647;
pub type SpvFPEncoding_ = ::std::os::raw::c_int;
pub use self::SpvFPEncoding_ as SpvFPEncoding;
pub const SpvCooperativeVectorMatrixLayout__SpvCooperativeVectorMatrixLayoutRowMajorNV:
    SpvCooperativeVectorMatrixLayout_ = 0;
pub const SpvCooperativeVectorMatrixLayout__SpvCooperativeVectorMatrixLayoutColumnMajorNV:
    SpvCooperativeVectorMatrixLayout_ = 1;
pub const SpvCooperativeVectorMatrixLayout__SpvCooperativeVectorMatrixLayoutInferencingOptimalNV:
    SpvCooperativeVectorMatrixLayout_ = 2;
pub const SpvCooperativeVectorMatrixLayout__SpvCooperativeVectorMatrixLayoutTrainingOptimalNV:
    SpvCooperativeVectorMatrixLayout_ = 3;
pub const SpvCooperativeVectorMatrixLayout__SpvCooperativeVectorMatrixLayoutMax:
    SpvCooperativeVectorMatrixLayout_ = 2147483647;
pub type SpvCooperativeVectorMatrixLayout_ = ::std::os::raw::c_int;
pub use self::SpvCooperativeVectorMatrixLayout_ as SpvCooperativeVectorMatrixLayout;
pub const SpvComponentType__SpvComponentTypeFloat16NV: SpvComponentType_ = 0;
pub const SpvComponentType__SpvComponentTypeFloat32NV: SpvComponentType_ = 1;
pub const SpvComponentType__SpvComponentTypeFloat64NV: SpvComponentType_ = 2;
pub const SpvComponentType__SpvComponentTypeSignedInt8NV: SpvComponentType_ = 3;
pub const SpvComponentType__SpvComponentTypeSignedInt16NV: SpvComponentType_ = 4;
pub const SpvComponentType__SpvComponentTypeSignedInt32NV: SpvComponentType_ = 5;
pub const SpvComponentType__SpvComponentTypeSignedInt64NV: SpvComponentType_ = 6;
pub const SpvComponentType__SpvComponentTypeUnsignedInt8NV: SpvComponentType_ = 7;
pub const SpvComponentType__SpvComponentTypeUnsignedInt16NV: SpvComponentType_ = 8;
pub const SpvComponentType__SpvComponentTypeUnsignedInt32NV: SpvComponentType_ = 9;
pub const SpvComponentType__SpvComponentTypeUnsignedInt64NV: SpvComponentType_ = 10;
pub const SpvComponentType__SpvComponentTypeSignedInt8PackedNV: SpvComponentType_ = 1000491000;
pub const SpvComponentType__SpvComponentTypeUnsignedInt8PackedNV: SpvComponentType_ = 1000491001;
pub const SpvComponentType__SpvComponentTypeFloatE4M3NV: SpvComponentType_ = 1000491002;
pub const SpvComponentType__SpvComponentTypeFloatE5M2NV: SpvComponentType_ = 1000491003;
pub const SpvComponentType__SpvComponentTypeMax: SpvComponentType_ = 2147483647;
pub type SpvComponentType_ = ::std::os::raw::c_int;
pub use self::SpvComponentType_ as SpvComponentType;
pub const SpvOp__SpvOpNop: SpvOp_ = 0;
pub const SpvOp__SpvOpUndef: SpvOp_ = 1;
pub const SpvOp__SpvOpSourceContinued: SpvOp_ = 2;
pub const SpvOp__SpvOpSource: SpvOp_ = 3;
pub const SpvOp__SpvOpSourceExtension: SpvOp_ = 4;
pub const SpvOp__SpvOpName: SpvOp_ = 5;
pub const SpvOp__SpvOpMemberName: SpvOp_ = 6;
pub const SpvOp__SpvOpString: SpvOp_ = 7;
pub const SpvOp__SpvOpLine: SpvOp_ = 8;
pub const SpvOp__SpvOpExtension: SpvOp_ = 10;
pub const SpvOp__SpvOpExtInstImport: SpvOp_ = 11;
pub const SpvOp__SpvOpExtInst: SpvOp_ = 12;
pub const SpvOp__SpvOpMemoryModel: SpvOp_ = 14;
pub const SpvOp__SpvOpEntryPoint: SpvOp_ = 15;
pub const SpvOp__SpvOpExecutionMode: SpvOp_ = 16;
pub const SpvOp__SpvOpCapability: SpvOp_ = 17;
pub const SpvOp__SpvOpTypeVoid: SpvOp_ = 19;
pub const SpvOp__SpvOpTypeBool: SpvOp_ = 20;
pub const SpvOp__SpvOpTypeInt: SpvOp_ = 21;
pub const SpvOp__SpvOpTypeFloat: SpvOp_ = 22;
pub const SpvOp__SpvOpTypeVector: SpvOp_ = 23;
pub const SpvOp__SpvOpTypeMatrix: SpvOp_ = 24;
pub const SpvOp__SpvOpTypeImage: SpvOp_ = 25;
pub const SpvOp__SpvOpTypeSampler: SpvOp_ = 26;
pub const SpvOp__SpvOpTypeSampledImage: SpvOp_ = 27;
pub const SpvOp__SpvOpTypeArray: SpvOp_ = 28;
pub const SpvOp__SpvOpTypeRuntimeArray: SpvOp_ = 29;
pub const SpvOp__SpvOpTypeStruct: SpvOp_ = 30;
pub const SpvOp__SpvOpTypeOpaque: SpvOp_ = 31;
pub const SpvOp__SpvOpTypePointer: SpvOp_ = 32;
pub const SpvOp__SpvOpTypeFunction: SpvOp_ = 33;
pub const SpvOp__SpvOpTypeEvent: SpvOp_ = 34;
pub const SpvOp__SpvOpTypeDeviceEvent: SpvOp_ = 35;
pub const SpvOp__SpvOpTypeReserveId: SpvOp_ = 36;
pub const SpvOp__SpvOpTypeQueue: SpvOp_ = 37;
pub const SpvOp__SpvOpTypePipe: SpvOp_ = 38;
pub const SpvOp__SpvOpTypeForwardPointer: SpvOp_ = 39;
pub const SpvOp__SpvOpConstantTrue: SpvOp_ = 41;
pub const SpvOp__SpvOpConstantFalse: SpvOp_ = 42;
pub const SpvOp__SpvOpConstant: SpvOp_ = 43;
pub const SpvOp__SpvOpConstantComposite: SpvOp_ = 44;
pub const SpvOp__SpvOpConstantSampler: SpvOp_ = 45;
pub const SpvOp__SpvOpConstantNull: SpvOp_ = 46;
pub const SpvOp__SpvOpSpecConstantTrue: SpvOp_ = 48;
pub const SpvOp__SpvOpSpecConstantFalse: SpvOp_ = 49;
pub const SpvOp__SpvOpSpecConstant: SpvOp_ = 50;
pub const SpvOp__SpvOpSpecConstantComposite: SpvOp_ = 51;
pub const SpvOp__SpvOpSpecConstantOp: SpvOp_ = 52;
pub const SpvOp__SpvOpFunction: SpvOp_ = 54;
pub const SpvOp__SpvOpFunctionParameter: SpvOp_ = 55;
pub const SpvOp__SpvOpFunctionEnd: SpvOp_ = 56;
pub const SpvOp__SpvOpFunctionCall: SpvOp_ = 57;
pub const SpvOp__SpvOpVariable: SpvOp_ = 59;
pub const SpvOp__SpvOpImageTexelPointer: SpvOp_ = 60;
pub const SpvOp__SpvOpLoad: SpvOp_ = 61;
pub const SpvOp__SpvOpStore: SpvOp_ = 62;
pub const SpvOp__SpvOpCopyMemory: SpvOp_ = 63;
pub const SpvOp__SpvOpCopyMemorySized: SpvOp_ = 64;
pub const SpvOp__SpvOpAccessChain: SpvOp_ = 65;
pub const SpvOp__SpvOpInBoundsAccessChain: SpvOp_ = 66;
pub const SpvOp__SpvOpPtrAccessChain: SpvOp_ = 67;
pub const SpvOp__SpvOpArrayLength: SpvOp_ = 68;
pub const SpvOp__SpvOpGenericPtrMemSemantics: SpvOp_ = 69;
pub const SpvOp__SpvOpInBoundsPtrAccessChain: SpvOp_ = 70;
pub const SpvOp__SpvOpDecorate: SpvOp_ = 71;
pub const SpvOp__SpvOpMemberDecorate: SpvOp_ = 72;
pub const SpvOp__SpvOpDecorationGroup: SpvOp_ = 73;
pub const SpvOp__SpvOpGroupDecorate: SpvOp_ = 74;
pub const SpvOp__SpvOpGroupMemberDecorate: SpvOp_ = 75;
pub const SpvOp__SpvOpVectorExtractDynamic: SpvOp_ = 77;
pub const SpvOp__SpvOpVectorInsertDynamic: SpvOp_ = 78;
pub const SpvOp__SpvOpVectorShuffle: SpvOp_ = 79;
pub const SpvOp__SpvOpCompositeConstruct: SpvOp_ = 80;
pub const SpvOp__SpvOpCompositeExtract: SpvOp_ = 81;
pub const SpvOp__SpvOpCompositeInsert: SpvOp_ = 82;
pub const SpvOp__SpvOpCopyObject: SpvOp_ = 83;
pub const SpvOp__SpvOpTranspose: SpvOp_ = 84;
pub const SpvOp__SpvOpSampledImage: SpvOp_ = 86;
pub const SpvOp__SpvOpImageSampleImplicitLod: SpvOp_ = 87;
pub const SpvOp__SpvOpImageSampleExplicitLod: SpvOp_ = 88;
pub const SpvOp__SpvOpImageSampleDrefImplicitLod: SpvOp_ = 89;
pub const SpvOp__SpvOpImageSampleDrefExplicitLod: SpvOp_ = 90;
pub const SpvOp__SpvOpImageSampleProjImplicitLod: SpvOp_ = 91;
pub const SpvOp__SpvOpImageSampleProjExplicitLod: SpvOp_ = 92;
pub const SpvOp__SpvOpImageSampleProjDrefImplicitLod: SpvOp_ = 93;
pub const SpvOp__SpvOpImageSampleProjDrefExplicitLod: SpvOp_ = 94;
pub const SpvOp__SpvOpImageFetch: SpvOp_ = 95;
pub const SpvOp__SpvOpImageGather: SpvOp_ = 96;
pub const SpvOp__SpvOpImageDrefGather: SpvOp_ = 97;
pub const SpvOp__SpvOpImageRead: SpvOp_ = 98;
pub const SpvOp__SpvOpImageWrite: SpvOp_ = 99;
pub const SpvOp__SpvOpImage: SpvOp_ = 100;
pub const SpvOp__SpvOpImageQueryFormat: SpvOp_ = 101;
pub const SpvOp__SpvOpImageQueryOrder: SpvOp_ = 102;
pub const SpvOp__SpvOpImageQuerySizeLod: SpvOp_ = 103;
pub const SpvOp__SpvOpImageQuerySize: SpvOp_ = 104;
pub const SpvOp__SpvOpImageQueryLod: SpvOp_ = 105;
pub const SpvOp__SpvOpImageQueryLevels: SpvOp_ = 106;
pub const SpvOp__SpvOpImageQuerySamples: SpvOp_ = 107;
pub const SpvOp__SpvOpConvertFToU: SpvOp_ = 109;
pub const SpvOp__SpvOpConvertFToS: SpvOp_ = 110;
pub const SpvOp__SpvOpConvertSToF: SpvOp_ = 111;
pub const SpvOp__SpvOpConvertUToF: SpvOp_ = 112;
pub const SpvOp__SpvOpUConvert: SpvOp_ = 113;
pub const SpvOp__SpvOpSConvert: SpvOp_ = 114;
pub const SpvOp__SpvOpFConvert: SpvOp_ = 115;
pub const SpvOp__SpvOpQuantizeToF16: SpvOp_ = 116;
pub const SpvOp__SpvOpConvertPtrToU: SpvOp_ = 117;
pub const SpvOp__SpvOpSatConvertSToU: SpvOp_ = 118;
pub const SpvOp__SpvOpSatConvertUToS: SpvOp_ = 119;
pub const SpvOp__SpvOpConvertUToPtr: SpvOp_ = 120;
pub const SpvOp__SpvOpPtrCastToGeneric: SpvOp_ = 121;
pub const SpvOp__SpvOpGenericCastToPtr: SpvOp_ = 122;
pub const SpvOp__SpvOpGenericCastToPtrExplicit: SpvOp_ = 123;
pub const SpvOp__SpvOpBitcast: SpvOp_ = 124;
pub const SpvOp__SpvOpSNegate: SpvOp_ = 126;
pub const SpvOp__SpvOpFNegate: SpvOp_ = 127;
pub const SpvOp__SpvOpIAdd: SpvOp_ = 128;
pub const SpvOp__SpvOpFAdd: SpvOp_ = 129;
pub const SpvOp__SpvOpISub: SpvOp_ = 130;
pub const SpvOp__SpvOpFSub: SpvOp_ = 131;
pub const SpvOp__SpvOpIMul: SpvOp_ = 132;
pub const SpvOp__SpvOpFMul: SpvOp_ = 133;
pub const SpvOp__SpvOpUDiv: SpvOp_ = 134;
pub const SpvOp__SpvOpSDiv: SpvOp_ = 135;
pub const SpvOp__SpvOpFDiv: SpvOp_ = 136;
pub const SpvOp__SpvOpUMod: SpvOp_ = 137;
pub const SpvOp__SpvOpSRem: SpvOp_ = 138;
pub const SpvOp__SpvOpSMod: SpvOp_ = 139;
pub const SpvOp__SpvOpFRem: SpvOp_ = 140;
pub const SpvOp__SpvOpFMod: SpvOp_ = 141;
pub const SpvOp__SpvOpVectorTimesScalar: SpvOp_ = 142;
pub const SpvOp__SpvOpMatrixTimesScalar: SpvOp_ = 143;
pub const SpvOp__SpvOpVectorTimesMatrix: SpvOp_ = 144;
pub const SpvOp__SpvOpMatrixTimesVector: SpvOp_ = 145;
pub const SpvOp__SpvOpMatrixTimesMatrix: SpvOp_ = 146;
pub const SpvOp__SpvOpOuterProduct: SpvOp_ = 147;
pub const SpvOp__SpvOpDot: SpvOp_ = 148;
pub const SpvOp__SpvOpIAddCarry: SpvOp_ = 149;
pub const SpvOp__SpvOpISubBorrow: SpvOp_ = 150;
pub const SpvOp__SpvOpUMulExtended: SpvOp_ = 151;
pub const SpvOp__SpvOpSMulExtended: SpvOp_ = 152;
pub const SpvOp__SpvOpAny: SpvOp_ = 154;
pub const SpvOp__SpvOpAll: SpvOp_ = 155;
pub const SpvOp__SpvOpIsNan: SpvOp_ = 156;
pub const SpvOp__SpvOpIsInf: SpvOp_ = 157;
pub const SpvOp__SpvOpIsFinite: SpvOp_ = 158;
pub const SpvOp__SpvOpIsNormal: SpvOp_ = 159;
pub const SpvOp__SpvOpSignBitSet: SpvOp_ = 160;
pub const SpvOp__SpvOpLessOrGreater: SpvOp_ = 161;
pub const SpvOp__SpvOpOrdered: SpvOp_ = 162;
pub const SpvOp__SpvOpUnordered: SpvOp_ = 163;
pub const SpvOp__SpvOpLogicalEqual: SpvOp_ = 164;
pub const SpvOp__SpvOpLogicalNotEqual: SpvOp_ = 165;
pub const SpvOp__SpvOpLogicalOr: SpvOp_ = 166;
pub const SpvOp__SpvOpLogicalAnd: SpvOp_ = 167;
pub const SpvOp__SpvOpLogicalNot: SpvOp_ = 168;
pub const SpvOp__SpvOpSelect: SpvOp_ = 169;
pub const SpvOp__SpvOpIEqual: SpvOp_ = 170;
pub const SpvOp__SpvOpINotEqual: SpvOp_ = 171;
pub const SpvOp__SpvOpUGreaterThan: SpvOp_ = 172;
pub const SpvOp__SpvOpSGreaterThan: SpvOp_ = 173;
pub const SpvOp__SpvOpUGreaterThanEqual: SpvOp_ = 174;
pub const SpvOp__SpvOpSGreaterThanEqual: SpvOp_ = 175;
pub const SpvOp__SpvOpULessThan: SpvOp_ = 176;
pub const SpvOp__SpvOpSLessThan: SpvOp_ = 177;
pub const SpvOp__SpvOpULessThanEqual: SpvOp_ = 178;
pub const SpvOp__SpvOpSLessThanEqual: SpvOp_ = 179;
pub const SpvOp__SpvOpFOrdEqual: SpvOp_ = 180;
pub const SpvOp__SpvOpFUnordEqual: SpvOp_ = 181;
pub const SpvOp__SpvOpFOrdNotEqual: SpvOp_ = 182;
pub const SpvOp__SpvOpFUnordNotEqual: SpvOp_ = 183;
pub const SpvOp__SpvOpFOrdLessThan: SpvOp_ = 184;
pub const SpvOp__SpvOpFUnordLessThan: SpvOp_ = 185;
pub const SpvOp__SpvOpFOrdGreaterThan: SpvOp_ = 186;
pub const SpvOp__SpvOpFUnordGreaterThan: SpvOp_ = 187;
pub const SpvOp__SpvOpFOrdLessThanEqual: SpvOp_ = 188;
pub const SpvOp__SpvOpFUnordLessThanEqual: SpvOp_ = 189;
pub const SpvOp__SpvOpFOrdGreaterThanEqual: SpvOp_ = 190;
pub const SpvOp__SpvOpFUnordGreaterThanEqual: SpvOp_ = 191;
pub const SpvOp__SpvOpShiftRightLogical: SpvOp_ = 194;
pub const SpvOp__SpvOpShiftRightArithmetic: SpvOp_ = 195;
pub const SpvOp__SpvOpShiftLeftLogical: SpvOp_ = 196;
pub const SpvOp__SpvOpBitwiseOr: SpvOp_ = 197;
pub const SpvOp__SpvOpBitwiseXor: SpvOp_ = 198;
pub const SpvOp__SpvOpBitwiseAnd: SpvOp_ = 199;
pub const SpvOp__SpvOpNot: SpvOp_ = 200;
pub const SpvOp__SpvOpBitFieldInsert: SpvOp_ = 201;
pub const SpvOp__SpvOpBitFieldSExtract: SpvOp_ = 202;
pub const SpvOp__SpvOpBitFieldUExtract: SpvOp_ = 203;
pub const SpvOp__SpvOpBitReverse: SpvOp_ = 204;
pub const SpvOp__SpvOpBitCount: SpvOp_ = 205;
pub const SpvOp__SpvOpDPdx: SpvOp_ = 207;
pub const SpvOp__SpvOpDPdy: SpvOp_ = 208;
pub const SpvOp__SpvOpFwidth: SpvOp_ = 209;
pub const SpvOp__SpvOpDPdxFine: SpvOp_ = 210;
pub const SpvOp__SpvOpDPdyFine: SpvOp_ = 211;
pub const SpvOp__SpvOpFwidthFine: SpvOp_ = 212;
pub const SpvOp__SpvOpDPdxCoarse: SpvOp_ = 213;
pub const SpvOp__SpvOpDPdyCoarse: SpvOp_ = 214;
pub const SpvOp__SpvOpFwidthCoarse: SpvOp_ = 215;
pub const SpvOp__SpvOpEmitVertex: SpvOp_ = 218;
pub const SpvOp__SpvOpEndPrimitive: SpvOp_ = 219;
pub const SpvOp__SpvOpEmitStreamVertex: SpvOp_ = 220;
pub const SpvOp__SpvOpEndStreamPrimitive: SpvOp_ = 221;
pub const SpvOp__SpvOpControlBarrier: SpvOp_ = 224;
pub const SpvOp__SpvOpMemoryBarrier: SpvOp_ = 225;
pub const SpvOp__SpvOpAtomicLoad: SpvOp_ = 227;
pub const SpvOp__SpvOpAtomicStore: SpvOp_ = 228;
pub const SpvOp__SpvOpAtomicExchange: SpvOp_ = 229;
pub const SpvOp__SpvOpAtomicCompareExchange: SpvOp_ = 230;
pub const SpvOp__SpvOpAtomicCompareExchangeWeak: SpvOp_ = 231;
pub const SpvOp__SpvOpAtomicIIncrement: SpvOp_ = 232;
pub const SpvOp__SpvOpAtomicIDecrement: SpvOp_ = 233;
pub const SpvOp__SpvOpAtomicIAdd: SpvOp_ = 234;
pub const SpvOp__SpvOpAtomicISub: SpvOp_ = 235;
pub const SpvOp__SpvOpAtomicSMin: SpvOp_ = 236;
pub const SpvOp__SpvOpAtomicUMin: SpvOp_ = 237;
pub const SpvOp__SpvOpAtomicSMax: SpvOp_ = 238;
pub const SpvOp__SpvOpAtomicUMax: SpvOp_ = 239;
pub const SpvOp__SpvOpAtomicAnd: SpvOp_ = 240;
pub const SpvOp__SpvOpAtomicOr: SpvOp_ = 241;
pub const SpvOp__SpvOpAtomicXor: SpvOp_ = 242;
pub const SpvOp__SpvOpPhi: SpvOp_ = 245;
pub const SpvOp__SpvOpLoopMerge: SpvOp_ = 246;
pub const SpvOp__SpvOpSelectionMerge: SpvOp_ = 247;
pub const SpvOp__SpvOpLabel: SpvOp_ = 248;
pub const SpvOp__SpvOpBranch: SpvOp_ = 249;
pub const SpvOp__SpvOpBranchConditional: SpvOp_ = 250;
pub const SpvOp__SpvOpSwitch: SpvOp_ = 251;
pub const SpvOp__SpvOpKill: SpvOp_ = 252;
pub const SpvOp__SpvOpReturn: SpvOp_ = 253;
pub const SpvOp__SpvOpReturnValue: SpvOp_ = 254;
pub const SpvOp__SpvOpUnreachable: SpvOp_ = 255;
pub const SpvOp__SpvOpLifetimeStart: SpvOp_ = 256;
pub const SpvOp__SpvOpLifetimeStop: SpvOp_ = 257;
pub const SpvOp__SpvOpGroupAsyncCopy: SpvOp_ = 259;
pub const SpvOp__SpvOpGroupWaitEvents: SpvOp_ = 260;
pub const SpvOp__SpvOpGroupAll: SpvOp_ = 261;
pub const SpvOp__SpvOpGroupAny: SpvOp_ = 262;
pub const SpvOp__SpvOpGroupBroadcast: SpvOp_ = 263;
pub const SpvOp__SpvOpGroupIAdd: SpvOp_ = 264;
pub const SpvOp__SpvOpGroupFAdd: SpvOp_ = 265;
pub const SpvOp__SpvOpGroupFMin: SpvOp_ = 266;
pub const SpvOp__SpvOpGroupUMin: SpvOp_ = 267;
pub const SpvOp__SpvOpGroupSMin: SpvOp_ = 268;
pub const SpvOp__SpvOpGroupFMax: SpvOp_ = 269;
pub const SpvOp__SpvOpGroupUMax: SpvOp_ = 270;
pub const SpvOp__SpvOpGroupSMax: SpvOp_ = 271;
pub const SpvOp__SpvOpReadPipe: SpvOp_ = 274;
pub const SpvOp__SpvOpWritePipe: SpvOp_ = 275;
pub const SpvOp__SpvOpReservedReadPipe: SpvOp_ = 276;
pub const SpvOp__SpvOpReservedWritePipe: SpvOp_ = 277;
pub const SpvOp__SpvOpReserveReadPipePackets: SpvOp_ = 278;
pub const SpvOp__SpvOpReserveWritePipePackets: SpvOp_ = 279;
pub const SpvOp__SpvOpCommitReadPipe: SpvOp_ = 280;
pub const SpvOp__SpvOpCommitWritePipe: SpvOp_ = 281;
pub const SpvOp__SpvOpIsValidReserveId: SpvOp_ = 282;
pub const SpvOp__SpvOpGetNumPipePackets: SpvOp_ = 283;
pub const SpvOp__SpvOpGetMaxPipePackets: SpvOp_ = 284;
pub const SpvOp__SpvOpGroupReserveReadPipePackets: SpvOp_ = 285;
pub const SpvOp__SpvOpGroupReserveWritePipePackets: SpvOp_ = 286;
pub const SpvOp__SpvOpGroupCommitReadPipe: SpvOp_ = 287;
pub const SpvOp__SpvOpGroupCommitWritePipe: SpvOp_ = 288;
pub const SpvOp__SpvOpEnqueueMarker: SpvOp_ = 291;
pub const SpvOp__SpvOpEnqueueKernel: SpvOp_ = 292;
pub const SpvOp__SpvOpGetKernelNDrangeSubGroupCount: SpvOp_ = 293;
pub const SpvOp__SpvOpGetKernelNDrangeMaxSubGroupSize: SpvOp_ = 294;
pub const SpvOp__SpvOpGetKernelWorkGroupSize: SpvOp_ = 295;
pub const SpvOp__SpvOpGetKernelPreferredWorkGroupSizeMultiple: SpvOp_ = 296;
pub const SpvOp__SpvOpRetainEvent: SpvOp_ = 297;
pub const SpvOp__SpvOpReleaseEvent: SpvOp_ = 298;
pub const SpvOp__SpvOpCreateUserEvent: SpvOp_ = 299;
pub const SpvOp__SpvOpIsValidEvent: SpvOp_ = 300;
pub const SpvOp__SpvOpSetUserEventStatus: SpvOp_ = 301;
pub const SpvOp__SpvOpCaptureEventProfilingInfo: SpvOp_ = 302;
pub const SpvOp__SpvOpGetDefaultQueue: SpvOp_ = 303;
pub const SpvOp__SpvOpBuildNDRange: SpvOp_ = 304;
pub const SpvOp__SpvOpImageSparseSampleImplicitLod: SpvOp_ = 305;
pub const SpvOp__SpvOpImageSparseSampleExplicitLod: SpvOp_ = 306;
pub const SpvOp__SpvOpImageSparseSampleDrefImplicitLod: SpvOp_ = 307;
pub const SpvOp__SpvOpImageSparseSampleDrefExplicitLod: SpvOp_ = 308;
pub const SpvOp__SpvOpImageSparseSampleProjImplicitLod: SpvOp_ = 309;
pub const SpvOp__SpvOpImageSparseSampleProjExplicitLod: SpvOp_ = 310;
pub const SpvOp__SpvOpImageSparseSampleProjDrefImplicitLod: SpvOp_ = 311;
pub const SpvOp__SpvOpImageSparseSampleProjDrefExplicitLod: SpvOp_ = 312;
pub const SpvOp__SpvOpImageSparseFetch: SpvOp_ = 313;
pub const SpvOp__SpvOpImageSparseGather: SpvOp_ = 314;
pub const SpvOp__SpvOpImageSparseDrefGather: SpvOp_ = 315;
pub const SpvOp__SpvOpImageSparseTexelsResident: SpvOp_ = 316;
pub const SpvOp__SpvOpNoLine: SpvOp_ = 317;
pub const SpvOp__SpvOpAtomicFlagTestAndSet: SpvOp_ = 318;
pub const SpvOp__SpvOpAtomicFlagClear: SpvOp_ = 319;
pub const SpvOp__SpvOpImageSparseRead: SpvOp_ = 320;
pub const SpvOp__SpvOpSizeOf: SpvOp_ = 321;
pub const SpvOp__SpvOpTypePipeStorage: SpvOp_ = 322;
pub const SpvOp__SpvOpConstantPipeStorage: SpvOp_ = 323;
pub const SpvOp__SpvOpCreatePipeFromPipeStorage: SpvOp_ = 324;
pub const SpvOp__SpvOpGetKernelLocalSizeForSubgroupCount: SpvOp_ = 325;
pub const SpvOp__SpvOpGetKernelMaxNumSubgroups: SpvOp_ = 326;
pub const SpvOp__SpvOpTypeNamedBarrier: SpvOp_ = 327;
pub const SpvOp__SpvOpNamedBarrierInitialize: SpvOp_ = 328;
pub const SpvOp__SpvOpMemoryNamedBarrier: SpvOp_ = 329;
pub const SpvOp__SpvOpModuleProcessed: SpvOp_ = 330;
pub const SpvOp__SpvOpExecutionModeId: SpvOp_ = 331;
pub const SpvOp__SpvOpDecorateId: SpvOp_ = 332;
pub const SpvOp__SpvOpGroupNonUniformElect: SpvOp_ = 333;
pub const SpvOp__SpvOpGroupNonUniformAll: SpvOp_ = 334;
pub const SpvOp__SpvOpGroupNonUniformAny: SpvOp_ = 335;
pub const SpvOp__SpvOpGroupNonUniformAllEqual: SpvOp_ = 336;
pub const SpvOp__SpvOpGroupNonUniformBroadcast: SpvOp_ = 337;
pub const SpvOp__SpvOpGroupNonUniformBroadcastFirst: SpvOp_ = 338;
pub const SpvOp__SpvOpGroupNonUniformBallot: SpvOp_ = 339;
pub const SpvOp__SpvOpGroupNonUniformInverseBallot: SpvOp_ = 340;
pub const SpvOp__SpvOpGroupNonUniformBallotBitExtract: SpvOp_ = 341;
pub const SpvOp__SpvOpGroupNonUniformBallotBitCount: SpvOp_ = 342;
pub const SpvOp__SpvOpGroupNonUniformBallotFindLSB: SpvOp_ = 343;
pub const SpvOp__SpvOpGroupNonUniformBallotFindMSB: SpvOp_ = 344;
pub const SpvOp__SpvOpGroupNonUniformShuffle: SpvOp_ = 345;
pub const SpvOp__SpvOpGroupNonUniformShuffleXor: SpvOp_ = 346;
pub const SpvOp__SpvOpGroupNonUniformShuffleUp: SpvOp_ = 347;
pub const SpvOp__SpvOpGroupNonUniformShuffleDown: SpvOp_ = 348;
pub const SpvOp__SpvOpGroupNonUniformIAdd: SpvOp_ = 349;
pub const SpvOp__SpvOpGroupNonUniformFAdd: SpvOp_ = 350;
pub const SpvOp__SpvOpGroupNonUniformIMul: SpvOp_ = 351;
pub const SpvOp__SpvOpGroupNonUniformFMul: SpvOp_ = 352;
pub const SpvOp__SpvOpGroupNonUniformSMin: SpvOp_ = 353;
pub const SpvOp__SpvOpGroupNonUniformUMin: SpvOp_ = 354;
pub const SpvOp__SpvOpGroupNonUniformFMin: SpvOp_ = 355;
pub const SpvOp__SpvOpGroupNonUniformSMax: SpvOp_ = 356;
pub const SpvOp__SpvOpGroupNonUniformUMax: SpvOp_ = 357;
pub const SpvOp__SpvOpGroupNonUniformFMax: SpvOp_ = 358;
pub const SpvOp__SpvOpGroupNonUniformBitwiseAnd: SpvOp_ = 359;
pub const SpvOp__SpvOpGroupNonUniformBitwiseOr: SpvOp_ = 360;
pub const SpvOp__SpvOpGroupNonUniformBitwiseXor: SpvOp_ = 361;
pub const SpvOp__SpvOpGroupNonUniformLogicalAnd: SpvOp_ = 362;
pub const SpvOp__SpvOpGroupNonUniformLogicalOr: SpvOp_ = 363;
pub const SpvOp__SpvOpGroupNonUniformLogicalXor: SpvOp_ = 364;
pub const SpvOp__SpvOpGroupNonUniformQuadBroadcast: SpvOp_ = 365;
pub const SpvOp__SpvOpGroupNonUniformQuadSwap: SpvOp_ = 366;
pub const SpvOp__SpvOpCopyLogical: SpvOp_ = 400;
pub const SpvOp__SpvOpPtrEqual: SpvOp_ = 401;
pub const SpvOp__SpvOpPtrNotEqual: SpvOp_ = 402;
pub const SpvOp__SpvOpPtrDiff: SpvOp_ = 403;
pub const SpvOp__SpvOpColorAttachmentReadEXT: SpvOp_ = 4160;
pub const SpvOp__SpvOpDepthAttachmentReadEXT: SpvOp_ = 4161;
pub const SpvOp__SpvOpStencilAttachmentReadEXT: SpvOp_ = 4162;
pub const SpvOp__SpvOpTypeTensorARM: SpvOp_ = 4163;
pub const SpvOp__SpvOpTensorReadARM: SpvOp_ = 4164;
pub const SpvOp__SpvOpTensorWriteARM: SpvOp_ = 4165;
pub const SpvOp__SpvOpTensorQuerySizeARM: SpvOp_ = 4166;
pub const SpvOp__SpvOpGraphConstantARM: SpvOp_ = 4181;
pub const SpvOp__SpvOpGraphEntryPointARM: SpvOp_ = 4182;
pub const SpvOp__SpvOpGraphARM: SpvOp_ = 4183;
pub const SpvOp__SpvOpGraphInputARM: SpvOp_ = 4184;
pub const SpvOp__SpvOpGraphSetOutputARM: SpvOp_ = 4185;
pub const SpvOp__SpvOpGraphEndARM: SpvOp_ = 4186;
pub const SpvOp__SpvOpTypeGraphARM: SpvOp_ = 4190;
pub const SpvOp__SpvOpTerminateInvocation: SpvOp_ = 4416;
pub const SpvOp__SpvOpTypeUntypedPointerKHR: SpvOp_ = 4417;
pub const SpvOp__SpvOpUntypedVariableKHR: SpvOp_ = 4418;
pub const SpvOp__SpvOpUntypedAccessChainKHR: SpvOp_ = 4419;
pub const SpvOp__SpvOpUntypedInBoundsAccessChainKHR: SpvOp_ = 4420;
pub const SpvOp__SpvOpSubgroupBallotKHR: SpvOp_ = 4421;
pub const SpvOp__SpvOpSubgroupFirstInvocationKHR: SpvOp_ = 4422;
pub const SpvOp__SpvOpUntypedPtrAccessChainKHR: SpvOp_ = 4423;
pub const SpvOp__SpvOpUntypedInBoundsPtrAccessChainKHR: SpvOp_ = 4424;
pub const SpvOp__SpvOpUntypedArrayLengthKHR: SpvOp_ = 4425;
pub const SpvOp__SpvOpUntypedPrefetchKHR: SpvOp_ = 4426;
pub const SpvOp__SpvOpFmaKHR: SpvOp_ = 4427;
pub const SpvOp__SpvOpSubgroupAllKHR: SpvOp_ = 4428;
pub const SpvOp__SpvOpSubgroupAnyKHR: SpvOp_ = 4429;
pub const SpvOp__SpvOpSubgroupAllEqualKHR: SpvOp_ = 4430;
pub const SpvOp__SpvOpGroupNonUniformRotateKHR: SpvOp_ = 4431;
pub const SpvOp__SpvOpSubgroupReadInvocationKHR: SpvOp_ = 4432;
pub const SpvOp__SpvOpExtInstWithForwardRefsKHR: SpvOp_ = 4433;
pub const SpvOp__SpvOpUntypedGroupAsyncCopyKHR: SpvOp_ = 4434;
pub const SpvOp__SpvOpTraceRayKHR: SpvOp_ = 4445;
pub const SpvOp__SpvOpExecuteCallableKHR: SpvOp_ = 4446;
pub const SpvOp__SpvOpConvertUToAccelerationStructureKHR: SpvOp_ = 4447;
pub const SpvOp__SpvOpIgnoreIntersectionKHR: SpvOp_ = 4448;
pub const SpvOp__SpvOpTerminateRayKHR: SpvOp_ = 4449;
pub const SpvOp__SpvOpSDot: SpvOp_ = 4450;
pub const SpvOp__SpvOpSDotKHR: SpvOp_ = 4450;
pub const SpvOp__SpvOpUDot: SpvOp_ = 4451;
pub const SpvOp__SpvOpUDotKHR: SpvOp_ = 4451;
pub const SpvOp__SpvOpSUDot: SpvOp_ = 4452;
pub const SpvOp__SpvOpSUDotKHR: SpvOp_ = 4452;
pub const SpvOp__SpvOpSDotAccSat: SpvOp_ = 4453;
pub const SpvOp__SpvOpSDotAccSatKHR: SpvOp_ = 4453;
pub const SpvOp__SpvOpUDotAccSat: SpvOp_ = 4454;
pub const SpvOp__SpvOpUDotAccSatKHR: SpvOp_ = 4454;
pub const SpvOp__SpvOpSUDotAccSat: SpvOp_ = 4455;
pub const SpvOp__SpvOpSUDotAccSatKHR: SpvOp_ = 4455;
pub const SpvOp__SpvOpTypeCooperativeMatrixKHR: SpvOp_ = 4456;
pub const SpvOp__SpvOpCooperativeMatrixLoadKHR: SpvOp_ = 4457;
pub const SpvOp__SpvOpCooperativeMatrixStoreKHR: SpvOp_ = 4458;
pub const SpvOp__SpvOpCooperativeMatrixMulAddKHR: SpvOp_ = 4459;
pub const SpvOp__SpvOpCooperativeMatrixLengthKHR: SpvOp_ = 4460;
pub const SpvOp__SpvOpConstantCompositeReplicateEXT: SpvOp_ = 4461;
pub const SpvOp__SpvOpSpecConstantCompositeReplicateEXT: SpvOp_ = 4462;
pub const SpvOp__SpvOpCompositeConstructReplicateEXT: SpvOp_ = 4463;
pub const SpvOp__SpvOpTypeRayQueryKHR: SpvOp_ = 4472;
pub const SpvOp__SpvOpRayQueryInitializeKHR: SpvOp_ = 4473;
pub const SpvOp__SpvOpRayQueryTerminateKHR: SpvOp_ = 4474;
pub const SpvOp__SpvOpRayQueryGenerateIntersectionKHR: SpvOp_ = 4475;
pub const SpvOp__SpvOpRayQueryConfirmIntersectionKHR: SpvOp_ = 4476;
pub const SpvOp__SpvOpRayQueryProceedKHR: SpvOp_ = 4477;
pub const SpvOp__SpvOpRayQueryGetIntersectionTypeKHR: SpvOp_ = 4479;
pub const SpvOp__SpvOpImageSampleWeightedQCOM: SpvOp_ = 4480;
pub const SpvOp__SpvOpImageBoxFilterQCOM: SpvOp_ = 4481;
pub const SpvOp__SpvOpImageBlockMatchSSDQCOM: SpvOp_ = 4482;
pub const SpvOp__SpvOpImageBlockMatchSADQCOM: SpvOp_ = 4483;
pub const SpvOp__SpvOpBitCastArrayQCOM: SpvOp_ = 4497;
pub const SpvOp__SpvOpImageBlockMatchWindowSSDQCOM: SpvOp_ = 4500;
pub const SpvOp__SpvOpImageBlockMatchWindowSADQCOM: SpvOp_ = 4501;
pub const SpvOp__SpvOpImageBlockMatchGatherSSDQCOM: SpvOp_ = 4502;
pub const SpvOp__SpvOpImageBlockMatchGatherSADQCOM: SpvOp_ = 4503;
pub const SpvOp__SpvOpCompositeConstructCoopMatQCOM: SpvOp_ = 4540;
pub const SpvOp__SpvOpCompositeExtractCoopMatQCOM: SpvOp_ = 4541;
pub const SpvOp__SpvOpExtractSubArrayQCOM: SpvOp_ = 4542;
pub const SpvOp__SpvOpGroupIAddNonUniformAMD: SpvOp_ = 5000;
pub const SpvOp__SpvOpGroupFAddNonUniformAMD: SpvOp_ = 5001;
pub const SpvOp__SpvOpGroupFMinNonUniformAMD: SpvOp_ = 5002;
pub const SpvOp__SpvOpGroupUMinNonUniformAMD: SpvOp_ = 5003;
pub const SpvOp__SpvOpGroupSMinNonUniformAMD: SpvOp_ = 5004;
pub const SpvOp__SpvOpGroupFMaxNonUniformAMD: SpvOp_ = 5005;
pub const SpvOp__SpvOpGroupUMaxNonUniformAMD: SpvOp_ = 5006;
pub const SpvOp__SpvOpGroupSMaxNonUniformAMD: SpvOp_ = 5007;
pub const SpvOp__SpvOpFragmentMaskFetchAMD: SpvOp_ = 5011;
pub const SpvOp__SpvOpFragmentFetchAMD: SpvOp_ = 5012;
pub const SpvOp__SpvOpReadClockKHR: SpvOp_ = 5056;
pub const SpvOp__SpvOpAllocateNodePayloadsAMDX: SpvOp_ = 5074;
pub const SpvOp__SpvOpEnqueueNodePayloadsAMDX: SpvOp_ = 5075;
pub const SpvOp__SpvOpTypeNodePayloadArrayAMDX: SpvOp_ = 5076;
pub const SpvOp__SpvOpFinishWritingNodePayloadAMDX: SpvOp_ = 5078;
pub const SpvOp__SpvOpNodePayloadArrayLengthAMDX: SpvOp_ = 5090;
pub const SpvOp__SpvOpIsNodePayloadValidAMDX: SpvOp_ = 5101;
pub const SpvOp__SpvOpConstantStringAMDX: SpvOp_ = 5103;
pub const SpvOp__SpvOpSpecConstantStringAMDX: SpvOp_ = 5104;
pub const SpvOp__SpvOpGroupNonUniformQuadAllKHR: SpvOp_ = 5110;
pub const SpvOp__SpvOpGroupNonUniformQuadAnyKHR: SpvOp_ = 5111;
pub const SpvOp__SpvOpHitObjectRecordHitMotionNV: SpvOp_ = 5249;
pub const SpvOp__SpvOpHitObjectRecordHitWithIndexMotionNV: SpvOp_ = 5250;
pub const SpvOp__SpvOpHitObjectRecordMissMotionNV: SpvOp_ = 5251;
pub const SpvOp__SpvOpHitObjectGetWorldToObjectNV: SpvOp_ = 5252;
pub const SpvOp__SpvOpHitObjectGetObjectToWorldNV: SpvOp_ = 5253;
pub const SpvOp__SpvOpHitObjectGetObjectRayDirectionNV: SpvOp_ = 5254;
pub const SpvOp__SpvOpHitObjectGetObjectRayOriginNV: SpvOp_ = 5255;
pub const SpvOp__SpvOpHitObjectTraceRayMotionNV: SpvOp_ = 5256;
pub const SpvOp__SpvOpHitObjectGetShaderRecordBufferHandleNV: SpvOp_ = 5257;
pub const SpvOp__SpvOpHitObjectGetShaderBindingTableRecordIndexNV: SpvOp_ = 5258;
pub const SpvOp__SpvOpHitObjectRecordEmptyNV: SpvOp_ = 5259;
pub const SpvOp__SpvOpHitObjectTraceRayNV: SpvOp_ = 5260;
pub const SpvOp__SpvOpHitObjectRecordHitNV: SpvOp_ = 5261;
pub const SpvOp__SpvOpHitObjectRecordHitWithIndexNV: SpvOp_ = 5262;
pub const SpvOp__SpvOpHitObjectRecordMissNV: SpvOp_ = 5263;
pub const SpvOp__SpvOpHitObjectExecuteShaderNV: SpvOp_ = 5264;
pub const SpvOp__SpvOpHitObjectGetCurrentTimeNV: SpvOp_ = 5265;
pub const SpvOp__SpvOpHitObjectGetAttributesNV: SpvOp_ = 5266;
pub const SpvOp__SpvOpHitObjectGetHitKindNV: SpvOp_ = 5267;
pub const SpvOp__SpvOpHitObjectGetPrimitiveIndexNV: SpvOp_ = 5268;
pub const SpvOp__SpvOpHitObjectGetGeometryIndexNV: SpvOp_ = 5269;
pub const SpvOp__SpvOpHitObjectGetInstanceIdNV: SpvOp_ = 5270;
pub const SpvOp__SpvOpHitObjectGetInstanceCustomIndexNV: SpvOp_ = 5271;
pub const SpvOp__SpvOpHitObjectGetWorldRayDirectionNV: SpvOp_ = 5272;
pub const SpvOp__SpvOpHitObjectGetWorldRayOriginNV: SpvOp_ = 5273;
pub const SpvOp__SpvOpHitObjectGetRayTMaxNV: SpvOp_ = 5274;
pub const SpvOp__SpvOpHitObjectGetRayTMinNV: SpvOp_ = 5275;
pub const SpvOp__SpvOpHitObjectIsEmptyNV: SpvOp_ = 5276;
pub const SpvOp__SpvOpHitObjectIsHitNV: SpvOp_ = 5277;
pub const SpvOp__SpvOpHitObjectIsMissNV: SpvOp_ = 5278;
pub const SpvOp__SpvOpReorderThreadWithHitObjectNV: SpvOp_ = 5279;
pub const SpvOp__SpvOpReorderThreadWithHintNV: SpvOp_ = 5280;
pub const SpvOp__SpvOpTypeHitObjectNV: SpvOp_ = 5281;
pub const SpvOp__SpvOpImageSampleFootprintNV: SpvOp_ = 5283;
pub const SpvOp__SpvOpTypeCooperativeVectorNV: SpvOp_ = 5288;
pub const SpvOp__SpvOpCooperativeVectorMatrixMulNV: SpvOp_ = 5289;
pub const SpvOp__SpvOpCooperativeVectorOuterProductAccumulateNV: SpvOp_ = 5290;
pub const SpvOp__SpvOpCooperativeVectorReduceSumAccumulateNV: SpvOp_ = 5291;
pub const SpvOp__SpvOpCooperativeVectorMatrixMulAddNV: SpvOp_ = 5292;
pub const SpvOp__SpvOpCooperativeMatrixConvertNV: SpvOp_ = 5293;
pub const SpvOp__SpvOpEmitMeshTasksEXT: SpvOp_ = 5294;
pub const SpvOp__SpvOpSetMeshOutputsEXT: SpvOp_ = 5295;
pub const SpvOp__SpvOpGroupNonUniformPartitionNV: SpvOp_ = 5296;
pub const SpvOp__SpvOpWritePackedPrimitiveIndices4x8NV: SpvOp_ = 5299;
pub const SpvOp__SpvOpFetchMicroTriangleVertexPositionNV: SpvOp_ = 5300;
pub const SpvOp__SpvOpFetchMicroTriangleVertexBarycentricNV: SpvOp_ = 5301;
pub const SpvOp__SpvOpCooperativeVectorLoadNV: SpvOp_ = 5302;
pub const SpvOp__SpvOpCooperativeVectorStoreNV: SpvOp_ = 5303;
pub const SpvOp__SpvOpReportIntersectionKHR: SpvOp_ = 5334;
pub const SpvOp__SpvOpReportIntersectionNV: SpvOp_ = 5334;
pub const SpvOp__SpvOpIgnoreIntersectionNV: SpvOp_ = 5335;
pub const SpvOp__SpvOpTerminateRayNV: SpvOp_ = 5336;
pub const SpvOp__SpvOpTraceNV: SpvOp_ = 5337;
pub const SpvOp__SpvOpTraceMotionNV: SpvOp_ = 5338;
pub const SpvOp__SpvOpTraceRayMotionNV: SpvOp_ = 5339;
pub const SpvOp__SpvOpRayQueryGetIntersectionTriangleVertexPositionsKHR: SpvOp_ = 5340;
pub const SpvOp__SpvOpTypeAccelerationStructureKHR: SpvOp_ = 5341;
pub const SpvOp__SpvOpTypeAccelerationStructureNV: SpvOp_ = 5341;
pub const SpvOp__SpvOpExecuteCallableNV: SpvOp_ = 5344;
pub const SpvOp__SpvOpRayQueryGetClusterIdNV: SpvOp_ = 5345;
pub const SpvOp__SpvOpRayQueryGetIntersectionClusterIdNV: SpvOp_ = 5345;
pub const SpvOp__SpvOpHitObjectGetClusterIdNV: SpvOp_ = 5346;
pub const SpvOp__SpvOpTypeCooperativeMatrixNV: SpvOp_ = 5358;
pub const SpvOp__SpvOpCooperativeMatrixLoadNV: SpvOp_ = 5359;
pub const SpvOp__SpvOpCooperativeMatrixStoreNV: SpvOp_ = 5360;
pub const SpvOp__SpvOpCooperativeMatrixMulAddNV: SpvOp_ = 5361;
pub const SpvOp__SpvOpCooperativeMatrixLengthNV: SpvOp_ = 5362;
pub const SpvOp__SpvOpBeginInvocationInterlockEXT: SpvOp_ = 5364;
pub const SpvOp__SpvOpEndInvocationInterlockEXT: SpvOp_ = 5365;
pub const SpvOp__SpvOpCooperativeMatrixReduceNV: SpvOp_ = 5366;
pub const SpvOp__SpvOpCooperativeMatrixLoadTensorNV: SpvOp_ = 5367;
pub const SpvOp__SpvOpCooperativeMatrixStoreTensorNV: SpvOp_ = 5368;
pub const SpvOp__SpvOpCooperativeMatrixPerElementOpNV: SpvOp_ = 5369;
pub const SpvOp__SpvOpTypeTensorLayoutNV: SpvOp_ = 5370;
pub const SpvOp__SpvOpTypeTensorViewNV: SpvOp_ = 5371;
pub const SpvOp__SpvOpCreateTensorLayoutNV: SpvOp_ = 5372;
pub const SpvOp__SpvOpTensorLayoutSetDimensionNV: SpvOp_ = 5373;
pub const SpvOp__SpvOpTensorLayoutSetStrideNV: SpvOp_ = 5374;
pub const SpvOp__SpvOpTensorLayoutSliceNV: SpvOp_ = 5375;
pub const SpvOp__SpvOpTensorLayoutSetClampValueNV: SpvOp_ = 5376;
pub const SpvOp__SpvOpCreateTensorViewNV: SpvOp_ = 5377;
pub const SpvOp__SpvOpTensorViewSetDimensionNV: SpvOp_ = 5378;
pub const SpvOp__SpvOpTensorViewSetStrideNV: SpvOp_ = 5379;
pub const SpvOp__SpvOpDemoteToHelperInvocation: SpvOp_ = 5380;
pub const SpvOp__SpvOpDemoteToHelperInvocationEXT: SpvOp_ = 5380;
pub const SpvOp__SpvOpIsHelperInvocationEXT: SpvOp_ = 5381;
pub const SpvOp__SpvOpTensorViewSetClipNV: SpvOp_ = 5382;
pub const SpvOp__SpvOpTensorLayoutSetBlockSizeNV: SpvOp_ = 5384;
pub const SpvOp__SpvOpCooperativeMatrixTransposeNV: SpvOp_ = 5390;
pub const SpvOp__SpvOpConvertUToImageNV: SpvOp_ = 5391;
pub const SpvOp__SpvOpConvertUToSamplerNV: SpvOp_ = 5392;
pub const SpvOp__SpvOpConvertImageToUNV: SpvOp_ = 5393;
pub const SpvOp__SpvOpConvertSamplerToUNV: SpvOp_ = 5394;
pub const SpvOp__SpvOpConvertUToSampledImageNV: SpvOp_ = 5395;
pub const SpvOp__SpvOpConvertSampledImageToUNV: SpvOp_ = 5396;
pub const SpvOp__SpvOpSamplerImageAddressingModeNV: SpvOp_ = 5397;
pub const SpvOp__SpvOpRawAccessChainNV: SpvOp_ = 5398;
pub const SpvOp__SpvOpRayQueryGetIntersectionSpherePositionNV: SpvOp_ = 5427;
pub const SpvOp__SpvOpRayQueryGetIntersectionSphereRadiusNV: SpvOp_ = 5428;
pub const SpvOp__SpvOpRayQueryGetIntersectionLSSPositionsNV: SpvOp_ = 5429;
pub const SpvOp__SpvOpRayQueryGetIntersectionLSSRadiiNV: SpvOp_ = 5430;
pub const SpvOp__SpvOpRayQueryGetIntersectionLSSHitValueNV: SpvOp_ = 5431;
pub const SpvOp__SpvOpHitObjectGetSpherePositionNV: SpvOp_ = 5432;
pub const SpvOp__SpvOpHitObjectGetSphereRadiusNV: SpvOp_ = 5433;
pub const SpvOp__SpvOpHitObjectGetLSSPositionsNV: SpvOp_ = 5434;
pub const SpvOp__SpvOpHitObjectGetLSSRadiiNV: SpvOp_ = 5435;
pub const SpvOp__SpvOpHitObjectIsSphereHitNV: SpvOp_ = 5436;
pub const SpvOp__SpvOpHitObjectIsLSSHitNV: SpvOp_ = 5437;
pub const SpvOp__SpvOpRayQueryIsSphereHitNV: SpvOp_ = 5438;
pub const SpvOp__SpvOpRayQueryIsLSSHitNV: SpvOp_ = 5439;
pub const SpvOp__SpvOpSubgroupShuffleINTEL: SpvOp_ = 5571;
pub const SpvOp__SpvOpSubgroupShuffleDownINTEL: SpvOp_ = 5572;
pub const SpvOp__SpvOpSubgroupShuffleUpINTEL: SpvOp_ = 5573;
pub const SpvOp__SpvOpSubgroupShuffleXorINTEL: SpvOp_ = 5574;
pub const SpvOp__SpvOpSubgroupBlockReadINTEL: SpvOp_ = 5575;
pub const SpvOp__SpvOpSubgroupBlockWriteINTEL: SpvOp_ = 5576;
pub const SpvOp__SpvOpSubgroupImageBlockReadINTEL: SpvOp_ = 5577;
pub const SpvOp__SpvOpSubgroupImageBlockWriteINTEL: SpvOp_ = 5578;
pub const SpvOp__SpvOpSubgroupImageMediaBlockReadINTEL: SpvOp_ = 5580;
pub const SpvOp__SpvOpSubgroupImageMediaBlockWriteINTEL: SpvOp_ = 5581;
pub const SpvOp__SpvOpUCountLeadingZerosINTEL: SpvOp_ = 5585;
pub const SpvOp__SpvOpUCountTrailingZerosINTEL: SpvOp_ = 5586;
pub const SpvOp__SpvOpAbsISubINTEL: SpvOp_ = 5587;
pub const SpvOp__SpvOpAbsUSubINTEL: SpvOp_ = 5588;
pub const SpvOp__SpvOpIAddSatINTEL: SpvOp_ = 5589;
pub const SpvOp__SpvOpUAddSatINTEL: SpvOp_ = 5590;
pub const SpvOp__SpvOpIAverageINTEL: SpvOp_ = 5591;
pub const SpvOp__SpvOpUAverageINTEL: SpvOp_ = 5592;
pub const SpvOp__SpvOpIAverageRoundedINTEL: SpvOp_ = 5593;
pub const SpvOp__SpvOpUAverageRoundedINTEL: SpvOp_ = 5594;
pub const SpvOp__SpvOpISubSatINTEL: SpvOp_ = 5595;
pub const SpvOp__SpvOpUSubSatINTEL: SpvOp_ = 5596;
pub const SpvOp__SpvOpIMul32x16INTEL: SpvOp_ = 5597;
pub const SpvOp__SpvOpUMul32x16INTEL: SpvOp_ = 5598;
pub const SpvOp__SpvOpConstantFunctionPointerINTEL: SpvOp_ = 5600;
pub const SpvOp__SpvOpFunctionPointerCallINTEL: SpvOp_ = 5601;
pub const SpvOp__SpvOpAsmTargetINTEL: SpvOp_ = 5609;
pub const SpvOp__SpvOpAsmINTEL: SpvOp_ = 5610;
pub const SpvOp__SpvOpAsmCallINTEL: SpvOp_ = 5611;
pub const SpvOp__SpvOpAtomicFMinEXT: SpvOp_ = 5614;
pub const SpvOp__SpvOpAtomicFMaxEXT: SpvOp_ = 5615;
pub const SpvOp__SpvOpAssumeTrueKHR: SpvOp_ = 5630;
pub const SpvOp__SpvOpExpectKHR: SpvOp_ = 5631;
pub const SpvOp__SpvOpDecorateString: SpvOp_ = 5632;
pub const SpvOp__SpvOpDecorateStringGOOGLE: SpvOp_ = 5632;
pub const SpvOp__SpvOpMemberDecorateString: SpvOp_ = 5633;
pub const SpvOp__SpvOpMemberDecorateStringGOOGLE: SpvOp_ = 5633;
pub const SpvOp__SpvOpVmeImageINTEL: SpvOp_ = 5699;
pub const SpvOp__SpvOpTypeVmeImageINTEL: SpvOp_ = 5700;
pub const SpvOp__SpvOpTypeAvcImePayloadINTEL: SpvOp_ = 5701;
pub const SpvOp__SpvOpTypeAvcRefPayloadINTEL: SpvOp_ = 5702;
pub const SpvOp__SpvOpTypeAvcSicPayloadINTEL: SpvOp_ = 5703;
pub const SpvOp__SpvOpTypeAvcMcePayloadINTEL: SpvOp_ = 5704;
pub const SpvOp__SpvOpTypeAvcMceResultINTEL: SpvOp_ = 5705;
pub const SpvOp__SpvOpTypeAvcImeResultINTEL: SpvOp_ = 5706;
pub const SpvOp__SpvOpTypeAvcImeResultSingleReferenceStreamoutINTEL: SpvOp_ = 5707;
pub const SpvOp__SpvOpTypeAvcImeResultDualReferenceStreamoutINTEL: SpvOp_ = 5708;
pub const SpvOp__SpvOpTypeAvcImeSingleReferenceStreaminINTEL: SpvOp_ = 5709;
pub const SpvOp__SpvOpTypeAvcImeDualReferenceStreaminINTEL: SpvOp_ = 5710;
pub const SpvOp__SpvOpTypeAvcRefResultINTEL: SpvOp_ = 5711;
pub const SpvOp__SpvOpTypeAvcSicResultINTEL: SpvOp_ = 5712;
pub const SpvOp__SpvOpSubgroupAvcMceGetDefaultInterBaseMultiReferencePenaltyINTEL: SpvOp_ = 5713;
pub const SpvOp__SpvOpSubgroupAvcMceSetInterBaseMultiReferencePenaltyINTEL: SpvOp_ = 5714;
pub const SpvOp__SpvOpSubgroupAvcMceGetDefaultInterShapePenaltyINTEL: SpvOp_ = 5715;
pub const SpvOp__SpvOpSubgroupAvcMceSetInterShapePenaltyINTEL: SpvOp_ = 5716;
pub const SpvOp__SpvOpSubgroupAvcMceGetDefaultInterDirectionPenaltyINTEL: SpvOp_ = 5717;
pub const SpvOp__SpvOpSubgroupAvcMceSetInterDirectionPenaltyINTEL: SpvOp_ = 5718;
pub const SpvOp__SpvOpSubgroupAvcMceGetDefaultIntraLumaShapePenaltyINTEL: SpvOp_ = 5719;
pub const SpvOp__SpvOpSubgroupAvcMceGetDefaultInterMotionVectorCostTableINTEL: SpvOp_ = 5720;
pub const SpvOp__SpvOpSubgroupAvcMceGetDefaultHighPenaltyCostTableINTEL: SpvOp_ = 5721;
pub const SpvOp__SpvOpSubgroupAvcMceGetDefaultMediumPenaltyCostTableINTEL: SpvOp_ = 5722;
pub const SpvOp__SpvOpSubgroupAvcMceGetDefaultLowPenaltyCostTableINTEL: SpvOp_ = 5723;
pub const SpvOp__SpvOpSubgroupAvcMceSetMotionVectorCostFunctionINTEL: SpvOp_ = 5724;
pub const SpvOp__SpvOpSubgroupAvcMceGetDefaultIntraLumaModePenaltyINTEL: SpvOp_ = 5725;
pub const SpvOp__SpvOpSubgroupAvcMceGetDefaultNonDcLumaIntraPenaltyINTEL: SpvOp_ = 5726;
pub const SpvOp__SpvOpSubgroupAvcMceGetDefaultIntraChromaModeBasePenaltyINTEL: SpvOp_ = 5727;
pub const SpvOp__SpvOpSubgroupAvcMceSetAcOnlyHaarINTEL: SpvOp_ = 5728;
pub const SpvOp__SpvOpSubgroupAvcMceSetSourceInterlacedFieldPolarityINTEL: SpvOp_ = 5729;
pub const SpvOp__SpvOpSubgroupAvcMceSetSingleReferenceInterlacedFieldPolarityINTEL: SpvOp_ = 5730;
pub const SpvOp__SpvOpSubgroupAvcMceSetDualReferenceInterlacedFieldPolaritiesINTEL: SpvOp_ = 5731;
pub const SpvOp__SpvOpSubgroupAvcMceConvertToImePayloadINTEL: SpvOp_ = 5732;
pub const SpvOp__SpvOpSubgroupAvcMceConvertToImeResultINTEL: SpvOp_ = 5733;
pub const SpvOp__SpvOpSubgroupAvcMceConvertToRefPayloadINTEL: SpvOp_ = 5734;
pub const SpvOp__SpvOpSubgroupAvcMceConvertToRefResultINTEL: SpvOp_ = 5735;
pub const SpvOp__SpvOpSubgroupAvcMceConvertToSicPayloadINTEL: SpvOp_ = 5736;
pub const SpvOp__SpvOpSubgroupAvcMceConvertToSicResultINTEL: SpvOp_ = 5737;
pub const SpvOp__SpvOpSubgroupAvcMceGetMotionVectorsINTEL: SpvOp_ = 5738;
pub const SpvOp__SpvOpSubgroupAvcMceGetInterDistortionsINTEL: SpvOp_ = 5739;
pub const SpvOp__SpvOpSubgroupAvcMceGetBestInterDistortionsINTEL: SpvOp_ = 5740;
pub const SpvOp__SpvOpSubgroupAvcMceGetInterMajorShapeINTEL: SpvOp_ = 5741;
pub const SpvOp__SpvOpSubgroupAvcMceGetInterMinorShapeINTEL: SpvOp_ = 5742;
pub const SpvOp__SpvOpSubgroupAvcMceGetInterDirectionsINTEL: SpvOp_ = 5743;
pub const SpvOp__SpvOpSubgroupAvcMceGetInterMotionVectorCountINTEL: SpvOp_ = 5744;
pub const SpvOp__SpvOpSubgroupAvcMceGetInterReferenceIdsINTEL: SpvOp_ = 5745;
pub const SpvOp__SpvOpSubgroupAvcMceGetInterReferenceInterlacedFieldPolaritiesINTEL: SpvOp_ = 5746;
pub const SpvOp__SpvOpSubgroupAvcImeInitializeINTEL: SpvOp_ = 5747;
pub const SpvOp__SpvOpSubgroupAvcImeSetSingleReferenceINTEL: SpvOp_ = 5748;
pub const SpvOp__SpvOpSubgroupAvcImeSetDualReferenceINTEL: SpvOp_ = 5749;
pub const SpvOp__SpvOpSubgroupAvcImeRefWindowSizeINTEL: SpvOp_ = 5750;
pub const SpvOp__SpvOpSubgroupAvcImeAdjustRefOffsetINTEL: SpvOp_ = 5751;
pub const SpvOp__SpvOpSubgroupAvcImeConvertToMcePayloadINTEL: SpvOp_ = 5752;
pub const SpvOp__SpvOpSubgroupAvcImeSetMaxMotionVectorCountINTEL: SpvOp_ = 5753;
pub const SpvOp__SpvOpSubgroupAvcImeSetUnidirectionalMixDisableINTEL: SpvOp_ = 5754;
pub const SpvOp__SpvOpSubgroupAvcImeSetEarlySearchTerminationThresholdINTEL: SpvOp_ = 5755;
pub const SpvOp__SpvOpSubgroupAvcImeSetWeightedSadINTEL: SpvOp_ = 5756;
pub const SpvOp__SpvOpSubgroupAvcImeEvaluateWithSingleReferenceINTEL: SpvOp_ = 5757;
pub const SpvOp__SpvOpSubgroupAvcImeEvaluateWithDualReferenceINTEL: SpvOp_ = 5758;
pub const SpvOp__SpvOpSubgroupAvcImeEvaluateWithSingleReferenceStreaminINTEL: SpvOp_ = 5759;
pub const SpvOp__SpvOpSubgroupAvcImeEvaluateWithDualReferenceStreaminINTEL: SpvOp_ = 5760;
pub const SpvOp__SpvOpSubgroupAvcImeEvaluateWithSingleReferenceStreamoutINTEL: SpvOp_ = 5761;
pub const SpvOp__SpvOpSubgroupAvcImeEvaluateWithDualReferenceStreamoutINTEL: SpvOp_ = 5762;
pub const SpvOp__SpvOpSubgroupAvcImeEvaluateWithSingleReferenceStreaminoutINTEL: SpvOp_ = 5763;
pub const SpvOp__SpvOpSubgroupAvcImeEvaluateWithDualReferenceStreaminoutINTEL: SpvOp_ = 5764;
pub const SpvOp__SpvOpSubgroupAvcImeConvertToMceResultINTEL: SpvOp_ = 5765;
pub const SpvOp__SpvOpSubgroupAvcImeGetSingleReferenceStreaminINTEL: SpvOp_ = 5766;
pub const SpvOp__SpvOpSubgroupAvcImeGetDualReferenceStreaminINTEL: SpvOp_ = 5767;
pub const SpvOp__SpvOpSubgroupAvcImeStripSingleReferenceStreamoutINTEL: SpvOp_ = 5768;
pub const SpvOp__SpvOpSubgroupAvcImeStripDualReferenceStreamoutINTEL: SpvOp_ = 5769;
pub const SpvOp__SpvOpSubgroupAvcImeGetStreamoutSingleReferenceMajorShapeMotionVectorsINTEL:
    SpvOp_ = 5770;
pub const SpvOp__SpvOpSubgroupAvcImeGetStreamoutSingleReferenceMajorShapeDistortionsINTEL: SpvOp_ =
    5771;
pub const SpvOp__SpvOpSubgroupAvcImeGetStreamoutSingleReferenceMajorShapeReferenceIdsINTEL: SpvOp_ =
    5772;
pub const SpvOp__SpvOpSubgroupAvcImeGetStreamoutDualReferenceMajorShapeMotionVectorsINTEL: SpvOp_ =
    5773;
pub const SpvOp__SpvOpSubgroupAvcImeGetStreamoutDualReferenceMajorShapeDistortionsINTEL: SpvOp_ =
    5774;
pub const SpvOp__SpvOpSubgroupAvcImeGetStreamoutDualReferenceMajorShapeReferenceIdsINTEL: SpvOp_ =
    5775;
pub const SpvOp__SpvOpSubgroupAvcImeGetBorderReachedINTEL: SpvOp_ = 5776;
pub const SpvOp__SpvOpSubgroupAvcImeGetTruncatedSearchIndicationINTEL: SpvOp_ = 5777;
pub const SpvOp__SpvOpSubgroupAvcImeGetUnidirectionalEarlySearchTerminationINTEL: SpvOp_ = 5778;
pub const SpvOp__SpvOpSubgroupAvcImeGetWeightingPatternMinimumMotionVectorINTEL: SpvOp_ = 5779;
pub const SpvOp__SpvOpSubgroupAvcImeGetWeightingPatternMinimumDistortionINTEL: SpvOp_ = 5780;
pub const SpvOp__SpvOpSubgroupAvcFmeInitializeINTEL: SpvOp_ = 5781;
pub const SpvOp__SpvOpSubgroupAvcBmeInitializeINTEL: SpvOp_ = 5782;
pub const SpvOp__SpvOpSubgroupAvcRefConvertToMcePayloadINTEL: SpvOp_ = 5783;
pub const SpvOp__SpvOpSubgroupAvcRefSetBidirectionalMixDisableINTEL: SpvOp_ = 5784;
pub const SpvOp__SpvOpSubgroupAvcRefSetBilinearFilterEnableINTEL: SpvOp_ = 5785;
pub const SpvOp__SpvOpSubgroupAvcRefEvaluateWithSingleReferenceINTEL: SpvOp_ = 5786;
pub const SpvOp__SpvOpSubgroupAvcRefEvaluateWithDualReferenceINTEL: SpvOp_ = 5787;
pub const SpvOp__SpvOpSubgroupAvcRefEvaluateWithMultiReferenceINTEL: SpvOp_ = 5788;
pub const SpvOp__SpvOpSubgroupAvcRefEvaluateWithMultiReferenceInterlacedINTEL: SpvOp_ = 5789;
pub const SpvOp__SpvOpSubgroupAvcRefConvertToMceResultINTEL: SpvOp_ = 5790;
pub const SpvOp__SpvOpSubgroupAvcSicInitializeINTEL: SpvOp_ = 5791;
pub const SpvOp__SpvOpSubgroupAvcSicConfigureSkcINTEL: SpvOp_ = 5792;
pub const SpvOp__SpvOpSubgroupAvcSicConfigureIpeLumaINTEL: SpvOp_ = 5793;
pub const SpvOp__SpvOpSubgroupAvcSicConfigureIpeLumaChromaINTEL: SpvOp_ = 5794;
pub const SpvOp__SpvOpSubgroupAvcSicGetMotionVectorMaskINTEL: SpvOp_ = 5795;
pub const SpvOp__SpvOpSubgroupAvcSicConvertToMcePayloadINTEL: SpvOp_ = 5796;
pub const SpvOp__SpvOpSubgroupAvcSicSetIntraLumaShapePenaltyINTEL: SpvOp_ = 5797;
pub const SpvOp__SpvOpSubgroupAvcSicSetIntraLumaModeCostFunctionINTEL: SpvOp_ = 5798;
pub const SpvOp__SpvOpSubgroupAvcSicSetIntraChromaModeCostFunctionINTEL: SpvOp_ = 5799;
pub const SpvOp__SpvOpSubgroupAvcSicSetBilinearFilterEnableINTEL: SpvOp_ = 5800;
pub const SpvOp__SpvOpSubgroupAvcSicSetSkcForwardTransformEnableINTEL: SpvOp_ = 5801;
pub const SpvOp__SpvOpSubgroupAvcSicSetBlockBasedRawSkipSadINTEL: SpvOp_ = 5802;
pub const SpvOp__SpvOpSubgroupAvcSicEvaluateIpeINTEL: SpvOp_ = 5803;
pub const SpvOp__SpvOpSubgroupAvcSicEvaluateWithSingleReferenceINTEL: SpvOp_ = 5804;
pub const SpvOp__SpvOpSubgroupAvcSicEvaluateWithDualReferenceINTEL: SpvOp_ = 5805;
pub const SpvOp__SpvOpSubgroupAvcSicEvaluateWithMultiReferenceINTEL: SpvOp_ = 5806;
pub const SpvOp__SpvOpSubgroupAvcSicEvaluateWithMultiReferenceInterlacedINTEL: SpvOp_ = 5807;
pub const SpvOp__SpvOpSubgroupAvcSicConvertToMceResultINTEL: SpvOp_ = 5808;
pub const SpvOp__SpvOpSubgroupAvcSicGetIpeLumaShapeINTEL: SpvOp_ = 5809;
pub const SpvOp__SpvOpSubgroupAvcSicGetBestIpeLumaDistortionINTEL: SpvOp_ = 5810;
pub const SpvOp__SpvOpSubgroupAvcSicGetBestIpeChromaDistortionINTEL: SpvOp_ = 5811;
pub const SpvOp__SpvOpSubgroupAvcSicGetPackedIpeLumaModesINTEL: SpvOp_ = 5812;
pub const SpvOp__SpvOpSubgroupAvcSicGetIpeChromaModeINTEL: SpvOp_ = 5813;
pub const SpvOp__SpvOpSubgroupAvcSicGetPackedSkcLumaCountThresholdINTEL: SpvOp_ = 5814;
pub const SpvOp__SpvOpSubgroupAvcSicGetPackedSkcLumaSumThresholdINTEL: SpvOp_ = 5815;
pub const SpvOp__SpvOpSubgroupAvcSicGetInterRawSadsINTEL: SpvOp_ = 5816;
pub const SpvOp__SpvOpVariableLengthArrayINTEL: SpvOp_ = 5818;
pub const SpvOp__SpvOpSaveMemoryINTEL: SpvOp_ = 5819;
pub const SpvOp__SpvOpRestoreMemoryINTEL: SpvOp_ = 5820;
pub const SpvOp__SpvOpArbitraryFloatSinCosPiINTEL: SpvOp_ = 5840;
pub const SpvOp__SpvOpArbitraryFloatCastINTEL: SpvOp_ = 5841;
pub const SpvOp__SpvOpArbitraryFloatCastFromIntINTEL: SpvOp_ = 5842;
pub const SpvOp__SpvOpArbitraryFloatCastToIntINTEL: SpvOp_ = 5843;
pub const SpvOp__SpvOpArbitraryFloatAddINTEL: SpvOp_ = 5846;
pub const SpvOp__SpvOpArbitraryFloatSubINTEL: SpvOp_ = 5847;
pub const SpvOp__SpvOpArbitraryFloatMulINTEL: SpvOp_ = 5848;
pub const SpvOp__SpvOpArbitraryFloatDivINTEL: SpvOp_ = 5849;
pub const SpvOp__SpvOpArbitraryFloatGTINTEL: SpvOp_ = 5850;
pub const SpvOp__SpvOpArbitraryFloatGEINTEL: SpvOp_ = 5851;
pub const SpvOp__SpvOpArbitraryFloatLTINTEL: SpvOp_ = 5852;
pub const SpvOp__SpvOpArbitraryFloatLEINTEL: SpvOp_ = 5853;
pub const SpvOp__SpvOpArbitraryFloatEQINTEL: SpvOp_ = 5854;
pub const SpvOp__SpvOpArbitraryFloatRecipINTEL: SpvOp_ = 5855;
pub const SpvOp__SpvOpArbitraryFloatRSqrtINTEL: SpvOp_ = 5856;
pub const SpvOp__SpvOpArbitraryFloatCbrtINTEL: SpvOp_ = 5857;
pub const SpvOp__SpvOpArbitraryFloatHypotINTEL: SpvOp_ = 5858;
pub const SpvOp__SpvOpArbitraryFloatSqrtINTEL: SpvOp_ = 5859;
pub const SpvOp__SpvOpArbitraryFloatLogINTEL: SpvOp_ = 5860;
pub const SpvOp__SpvOpArbitraryFloatLog2INTEL: SpvOp_ = 5861;
pub const SpvOp__SpvOpArbitraryFloatLog10INTEL: SpvOp_ = 5862;
pub const SpvOp__SpvOpArbitraryFloatLog1pINTEL: SpvOp_ = 5863;
pub const SpvOp__SpvOpArbitraryFloatExpINTEL: SpvOp_ = 5864;
pub const SpvOp__SpvOpArbitraryFloatExp2INTEL: SpvOp_ = 5865;
pub const SpvOp__SpvOpArbitraryFloatExp10INTEL: SpvOp_ = 5866;
pub const SpvOp__SpvOpArbitraryFloatExpm1INTEL: SpvOp_ = 5867;
pub const SpvOp__SpvOpArbitraryFloatSinINTEL: SpvOp_ = 5868;
pub const SpvOp__SpvOpArbitraryFloatCosINTEL: SpvOp_ = 5869;
pub const SpvOp__SpvOpArbitraryFloatSinCosINTEL: SpvOp_ = 5870;
pub const SpvOp__SpvOpArbitraryFloatSinPiINTEL: SpvOp_ = 5871;
pub const SpvOp__SpvOpArbitraryFloatCosPiINTEL: SpvOp_ = 5872;
pub const SpvOp__SpvOpArbitraryFloatASinINTEL: SpvOp_ = 5873;
pub const SpvOp__SpvOpArbitraryFloatASinPiINTEL: SpvOp_ = 5874;
pub const SpvOp__SpvOpArbitraryFloatACosINTEL: SpvOp_ = 5875;
pub const SpvOp__SpvOpArbitraryFloatACosPiINTEL: SpvOp_ = 5876;
pub const SpvOp__SpvOpArbitraryFloatATanINTEL: SpvOp_ = 5877;
pub const SpvOp__SpvOpArbitraryFloatATanPiINTEL: SpvOp_ = 5878;
pub const SpvOp__SpvOpArbitraryFloatATan2INTEL: SpvOp_ = 5879;
pub const SpvOp__SpvOpArbitraryFloatPowINTEL: SpvOp_ = 5880;
pub const SpvOp__SpvOpArbitraryFloatPowRINTEL: SpvOp_ = 5881;
pub const SpvOp__SpvOpArbitraryFloatPowNINTEL: SpvOp_ = 5882;
pub const SpvOp__SpvOpLoopControlINTEL: SpvOp_ = 5887;
pub const SpvOp__SpvOpAliasDomainDeclINTEL: SpvOp_ = 5911;
pub const SpvOp__SpvOpAliasScopeDeclINTEL: SpvOp_ = 5912;
pub const SpvOp__SpvOpAliasScopeListDeclINTEL: SpvOp_ = 5913;
pub const SpvOp__SpvOpFixedSqrtINTEL: SpvOp_ = 5923;
pub const SpvOp__SpvOpFixedRecipINTEL: SpvOp_ = 5924;
pub const SpvOp__SpvOpFixedRsqrtINTEL: SpvOp_ = 5925;
pub const SpvOp__SpvOpFixedSinINTEL: SpvOp_ = 5926;
pub const SpvOp__SpvOpFixedCosINTEL: SpvOp_ = 5927;
pub const SpvOp__SpvOpFixedSinCosINTEL: SpvOp_ = 5928;
pub const SpvOp__SpvOpFixedSinPiINTEL: SpvOp_ = 5929;
pub const SpvOp__SpvOpFixedCosPiINTEL: SpvOp_ = 5930;
pub const SpvOp__SpvOpFixedSinCosPiINTEL: SpvOp_ = 5931;
pub const SpvOp__SpvOpFixedLogINTEL: SpvOp_ = 5932;
pub const SpvOp__SpvOpFixedExpINTEL: SpvOp_ = 5933;
pub const SpvOp__SpvOpPtrCastToCrossWorkgroupINTEL: SpvOp_ = 5934;
pub const SpvOp__SpvOpCrossWorkgroupCastToPtrINTEL: SpvOp_ = 5938;
pub const SpvOp__SpvOpReadPipeBlockingINTEL: SpvOp_ = 5946;
pub const SpvOp__SpvOpWritePipeBlockingINTEL: SpvOp_ = 5947;
pub const SpvOp__SpvOpFPGARegINTEL: SpvOp_ = 5949;
pub const SpvOp__SpvOpRayQueryGetRayTMinKHR: SpvOp_ = 6016;
pub const SpvOp__SpvOpRayQueryGetRayFlagsKHR: SpvOp_ = 6017;
pub const SpvOp__SpvOpRayQueryGetIntersectionTKHR: SpvOp_ = 6018;
pub const SpvOp__SpvOpRayQueryGetIntersectionInstanceCustomIndexKHR: SpvOp_ = 6019;
pub const SpvOp__SpvOpRayQueryGetIntersectionInstanceIdKHR: SpvOp_ = 6020;
pub const SpvOp__SpvOpRayQueryGetIntersectionInstanceShaderBindingTableRecordOffsetKHR: SpvOp_ =
    6021;
pub const SpvOp__SpvOpRayQueryGetIntersectionGeometryIndexKHR: SpvOp_ = 6022;
pub const SpvOp__SpvOpRayQueryGetIntersectionPrimitiveIndexKHR: SpvOp_ = 6023;
pub const SpvOp__SpvOpRayQueryGetIntersectionBarycentricsKHR: SpvOp_ = 6024;
pub const SpvOp__SpvOpRayQueryGetIntersectionFrontFaceKHR: SpvOp_ = 6025;
pub const SpvOp__SpvOpRayQueryGetIntersectionCandidateAABBOpaqueKHR: SpvOp_ = 6026;
pub const SpvOp__SpvOpRayQueryGetIntersectionObjectRayDirectionKHR: SpvOp_ = 6027;
pub const SpvOp__SpvOpRayQueryGetIntersectionObjectRayOriginKHR: SpvOp_ = 6028;
pub const SpvOp__SpvOpRayQueryGetWorldRayDirectionKHR: SpvOp_ = 6029;
pub const SpvOp__SpvOpRayQueryGetWorldRayOriginKHR: SpvOp_ = 6030;
pub const SpvOp__SpvOpRayQueryGetIntersectionObjectToWorldKHR: SpvOp_ = 6031;
pub const SpvOp__SpvOpRayQueryGetIntersectionWorldToObjectKHR: SpvOp_ = 6032;
pub const SpvOp__SpvOpAtomicFAddEXT: SpvOp_ = 6035;
pub const SpvOp__SpvOpTypeBufferSurfaceINTEL: SpvOp_ = 6086;
pub const SpvOp__SpvOpTypeStructContinuedINTEL: SpvOp_ = 6090;
pub const SpvOp__SpvOpConstantCompositeContinuedINTEL: SpvOp_ = 6091;
pub const SpvOp__SpvOpSpecConstantCompositeContinuedINTEL: SpvOp_ = 6092;
pub const SpvOp__SpvOpCompositeConstructContinuedINTEL: SpvOp_ = 6096;
pub const SpvOp__SpvOpConvertFToBF16INTEL: SpvOp_ = 6116;
pub const SpvOp__SpvOpConvertBF16ToFINTEL: SpvOp_ = 6117;
pub const SpvOp__SpvOpControlBarrierArriveINTEL: SpvOp_ = 6142;
pub const SpvOp__SpvOpControlBarrierWaitINTEL: SpvOp_ = 6143;
pub const SpvOp__SpvOpArithmeticFenceEXT: SpvOp_ = 6145;
pub const SpvOp__SpvOpTaskSequenceCreateINTEL: SpvOp_ = 6163;
pub const SpvOp__SpvOpTaskSequenceAsyncINTEL: SpvOp_ = 6164;
pub const SpvOp__SpvOpTaskSequenceGetINTEL: SpvOp_ = 6165;
pub const SpvOp__SpvOpTaskSequenceReleaseINTEL: SpvOp_ = 6166;
pub const SpvOp__SpvOpTypeTaskSequenceINTEL: SpvOp_ = 6199;
pub const SpvOp__SpvOpSubgroupBlockPrefetchINTEL: SpvOp_ = 6221;
pub const SpvOp__SpvOpSubgroup2DBlockLoadINTEL: SpvOp_ = 6231;
pub const SpvOp__SpvOpSubgroup2DBlockLoadTransformINTEL: SpvOp_ = 6232;
pub const SpvOp__SpvOpSubgroup2DBlockLoadTransposeINTEL: SpvOp_ = 6233;
pub const SpvOp__SpvOpSubgroup2DBlockPrefetchINTEL: SpvOp_ = 6234;
pub const SpvOp__SpvOpSubgroup2DBlockStoreINTEL: SpvOp_ = 6235;
pub const SpvOp__SpvOpSubgroupMatrixMultiplyAccumulateINTEL: SpvOp_ = 6237;
pub const SpvOp__SpvOpBitwiseFunctionINTEL: SpvOp_ = 6242;
pub const SpvOp__SpvOpUntypedVariableLengthArrayINTEL: SpvOp_ = 6244;
pub const SpvOp__SpvOpConditionalExtensionINTEL: SpvOp_ = 6248;
pub const SpvOp__SpvOpConditionalEntryPointINTEL: SpvOp_ = 6249;
pub const SpvOp__SpvOpConditionalCapabilityINTEL: SpvOp_ = 6250;
pub const SpvOp__SpvOpSpecConstantTargetINTEL: SpvOp_ = 6251;
pub const SpvOp__SpvOpSpecConstantArchitectureINTEL: SpvOp_ = 6252;
pub const SpvOp__SpvOpSpecConstantCapabilitiesINTEL: SpvOp_ = 6253;
pub const SpvOp__SpvOpConditionalCopyObjectINTEL: SpvOp_ = 6254;
pub const SpvOp__SpvOpGroupIMulKHR: SpvOp_ = 6401;
pub const SpvOp__SpvOpGroupFMulKHR: SpvOp_ = 6402;
pub const SpvOp__SpvOpGroupBitwiseAndKHR: SpvOp_ = 6403;
pub const SpvOp__SpvOpGroupBitwiseOrKHR: SpvOp_ = 6404;
pub const SpvOp__SpvOpGroupBitwiseXorKHR: SpvOp_ = 6405;
pub const SpvOp__SpvOpGroupLogicalAndKHR: SpvOp_ = 6406;
pub const SpvOp__SpvOpGroupLogicalOrKHR: SpvOp_ = 6407;
pub const SpvOp__SpvOpGroupLogicalXorKHR: SpvOp_ = 6408;
pub const SpvOp__SpvOpRoundFToTF32INTEL: SpvOp_ = 6426;
pub const SpvOp__SpvOpMaskedGatherINTEL: SpvOp_ = 6428;
pub const SpvOp__SpvOpMaskedScatterINTEL: SpvOp_ = 6429;
pub const SpvOp__SpvOpConvertHandleToImageINTEL: SpvOp_ = 6529;
pub const SpvOp__SpvOpConvertHandleToSamplerINTEL: SpvOp_ = 6530;
pub const SpvOp__SpvOpConvertHandleToSampledImageINTEL: SpvOp_ = 6531;
pub const SpvOp__SpvOpMax: SpvOp_ = 2147483647;
pub type SpvOp_ = ::std::os::raw::c_int;
pub use self::SpvOp_ as SpvOp;
extern "C" {
    pub fn spvc_get_version(
        major: *mut ::std::os::raw::c_uint,
        minor: *mut ::std::os::raw::c_uint,
        patch: *mut ::std::os::raw::c_uint,
    );
}
extern "C" {
    pub fn spvc_get_commit_revision_and_timestamp() -> *const ::std::os::raw::c_char;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct spvc_context_s {
    _unused: [u8; 0],
}
pub type spvc_context = *mut spvc_context_s;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct spvc_parsed_ir_s {
    _unused: [u8; 0],
}
pub type spvc_parsed_ir = *mut spvc_parsed_ir_s;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct spvc_compiler_s {
    _unused: [u8; 0],
}
pub type spvc_compiler = *mut spvc_compiler_s;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct spvc_compiler_options_s {
    _unused: [u8; 0],
}
pub type spvc_compiler_options = *mut spvc_compiler_options_s;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct spvc_resources_s {
    _unused: [u8; 0],
}
pub type spvc_resources = *mut spvc_resources_s;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct spvc_type_s {
    _unused: [u8; 0],
}
pub type spvc_type = *const spvc_type_s;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct spvc_constant_s {
    _unused: [u8; 0],
}
pub type spvc_constant = *mut spvc_constant_s;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct spvc_set_s {
    _unused: [u8; 0],
}
pub type spvc_set = *const spvc_set_s;
pub type spvc_type_id = SpvId;
pub type spvc_variable_id = SpvId;
pub type spvc_constant_id = SpvId;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct spvc_reflected_resource {
    pub id: spvc_variable_id,
    pub base_type_id: spvc_type_id,
    pub type_id: spvc_type_id,
    pub name: *const ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_spvc_reflected_resource() {
    const UNINIT: ::std::mem::MaybeUninit<spvc_reflected_resource> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<spvc_reflected_resource>(),
        24usize,
        concat!("Size of: ", stringify!(spvc_reflected_resource))
    );
    assert_eq!(
        ::std::mem::align_of::<spvc_reflected_resource>(),
        8usize,
        concat!("Alignment of ", stringify!(spvc_reflected_resource))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).id) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(spvc_reflected_resource),
            "::",
            stringify!(id)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).base_type_id) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(spvc_reflected_resource),
            "::",
            stringify!(base_type_id)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_id) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(spvc_reflected_resource),
            "::",
            stringify!(type_id)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).name) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(spvc_reflected_resource),
            "::",
            stringify!(name)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct spvc_reflected_builtin_resource {
    pub builtin: SpvBuiltIn,
    pub value_type_id: spvc_type_id,
    pub resource: spvc_reflected_resource,
}
#[test]
fn bindgen_test_layout_spvc_reflected_builtin_resource() {
    const UNINIT: ::std::mem::MaybeUninit<spvc_reflected_builtin_resource> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<spvc_reflected_builtin_resource>(),
        32usize,
        concat!("Size of: ", stringify!(spvc_reflected_builtin_resource))
    );
    assert_eq!(
        ::std::mem::align_of::<spvc_reflected_builtin_resource>(),
        8usize,
        concat!("Alignment of ", stringify!(spvc_reflected_builtin_resource))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).builtin) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(spvc_reflected_builtin_resource),
            "::",
            stringify!(builtin)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).value_type_id) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(spvc_reflected_builtin_resource),
            "::",
            stringify!(value_type_id)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).resource) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(spvc_reflected_builtin_resource),
            "::",
            stringify!(resource)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct spvc_entry_point {
    pub execution_model: SpvExecutionModel,
    pub name: *const ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_spvc_entry_point() {
    const UNINIT: ::std::mem::MaybeUninit<spvc_entry_point> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<spvc_entry_point>(),
        16usize,
        concat!("Size of: ", stringify!(spvc_entry_point))
    );
    assert_eq!(
        ::std::mem::align_of::<spvc_entry_point>(),
        8usize,
        concat!("Alignment of ", stringify!(spvc_entry_point))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).execution_model) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(spvc_entry_point),
            "::",
            stringify!(execution_model)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).name) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(spvc_entry_point),
            "::",
            stringify!(name)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct spvc_combined_image_sampler {
    pub combined_id: spvc_variable_id,
    pub image_id: spvc_variable_id,
    pub sampler_id: spvc_variable_id,
}
#[test]
fn bindgen_test_layout_spvc_combined_image_sampler() {
    const UNINIT: ::std::mem::MaybeUninit<spvc_combined_image_sampler> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<spvc_combined_image_sampler>(),
        12usize,
        concat!("Size of: ", stringify!(spvc_combined_image_sampler))
    );
    assert_eq!(
        ::std::mem::align_of::<spvc_combined_image_sampler>(),
        4usize,
        concat!("Alignment of ", stringify!(spvc_combined_image_sampler))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).combined_id) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(spvc_combined_image_sampler),
            "::",
            stringify!(combined_id)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).image_id) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(spvc_combined_image_sampler),
            "::",
            stringify!(image_id)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sampler_id) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(spvc_combined_image_sampler),
            "::",
            stringify!(sampler_id)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct spvc_specialization_constant {
    pub id: spvc_constant_id,
    pub constant_id: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout_spvc_specialization_constant() {
    const UNINIT: ::std::mem::MaybeUninit<spvc_specialization_constant> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<spvc_specialization_constant>(),
        8usize,
        concat!("Size of: ", stringify!(spvc_specialization_constant))
    );
    assert_eq!(
        ::std::mem::align_of::<spvc_specialization_constant>(),
        4usize,
        concat!("Alignment of ", stringify!(spvc_specialization_constant))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).id) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(spvc_specialization_constant),
            "::",
            stringify!(id)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).constant_id) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(spvc_specialization_constant),
            "::",
            stringify!(constant_id)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct spvc_buffer_range {
    pub index: ::std::os::raw::c_uint,
    pub offset: usize,
    pub range: usize,
}
#[test]
fn bindgen_test_layout_spvc_buffer_range() {
    const UNINIT: ::std::mem::MaybeUninit<spvc_buffer_range> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<spvc_buffer_range>(),
        24usize,
        concat!("Size of: ", stringify!(spvc_buffer_range))
    );
    assert_eq!(
        ::std::mem::align_of::<spvc_buffer_range>(),
        8usize,
        concat!("Alignment of ", stringify!(spvc_buffer_range))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).index) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(spvc_buffer_range),
            "::",
            stringify!(index)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).offset) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(spvc_buffer_range),
            "::",
            stringify!(offset)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).range) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(spvc_buffer_range),
            "::",
            stringify!(range)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct spvc_hlsl_root_constants {
    pub start: ::std::os::raw::c_uint,
    pub end: ::std::os::raw::c_uint,
    pub binding: ::std::os::raw::c_uint,
    pub space: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout_spvc_hlsl_root_constants() {
    const UNINIT: ::std::mem::MaybeUninit<spvc_hlsl_root_constants> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<spvc_hlsl_root_constants>(),
        16usize,
        concat!("Size of: ", stringify!(spvc_hlsl_root_constants))
    );
    assert_eq!(
        ::std::mem::align_of::<spvc_hlsl_root_constants>(),
        4usize,
        concat!("Alignment of ", stringify!(spvc_hlsl_root_constants))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).start) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(spvc_hlsl_root_constants),
            "::",
            stringify!(start)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).end) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(spvc_hlsl_root_constants),
            "::",
            stringify!(end)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).binding) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(spvc_hlsl_root_constants),
            "::",
            stringify!(binding)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).space) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(spvc_hlsl_root_constants),
            "::",
            stringify!(space)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct spvc_hlsl_vertex_attribute_remap {
    pub location: ::std::os::raw::c_uint,
    pub semantic: *const ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_spvc_hlsl_vertex_attribute_remap() {
    const UNINIT: ::std::mem::MaybeUninit<spvc_hlsl_vertex_attribute_remap> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<spvc_hlsl_vertex_attribute_remap>(),
        16usize,
        concat!("Size of: ", stringify!(spvc_hlsl_vertex_attribute_remap))
    );
    assert_eq!(
        ::std::mem::align_of::<spvc_hlsl_vertex_attribute_remap>(),
        8usize,
        concat!(
            "Alignment of ",
            stringify!(spvc_hlsl_vertex_attribute_remap)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).location) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(spvc_hlsl_vertex_attribute_remap),
            "::",
            stringify!(location)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).semantic) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(spvc_hlsl_vertex_attribute_remap),
            "::",
            stringify!(semantic)
        )
    );
}
pub type spvc_bool = ::std::os::raw::c_uchar;
pub const spvc_result_SPVC_SUCCESS: spvc_result = 0;
pub const spvc_result_SPVC_ERROR_INVALID_SPIRV: spvc_result = -1;
pub const spvc_result_SPVC_ERROR_UNSUPPORTED_SPIRV: spvc_result = -2;
pub const spvc_result_SPVC_ERROR_OUT_OF_MEMORY: spvc_result = -3;
pub const spvc_result_SPVC_ERROR_INVALID_ARGUMENT: spvc_result = -4;
pub const spvc_result_SPVC_ERROR_INT_MAX: spvc_result = 2147483647;
pub type spvc_result = ::std::os::raw::c_int;
pub const spvc_capture_mode_SPVC_CAPTURE_MODE_COPY: spvc_capture_mode = 0;
pub const spvc_capture_mode_SPVC_CAPTURE_MODE_TAKE_OWNERSHIP: spvc_capture_mode = 1;
pub const spvc_capture_mode_SPVC_CAPTURE_MODE_INT_MAX: spvc_capture_mode = 2147483647;
pub type spvc_capture_mode = ::std::os::raw::c_int;
pub const spvc_backend_SPVC_BACKEND_NONE: spvc_backend = 0;
pub const spvc_backend_SPVC_BACKEND_GLSL: spvc_backend = 1;
pub const spvc_backend_SPVC_BACKEND_HLSL: spvc_backend = 2;
pub const spvc_backend_SPVC_BACKEND_MSL: spvc_backend = 3;
pub const spvc_backend_SPVC_BACKEND_CPP: spvc_backend = 4;
pub const spvc_backend_SPVC_BACKEND_JSON: spvc_backend = 5;
pub const spvc_backend_SPVC_BACKEND_INT_MAX: spvc_backend = 2147483647;
pub type spvc_backend = ::std::os::raw::c_int;
pub const spvc_resource_type_SPVC_RESOURCE_TYPE_UNKNOWN: spvc_resource_type = 0;
pub const spvc_resource_type_SPVC_RESOURCE_TYPE_UNIFORM_BUFFER: spvc_resource_type = 1;
pub const spvc_resource_type_SPVC_RESOURCE_TYPE_STORAGE_BUFFER: spvc_resource_type = 2;
pub const spvc_resource_type_SPVC_RESOURCE_TYPE_STAGE_INPUT: spvc_resource_type = 3;
pub const spvc_resource_type_SPVC_RESOURCE_TYPE_STAGE_OUTPUT: spvc_resource_type = 4;
pub const spvc_resource_type_SPVC_RESOURCE_TYPE_SUBPASS_INPUT: spvc_resource_type = 5;
pub const spvc_resource_type_SPVC_RESOURCE_TYPE_STORAGE_IMAGE: spvc_resource_type = 6;
pub const spvc_resource_type_SPVC_RESOURCE_TYPE_SAMPLED_IMAGE: spvc_resource_type = 7;
pub const spvc_resource_type_SPVC_RESOURCE_TYPE_ATOMIC_COUNTER: spvc_resource_type = 8;
pub const spvc_resource_type_SPVC_RESOURCE_TYPE_PUSH_CONSTANT: spvc_resource_type = 9;
pub const spvc_resource_type_SPVC_RESOURCE_TYPE_SEPARATE_IMAGE: spvc_resource_type = 10;
pub const spvc_resource_type_SPVC_RESOURCE_TYPE_SEPARATE_SAMPLERS: spvc_resource_type = 11;
pub const spvc_resource_type_SPVC_RESOURCE_TYPE_ACCELERATION_STRUCTURE: spvc_resource_type = 12;
pub const spvc_resource_type_SPVC_RESOURCE_TYPE_RAY_QUERY: spvc_resource_type = 13;
pub const spvc_resource_type_SPVC_RESOURCE_TYPE_SHADER_RECORD_BUFFER: spvc_resource_type = 14;
pub const spvc_resource_type_SPVC_RESOURCE_TYPE_GL_PLAIN_UNIFORM: spvc_resource_type = 15;
pub const spvc_resource_type_SPVC_RESOURCE_TYPE_TENSOR: spvc_resource_type = 16;
pub const spvc_resource_type_SPVC_RESOURCE_TYPE_INT_MAX: spvc_resource_type = 2147483647;
pub type spvc_resource_type = ::std::os::raw::c_int;
pub const spvc_builtin_resource_type_SPVC_BUILTIN_RESOURCE_TYPE_UNKNOWN:
    spvc_builtin_resource_type = 0;
pub const spvc_builtin_resource_type_SPVC_BUILTIN_RESOURCE_TYPE_STAGE_INPUT:
    spvc_builtin_resource_type = 1;
pub const spvc_builtin_resource_type_SPVC_BUILTIN_RESOURCE_TYPE_STAGE_OUTPUT:
    spvc_builtin_resource_type = 2;
pub const spvc_builtin_resource_type_SPVC_BUILTIN_RESOURCE_TYPE_INT_MAX:
    spvc_builtin_resource_type = 2147483647;
pub type spvc_builtin_resource_type = ::std::os::raw::c_int;
pub const spvc_basetype_SPVC_BASETYPE_UNKNOWN: spvc_basetype = 0;
pub const spvc_basetype_SPVC_BASETYPE_VOID: spvc_basetype = 1;
pub const spvc_basetype_SPVC_BASETYPE_BOOLEAN: spvc_basetype = 2;
pub const spvc_basetype_SPVC_BASETYPE_INT8: spvc_basetype = 3;
pub const spvc_basetype_SPVC_BASETYPE_UINT8: spvc_basetype = 4;
pub const spvc_basetype_SPVC_BASETYPE_INT16: spvc_basetype = 5;
pub const spvc_basetype_SPVC_BASETYPE_UINT16: spvc_basetype = 6;
pub const spvc_basetype_SPVC_BASETYPE_INT32: spvc_basetype = 7;
pub const spvc_basetype_SPVC_BASETYPE_UINT32: spvc_basetype = 8;
pub const spvc_basetype_SPVC_BASETYPE_INT64: spvc_basetype = 9;
pub const spvc_basetype_SPVC_BASETYPE_UINT64: spvc_basetype = 10;
pub const spvc_basetype_SPVC_BASETYPE_ATOMIC_COUNTER: spvc_basetype = 11;
pub const spvc_basetype_SPVC_BASETYPE_FP16: spvc_basetype = 12;
pub const spvc_basetype_SPVC_BASETYPE_FP32: spvc_basetype = 13;
pub const spvc_basetype_SPVC_BASETYPE_FP64: spvc_basetype = 14;
pub const spvc_basetype_SPVC_BASETYPE_STRUCT: spvc_basetype = 15;
pub const spvc_basetype_SPVC_BASETYPE_IMAGE: spvc_basetype = 16;
pub const spvc_basetype_SPVC_BASETYPE_SAMPLED_IMAGE: spvc_basetype = 17;
pub const spvc_basetype_SPVC_BASETYPE_SAMPLER: spvc_basetype = 18;
pub const spvc_basetype_SPVC_BASETYPE_ACCELERATION_STRUCTURE: spvc_basetype = 19;
pub const spvc_basetype_SPVC_BASETYPE_INT_MAX: spvc_basetype = 2147483647;
pub type spvc_basetype = ::std::os::raw::c_int;
pub const spvc_msl_platform_SPVC_MSL_PLATFORM_IOS: spvc_msl_platform = 0;
pub const spvc_msl_platform_SPVC_MSL_PLATFORM_MACOS: spvc_msl_platform = 1;
pub const spvc_msl_platform_SPVC_MSL_PLATFORM_MAX_INT: spvc_msl_platform = 2147483647;
pub type spvc_msl_platform = ::std::os::raw::c_int;
pub const spvc_msl_index_type_SPVC_MSL_INDEX_TYPE_NONE: spvc_msl_index_type = 0;
pub const spvc_msl_index_type_SPVC_MSL_INDEX_TYPE_UINT16: spvc_msl_index_type = 1;
pub const spvc_msl_index_type_SPVC_MSL_INDEX_TYPE_UINT32: spvc_msl_index_type = 2;
pub const spvc_msl_index_type_SPVC_MSL_INDEX_TYPE_MAX_INT: spvc_msl_index_type = 2147483647;
pub type spvc_msl_index_type = ::std::os::raw::c_int;
pub const spvc_msl_shader_variable_format_SPVC_MSL_SHADER_VARIABLE_FORMAT_OTHER:
    spvc_msl_shader_variable_format = 0;
pub const spvc_msl_shader_variable_format_SPVC_MSL_SHADER_VARIABLE_FORMAT_UINT8:
    spvc_msl_shader_variable_format = 1;
pub const spvc_msl_shader_variable_format_SPVC_MSL_SHADER_VARIABLE_FORMAT_UINT16:
    spvc_msl_shader_variable_format = 2;
pub const spvc_msl_shader_variable_format_SPVC_MSL_SHADER_VARIABLE_FORMAT_ANY16:
    spvc_msl_shader_variable_format = 3;
pub const spvc_msl_shader_variable_format_SPVC_MSL_SHADER_VARIABLE_FORMAT_ANY32:
    spvc_msl_shader_variable_format = 4;
pub const spvc_msl_shader_variable_format_SPVC_MSL_VERTEX_FORMAT_OTHER:
    spvc_msl_shader_variable_format = 0;
pub const spvc_msl_shader_variable_format_SPVC_MSL_VERTEX_FORMAT_UINT8:
    spvc_msl_shader_variable_format = 1;
pub const spvc_msl_shader_variable_format_SPVC_MSL_VERTEX_FORMAT_UINT16:
    spvc_msl_shader_variable_format = 2;
pub const spvc_msl_shader_variable_format_SPVC_MSL_SHADER_INPUT_FORMAT_OTHER:
    spvc_msl_shader_variable_format = 0;
pub const spvc_msl_shader_variable_format_SPVC_MSL_SHADER_INPUT_FORMAT_UINT8:
    spvc_msl_shader_variable_format = 1;
pub const spvc_msl_shader_variable_format_SPVC_MSL_SHADER_INPUT_FORMAT_UINT16:
    spvc_msl_shader_variable_format = 2;
pub const spvc_msl_shader_variable_format_SPVC_MSL_SHADER_INPUT_FORMAT_ANY16:
    spvc_msl_shader_variable_format = 3;
pub const spvc_msl_shader_variable_format_SPVC_MSL_SHADER_INPUT_FORMAT_ANY32:
    spvc_msl_shader_variable_format = 4;
pub const spvc_msl_shader_variable_format_SPVC_MSL_SHADER_INPUT_FORMAT_INT_MAX:
    spvc_msl_shader_variable_format = 2147483647;
pub type spvc_msl_shader_variable_format = ::std::os::raw::c_int;
pub use self::spvc_msl_shader_variable_format as spvc_msl_shader_input_format;
pub use self::spvc_msl_shader_variable_format as spvc_msl_vertex_format;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct spvc_msl_vertex_attribute {
    pub location: ::std::os::raw::c_uint,
    pub msl_buffer: ::std::os::raw::c_uint,
    pub msl_offset: ::std::os::raw::c_uint,
    pub msl_stride: ::std::os::raw::c_uint,
    pub per_instance: spvc_bool,
    pub format: spvc_msl_vertex_format,
    pub builtin: SpvBuiltIn,
}
#[test]
fn bindgen_test_layout_spvc_msl_vertex_attribute() {
    const UNINIT: ::std::mem::MaybeUninit<spvc_msl_vertex_attribute> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<spvc_msl_vertex_attribute>(),
        28usize,
        concat!("Size of: ", stringify!(spvc_msl_vertex_attribute))
    );
    assert_eq!(
        ::std::mem::align_of::<spvc_msl_vertex_attribute>(),
        4usize,
        concat!("Alignment of ", stringify!(spvc_msl_vertex_attribute))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).location) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(spvc_msl_vertex_attribute),
            "::",
            stringify!(location)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).msl_buffer) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(spvc_msl_vertex_attribute),
            "::",
            stringify!(msl_buffer)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).msl_offset) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(spvc_msl_vertex_attribute),
            "::",
            stringify!(msl_offset)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).msl_stride) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(spvc_msl_vertex_attribute),
            "::",
            stringify!(msl_stride)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).per_instance) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(spvc_msl_vertex_attribute),
            "::",
            stringify!(per_instance)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).format) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(spvc_msl_vertex_attribute),
            "::",
            stringify!(format)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).builtin) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(spvc_msl_vertex_attribute),
            "::",
            stringify!(builtin)
        )
    );
}
extern "C" {
    pub fn spvc_msl_vertex_attribute_init(attr: *mut spvc_msl_vertex_attribute);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct spvc_msl_shader_interface_var {
    pub location: ::std::os::raw::c_uint,
    pub format: spvc_msl_vertex_format,
    pub builtin: SpvBuiltIn,
    pub vecsize: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout_spvc_msl_shader_interface_var() {
    const UNINIT: ::std::mem::MaybeUninit<spvc_msl_shader_interface_var> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<spvc_msl_shader_interface_var>(),
        16usize,
        concat!("Size of: ", stringify!(spvc_msl_shader_interface_var))
    );
    assert_eq!(
        ::std::mem::align_of::<spvc_msl_shader_interface_var>(),
        4usize,
        concat!("Alignment of ", stringify!(spvc_msl_shader_interface_var))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).location) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(spvc_msl_shader_interface_var),
            "::",
            stringify!(location)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).format) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(spvc_msl_shader_interface_var),
            "::",
            stringify!(format)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).builtin) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(spvc_msl_shader_interface_var),
            "::",
            stringify!(builtin)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).vecsize) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(spvc_msl_shader_interface_var),
            "::",
            stringify!(vecsize)
        )
    );
}
pub type spvc_msl_shader_input = spvc_msl_shader_interface_var;
extern "C" {
    pub fn spvc_msl_shader_interface_var_init(var: *mut spvc_msl_shader_interface_var);
}
extern "C" {
    pub fn spvc_msl_shader_input_init(input: *mut spvc_msl_shader_input);
}
pub const spvc_msl_shader_variable_rate_SPVC_MSL_SHADER_VARIABLE_RATE_PER_VERTEX:
    spvc_msl_shader_variable_rate = 0;
pub const spvc_msl_shader_variable_rate_SPVC_MSL_SHADER_VARIABLE_RATE_PER_PRIMITIVE:
    spvc_msl_shader_variable_rate = 1;
pub const spvc_msl_shader_variable_rate_SPVC_MSL_SHADER_VARIABLE_RATE_PER_PATCH:
    spvc_msl_shader_variable_rate = 2;
pub const spvc_msl_shader_variable_rate_SPVC_MSL_SHADER_VARIABLE_RATE_INT_MAX:
    spvc_msl_shader_variable_rate = 2147483647;
pub type spvc_msl_shader_variable_rate = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct spvc_msl_shader_interface_var_2 {
    pub location: ::std::os::raw::c_uint,
    pub format: spvc_msl_shader_variable_format,
    pub builtin: SpvBuiltIn,
    pub vecsize: ::std::os::raw::c_uint,
    pub rate: spvc_msl_shader_variable_rate,
}
#[test]
fn bindgen_test_layout_spvc_msl_shader_interface_var_2() {
    const UNINIT: ::std::mem::MaybeUninit<spvc_msl_shader_interface_var_2> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<spvc_msl_shader_interface_var_2>(),
        20usize,
        concat!("Size of: ", stringify!(spvc_msl_shader_interface_var_2))
    );
    assert_eq!(
        ::std::mem::align_of::<spvc_msl_shader_interface_var_2>(),
        4usize,
        concat!("Alignment of ", stringify!(spvc_msl_shader_interface_var_2))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).location) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(spvc_msl_shader_interface_var_2),
            "::",
            stringify!(location)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).format) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(spvc_msl_shader_interface_var_2),
            "::",
            stringify!(format)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).builtin) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(spvc_msl_shader_interface_var_2),
            "::",
            stringify!(builtin)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).vecsize) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(spvc_msl_shader_interface_var_2),
            "::",
            stringify!(vecsize)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).rate) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(spvc_msl_shader_interface_var_2),
            "::",
            stringify!(rate)
        )
    );
}
extern "C" {
    pub fn spvc_msl_shader_interface_var_init_2(var: *mut spvc_msl_shader_interface_var_2);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct spvc_msl_resource_binding {
    pub stage: SpvExecutionModel,
    pub desc_set: ::std::os::raw::c_uint,
    pub binding: ::std::os::raw::c_uint,
    pub msl_buffer: ::std::os::raw::c_uint,
    pub msl_texture: ::std::os::raw::c_uint,
    pub msl_sampler: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout_spvc_msl_resource_binding() {
    const UNINIT: ::std::mem::MaybeUninit<spvc_msl_resource_binding> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<spvc_msl_resource_binding>(),
        24usize,
        concat!("Size of: ", stringify!(spvc_msl_resource_binding))
    );
    assert_eq!(
        ::std::mem::align_of::<spvc_msl_resource_binding>(),
        4usize,
        concat!("Alignment of ", stringify!(spvc_msl_resource_binding))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).stage) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(spvc_msl_resource_binding),
            "::",
            stringify!(stage)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).desc_set) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(spvc_msl_resource_binding),
            "::",
            stringify!(desc_set)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).binding) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(spvc_msl_resource_binding),
            "::",
            stringify!(binding)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).msl_buffer) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(spvc_msl_resource_binding),
            "::",
            stringify!(msl_buffer)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).msl_texture) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(spvc_msl_resource_binding),
            "::",
            stringify!(msl_texture)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).msl_sampler) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(spvc_msl_resource_binding),
            "::",
            stringify!(msl_sampler)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct spvc_msl_resource_binding_2 {
    pub stage: SpvExecutionModel,
    pub desc_set: ::std::os::raw::c_uint,
    pub binding: ::std::os::raw::c_uint,
    pub count: ::std::os::raw::c_uint,
    pub msl_buffer: ::std::os::raw::c_uint,
    pub msl_texture: ::std::os::raw::c_uint,
    pub msl_sampler: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout_spvc_msl_resource_binding_2() {
    const UNINIT: ::std::mem::MaybeUninit<spvc_msl_resource_binding_2> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<spvc_msl_resource_binding_2>(),
        28usize,
        concat!("Size of: ", stringify!(spvc_msl_resource_binding_2))
    );
    assert_eq!(
        ::std::mem::align_of::<spvc_msl_resource_binding_2>(),
        4usize,
        concat!("Alignment of ", stringify!(spvc_msl_resource_binding_2))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).stage) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(spvc_msl_resource_binding_2),
            "::",
            stringify!(stage)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).desc_set) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(spvc_msl_resource_binding_2),
            "::",
            stringify!(desc_set)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).binding) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(spvc_msl_resource_binding_2),
            "::",
            stringify!(binding)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).count) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(spvc_msl_resource_binding_2),
            "::",
            stringify!(count)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).msl_buffer) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(spvc_msl_resource_binding_2),
            "::",
            stringify!(msl_buffer)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).msl_texture) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(spvc_msl_resource_binding_2),
            "::",
            stringify!(msl_texture)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).msl_sampler) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(spvc_msl_resource_binding_2),
            "::",
            stringify!(msl_sampler)
        )
    );
}
extern "C" {
    pub fn spvc_msl_resource_binding_init(binding: *mut spvc_msl_resource_binding);
}
extern "C" {
    pub fn spvc_msl_resource_binding_init_2(binding: *mut spvc_msl_resource_binding_2);
}
extern "C" {
    pub fn spvc_msl_get_aux_buffer_struct_version() -> ::std::os::raw::c_uint;
}
pub const spvc_msl_sampler_coord_SPVC_MSL_SAMPLER_COORD_NORMALIZED: spvc_msl_sampler_coord = 0;
pub const spvc_msl_sampler_coord_SPVC_MSL_SAMPLER_COORD_PIXEL: spvc_msl_sampler_coord = 1;
pub const spvc_msl_sampler_coord_SPVC_MSL_SAMPLER_INT_MAX: spvc_msl_sampler_coord = 2147483647;
pub type spvc_msl_sampler_coord = ::std::os::raw::c_int;
pub const spvc_msl_sampler_filter_SPVC_MSL_SAMPLER_FILTER_NEAREST: spvc_msl_sampler_filter = 0;
pub const spvc_msl_sampler_filter_SPVC_MSL_SAMPLER_FILTER_LINEAR: spvc_msl_sampler_filter = 1;
pub const spvc_msl_sampler_filter_SPVC_MSL_SAMPLER_FILTER_INT_MAX: spvc_msl_sampler_filter =
    2147483647;
pub type spvc_msl_sampler_filter = ::std::os::raw::c_int;
pub const spvc_msl_sampler_mip_filter_SPVC_MSL_SAMPLER_MIP_FILTER_NONE:
    spvc_msl_sampler_mip_filter = 0;
pub const spvc_msl_sampler_mip_filter_SPVC_MSL_SAMPLER_MIP_FILTER_NEAREST:
    spvc_msl_sampler_mip_filter = 1;
pub const spvc_msl_sampler_mip_filter_SPVC_MSL_SAMPLER_MIP_FILTER_LINEAR:
    spvc_msl_sampler_mip_filter = 2;
pub const spvc_msl_sampler_mip_filter_SPVC_MSL_SAMPLER_MIP_FILTER_INT_MAX:
    spvc_msl_sampler_mip_filter = 2147483647;
pub type spvc_msl_sampler_mip_filter = ::std::os::raw::c_int;
pub const spvc_msl_sampler_address_SPVC_MSL_SAMPLER_ADDRESS_CLAMP_TO_ZERO:
    spvc_msl_sampler_address = 0;
pub const spvc_msl_sampler_address_SPVC_MSL_SAMPLER_ADDRESS_CLAMP_TO_EDGE:
    spvc_msl_sampler_address = 1;
pub const spvc_msl_sampler_address_SPVC_MSL_SAMPLER_ADDRESS_CLAMP_TO_BORDER:
    spvc_msl_sampler_address = 2;
pub const spvc_msl_sampler_address_SPVC_MSL_SAMPLER_ADDRESS_REPEAT: spvc_msl_sampler_address = 3;
pub const spvc_msl_sampler_address_SPVC_MSL_SAMPLER_ADDRESS_MIRRORED_REPEAT:
    spvc_msl_sampler_address = 4;
pub const spvc_msl_sampler_address_SPVC_MSL_SAMPLER_ADDRESS_INT_MAX: spvc_msl_sampler_address =
    2147483647;
pub type spvc_msl_sampler_address = ::std::os::raw::c_int;
pub const spvc_msl_sampler_compare_func_SPVC_MSL_SAMPLER_COMPARE_FUNC_NEVER:
    spvc_msl_sampler_compare_func = 0;
pub const spvc_msl_sampler_compare_func_SPVC_MSL_SAMPLER_COMPARE_FUNC_LESS:
    spvc_msl_sampler_compare_func = 1;
pub const spvc_msl_sampler_compare_func_SPVC_MSL_SAMPLER_COMPARE_FUNC_LESS_EQUAL:
    spvc_msl_sampler_compare_func = 2;
pub const spvc_msl_sampler_compare_func_SPVC_MSL_SAMPLER_COMPARE_FUNC_GREATER:
    spvc_msl_sampler_compare_func = 3;
pub const spvc_msl_sampler_compare_func_SPVC_MSL_SAMPLER_COMPARE_FUNC_GREATER_EQUAL:
    spvc_msl_sampler_compare_func = 4;
pub const spvc_msl_sampler_compare_func_SPVC_MSL_SAMPLER_COMPARE_FUNC_EQUAL:
    spvc_msl_sampler_compare_func = 5;
pub const spvc_msl_sampler_compare_func_SPVC_MSL_SAMPLER_COMPARE_FUNC_NOT_EQUAL:
    spvc_msl_sampler_compare_func = 6;
pub const spvc_msl_sampler_compare_func_SPVC_MSL_SAMPLER_COMPARE_FUNC_ALWAYS:
    spvc_msl_sampler_compare_func = 7;
pub const spvc_msl_sampler_compare_func_SPVC_MSL_SAMPLER_COMPARE_FUNC_INT_MAX:
    spvc_msl_sampler_compare_func = 2147483647;
pub type spvc_msl_sampler_compare_func = ::std::os::raw::c_int;
pub const spvc_msl_sampler_border_color_SPVC_MSL_SAMPLER_BORDER_COLOR_TRANSPARENT_BLACK:
    spvc_msl_sampler_border_color = 0;
pub const spvc_msl_sampler_border_color_SPVC_MSL_SAMPLER_BORDER_COLOR_OPAQUE_BLACK:
    spvc_msl_sampler_border_color = 1;
pub const spvc_msl_sampler_border_color_SPVC_MSL_SAMPLER_BORDER_COLOR_OPAQUE_WHITE:
    spvc_msl_sampler_border_color = 2;
pub const spvc_msl_sampler_border_color_SPVC_MSL_SAMPLER_BORDER_COLOR_INT_MAX:
    spvc_msl_sampler_border_color = 2147483647;
pub type spvc_msl_sampler_border_color = ::std::os::raw::c_int;
pub const spvc_msl_format_resolution_SPVC_MSL_FORMAT_RESOLUTION_444: spvc_msl_format_resolution = 0;
pub const spvc_msl_format_resolution_SPVC_MSL_FORMAT_RESOLUTION_422: spvc_msl_format_resolution = 1;
pub const spvc_msl_format_resolution_SPVC_MSL_FORMAT_RESOLUTION_420: spvc_msl_format_resolution = 2;
pub const spvc_msl_format_resolution_SPVC_MSL_FORMAT_RESOLUTION_INT_MAX:
    spvc_msl_format_resolution = 2147483647;
pub type spvc_msl_format_resolution = ::std::os::raw::c_int;
pub const spvc_msl_chroma_location_SPVC_MSL_CHROMA_LOCATION_COSITED_EVEN: spvc_msl_chroma_location =
    0;
pub const spvc_msl_chroma_location_SPVC_MSL_CHROMA_LOCATION_MIDPOINT: spvc_msl_chroma_location = 1;
pub const spvc_msl_chroma_location_SPVC_MSL_CHROMA_LOCATION_INT_MAX: spvc_msl_chroma_location =
    2147483647;
pub type spvc_msl_chroma_location = ::std::os::raw::c_int;
pub const spvc_msl_component_swizzle_SPVC_MSL_COMPONENT_SWIZZLE_IDENTITY:
    spvc_msl_component_swizzle = 0;
pub const spvc_msl_component_swizzle_SPVC_MSL_COMPONENT_SWIZZLE_ZERO: spvc_msl_component_swizzle =
    1;
pub const spvc_msl_component_swizzle_SPVC_MSL_COMPONENT_SWIZZLE_ONE: spvc_msl_component_swizzle = 2;
pub const spvc_msl_component_swizzle_SPVC_MSL_COMPONENT_SWIZZLE_R: spvc_msl_component_swizzle = 3;
pub const spvc_msl_component_swizzle_SPVC_MSL_COMPONENT_SWIZZLE_G: spvc_msl_component_swizzle = 4;
pub const spvc_msl_component_swizzle_SPVC_MSL_COMPONENT_SWIZZLE_B: spvc_msl_component_swizzle = 5;
pub const spvc_msl_component_swizzle_SPVC_MSL_COMPONENT_SWIZZLE_A: spvc_msl_component_swizzle = 6;
pub const spvc_msl_component_swizzle_SPVC_MSL_COMPONENT_SWIZZLE_INT_MAX:
    spvc_msl_component_swizzle = 2147483647;
pub type spvc_msl_component_swizzle = ::std::os::raw::c_int;
pub const spvc_msl_sampler_ycbcr_model_conversion_SPVC_MSL_SAMPLER_YCBCR_MODEL_CONVERSION_RGB_IDENTITY : spvc_msl_sampler_ycbcr_model_conversion = 0 ;
pub const spvc_msl_sampler_ycbcr_model_conversion_SPVC_MSL_SAMPLER_YCBCR_MODEL_CONVERSION_YCBCR_IDENTITY : spvc_msl_sampler_ycbcr_model_conversion = 1 ;
pub const spvc_msl_sampler_ycbcr_model_conversion_SPVC_MSL_SAMPLER_YCBCR_MODEL_CONVERSION_YCBCR_BT_709 : spvc_msl_sampler_ycbcr_model_conversion = 2 ;
pub const spvc_msl_sampler_ycbcr_model_conversion_SPVC_MSL_SAMPLER_YCBCR_MODEL_CONVERSION_YCBCR_BT_601 : spvc_msl_sampler_ycbcr_model_conversion = 3 ;
pub const spvc_msl_sampler_ycbcr_model_conversion_SPVC_MSL_SAMPLER_YCBCR_MODEL_CONVERSION_YCBCR_BT_2020 : spvc_msl_sampler_ycbcr_model_conversion = 4 ;
pub const spvc_msl_sampler_ycbcr_model_conversion_SPVC_MSL_SAMPLER_YCBCR_MODEL_CONVERSION_INT_MAX : spvc_msl_sampler_ycbcr_model_conversion = 2147483647 ;
pub type spvc_msl_sampler_ycbcr_model_conversion = ::std::os::raw::c_int;
pub const spvc_msl_sampler_ycbcr_range_SPVC_MSL_SAMPLER_YCBCR_RANGE_ITU_FULL:
    spvc_msl_sampler_ycbcr_range = 0;
pub const spvc_msl_sampler_ycbcr_range_SPVC_MSL_SAMPLER_YCBCR_RANGE_ITU_NARROW:
    spvc_msl_sampler_ycbcr_range = 1;
pub const spvc_msl_sampler_ycbcr_range_SPVC_MSL_SAMPLER_YCBCR_RANGE_INT_MAX:
    spvc_msl_sampler_ycbcr_range = 2147483647;
pub type spvc_msl_sampler_ycbcr_range = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct spvc_msl_constexpr_sampler {
    pub coord: spvc_msl_sampler_coord,
    pub min_filter: spvc_msl_sampler_filter,
    pub mag_filter: spvc_msl_sampler_filter,
    pub mip_filter: spvc_msl_sampler_mip_filter,
    pub s_address: spvc_msl_sampler_address,
    pub t_address: spvc_msl_sampler_address,
    pub r_address: spvc_msl_sampler_address,
    pub compare_func: spvc_msl_sampler_compare_func,
    pub border_color: spvc_msl_sampler_border_color,
    pub lod_clamp_min: f32,
    pub lod_clamp_max: f32,
    pub max_anisotropy: ::std::os::raw::c_int,
    pub compare_enable: spvc_bool,
    pub lod_clamp_enable: spvc_bool,
    pub anisotropy_enable: spvc_bool,
}
#[test]
fn bindgen_test_layout_spvc_msl_constexpr_sampler() {
    const UNINIT: ::std::mem::MaybeUninit<spvc_msl_constexpr_sampler> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<spvc_msl_constexpr_sampler>(),
        52usize,
        concat!("Size of: ", stringify!(spvc_msl_constexpr_sampler))
    );
    assert_eq!(
        ::std::mem::align_of::<spvc_msl_constexpr_sampler>(),
        4usize,
        concat!("Alignment of ", stringify!(spvc_msl_constexpr_sampler))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).coord) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(spvc_msl_constexpr_sampler),
            "::",
            stringify!(coord)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).min_filter) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(spvc_msl_constexpr_sampler),
            "::",
            stringify!(min_filter)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mag_filter) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(spvc_msl_constexpr_sampler),
            "::",
            stringify!(mag_filter)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mip_filter) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(spvc_msl_constexpr_sampler),
            "::",
            stringify!(mip_filter)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).s_address) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(spvc_msl_constexpr_sampler),
            "::",
            stringify!(s_address)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).t_address) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(spvc_msl_constexpr_sampler),
            "::",
            stringify!(t_address)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).r_address) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(spvc_msl_constexpr_sampler),
            "::",
            stringify!(r_address)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).compare_func) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(spvc_msl_constexpr_sampler),
            "::",
            stringify!(compare_func)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).border_color) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(spvc_msl_constexpr_sampler),
            "::",
            stringify!(border_color)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).lod_clamp_min) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(spvc_msl_constexpr_sampler),
            "::",
            stringify!(lod_clamp_min)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).lod_clamp_max) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(spvc_msl_constexpr_sampler),
            "::",
            stringify!(lod_clamp_max)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).max_anisotropy) as usize - ptr as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(spvc_msl_constexpr_sampler),
            "::",
            stringify!(max_anisotropy)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).compare_enable) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(spvc_msl_constexpr_sampler),
            "::",
            stringify!(compare_enable)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).lod_clamp_enable) as usize - ptr as usize },
        49usize,
        concat!(
            "Offset of field: ",
            stringify!(spvc_msl_constexpr_sampler),
            "::",
            stringify!(lod_clamp_enable)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).anisotropy_enable) as usize - ptr as usize },
        50usize,
        concat!(
            "Offset of field: ",
            stringify!(spvc_msl_constexpr_sampler),
            "::",
            stringify!(anisotropy_enable)
        )
    );
}
extern "C" {
    pub fn spvc_msl_constexpr_sampler_init(sampler: *mut spvc_msl_constexpr_sampler);
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct spvc_msl_sampler_ycbcr_conversion {
    pub planes: ::std::os::raw::c_uint,
    pub resolution: spvc_msl_format_resolution,
    pub chroma_filter: spvc_msl_sampler_filter,
    pub x_chroma_offset: spvc_msl_chroma_location,
    pub y_chroma_offset: spvc_msl_chroma_location,
    pub swizzle: [spvc_msl_component_swizzle; 4usize],
    pub ycbcr_model: spvc_msl_sampler_ycbcr_model_conversion,
    pub ycbcr_range: spvc_msl_sampler_ycbcr_range,
    pub bpc: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout_spvc_msl_sampler_ycbcr_conversion() {
    const UNINIT: ::std::mem::MaybeUninit<spvc_msl_sampler_ycbcr_conversion> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<spvc_msl_sampler_ycbcr_conversion>(),
        48usize,
        concat!("Size of: ", stringify!(spvc_msl_sampler_ycbcr_conversion))
    );
    assert_eq!(
        ::std::mem::align_of::<spvc_msl_sampler_ycbcr_conversion>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(spvc_msl_sampler_ycbcr_conversion)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).planes) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(spvc_msl_sampler_ycbcr_conversion),
            "::",
            stringify!(planes)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).resolution) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(spvc_msl_sampler_ycbcr_conversion),
            "::",
            stringify!(resolution)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).chroma_filter) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(spvc_msl_sampler_ycbcr_conversion),
            "::",
            stringify!(chroma_filter)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).x_chroma_offset) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(spvc_msl_sampler_ycbcr_conversion),
            "::",
            stringify!(x_chroma_offset)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).y_chroma_offset) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(spvc_msl_sampler_ycbcr_conversion),
            "::",
            stringify!(y_chroma_offset)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).swizzle) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(spvc_msl_sampler_ycbcr_conversion),
            "::",
            stringify!(swizzle)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ycbcr_model) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(spvc_msl_sampler_ycbcr_conversion),
            "::",
            stringify!(ycbcr_model)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ycbcr_range) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(spvc_msl_sampler_ycbcr_conversion),
            "::",
            stringify!(ycbcr_range)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bpc) as usize - ptr as usize },
        44usize,
        concat!(
            "Offset of field: ",
            stringify!(spvc_msl_sampler_ycbcr_conversion),
            "::",
            stringify!(bpc)
        )
    );
}
extern "C" {
    pub fn spvc_msl_sampler_ycbcr_conversion_init(conv: *mut spvc_msl_sampler_ycbcr_conversion);
}
pub const spvc_hlsl_binding_flag_bits_SPVC_HLSL_BINDING_AUTO_NONE_BIT: spvc_hlsl_binding_flag_bits =
    0;
pub const spvc_hlsl_binding_flag_bits_SPVC_HLSL_BINDING_AUTO_PUSH_CONSTANT_BIT:
    spvc_hlsl_binding_flag_bits = 1;
pub const spvc_hlsl_binding_flag_bits_SPVC_HLSL_BINDING_AUTO_CBV_BIT: spvc_hlsl_binding_flag_bits =
    2;
pub const spvc_hlsl_binding_flag_bits_SPVC_HLSL_BINDING_AUTO_SRV_BIT: spvc_hlsl_binding_flag_bits =
    4;
pub const spvc_hlsl_binding_flag_bits_SPVC_HLSL_BINDING_AUTO_UAV_BIT: spvc_hlsl_binding_flag_bits =
    8;
pub const spvc_hlsl_binding_flag_bits_SPVC_HLSL_BINDING_AUTO_SAMPLER_BIT:
    spvc_hlsl_binding_flag_bits = 16;
pub const spvc_hlsl_binding_flag_bits_SPVC_HLSL_BINDING_AUTO_ALL: spvc_hlsl_binding_flag_bits =
    2147483647;
pub type spvc_hlsl_binding_flag_bits = ::std::os::raw::c_int;
pub type spvc_hlsl_binding_flags = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct spvc_hlsl_resource_binding_mapping {
    pub register_space: ::std::os::raw::c_uint,
    pub register_binding: ::std::os::raw::c_uint,
}
#[test]
fn bindgen_test_layout_spvc_hlsl_resource_binding_mapping() {
    const UNINIT: ::std::mem::MaybeUninit<spvc_hlsl_resource_binding_mapping> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<spvc_hlsl_resource_binding_mapping>(),
        8usize,
        concat!("Size of: ", stringify!(spvc_hlsl_resource_binding_mapping))
    );
    assert_eq!(
        ::std::mem::align_of::<spvc_hlsl_resource_binding_mapping>(),
        4usize,
        concat!(
            "Alignment of ",
            stringify!(spvc_hlsl_resource_binding_mapping)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).register_space) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(spvc_hlsl_resource_binding_mapping),
            "::",
            stringify!(register_space)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).register_binding) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(spvc_hlsl_resource_binding_mapping),
            "::",
            stringify!(register_binding)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct spvc_hlsl_resource_binding {
    pub stage: SpvExecutionModel,
    pub desc_set: ::std::os::raw::c_uint,
    pub binding: ::std::os::raw::c_uint,
    pub cbv: spvc_hlsl_resource_binding_mapping,
    pub uav: spvc_hlsl_resource_binding_mapping,
    pub srv: spvc_hlsl_resource_binding_mapping,
    pub sampler: spvc_hlsl_resource_binding_mapping,
}
#[test]
fn bindgen_test_layout_spvc_hlsl_resource_binding() {
    const UNINIT: ::std::mem::MaybeUninit<spvc_hlsl_resource_binding> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<spvc_hlsl_resource_binding>(),
        44usize,
        concat!("Size of: ", stringify!(spvc_hlsl_resource_binding))
    );
    assert_eq!(
        ::std::mem::align_of::<spvc_hlsl_resource_binding>(),
        4usize,
        concat!("Alignment of ", stringify!(spvc_hlsl_resource_binding))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).stage) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(spvc_hlsl_resource_binding),
            "::",
            stringify!(stage)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).desc_set) as usize - ptr as usize },
        4usize,
        concat!(
            "Offset of field: ",
            stringify!(spvc_hlsl_resource_binding),
            "::",
            stringify!(desc_set)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).binding) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(spvc_hlsl_resource_binding),
            "::",
            stringify!(binding)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cbv) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(spvc_hlsl_resource_binding),
            "::",
            stringify!(cbv)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).uav) as usize - ptr as usize },
        20usize,
        concat!(
            "Offset of field: ",
            stringify!(spvc_hlsl_resource_binding),
            "::",
            stringify!(uav)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).srv) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(spvc_hlsl_resource_binding),
            "::",
            stringify!(srv)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sampler) as usize - ptr as usize },
        36usize,
        concat!(
            "Offset of field: ",
            stringify!(spvc_hlsl_resource_binding),
            "::",
            stringify!(sampler)
        )
    );
}
extern "C" {
    pub fn spvc_hlsl_resource_binding_init(binding: *mut spvc_hlsl_resource_binding);
}
pub const spvc_compiler_option_SPVC_COMPILER_OPTION_UNKNOWN: spvc_compiler_option = 0;
pub const spvc_compiler_option_SPVC_COMPILER_OPTION_FORCE_TEMPORARY: spvc_compiler_option =
    16777217;
pub const spvc_compiler_option_SPVC_COMPILER_OPTION_FLATTEN_MULTIDIMENSIONAL_ARRAYS:
    spvc_compiler_option = 16777218;
pub const spvc_compiler_option_SPVC_COMPILER_OPTION_FIXUP_DEPTH_CONVENTION: spvc_compiler_option =
    16777219;
pub const spvc_compiler_option_SPVC_COMPILER_OPTION_FLIP_VERTEX_Y: spvc_compiler_option = 16777220;
pub const spvc_compiler_option_SPVC_COMPILER_OPTION_GLSL_SUPPORT_NONZERO_BASE_INSTANCE:
    spvc_compiler_option = 33554437;
pub const spvc_compiler_option_SPVC_COMPILER_OPTION_GLSL_SEPARATE_SHADER_OBJECTS:
